[{"ID":"lifeandstyle\/2022\/nov\/28\/a-new-start-after-60-i-quit-drinking-and-learned-to-make-guitars","URL":"https:\/\/www.theguardian.com\/lifeandstyle\/2022\/nov\/28\/a-new-start-after-60-i-quit-drinking-and-learned-to-make-guitars","DATE":"2022-11-28","PLAIN_TEXT":"When Paul Edwards left school at 15, he headed to the careers office in Salford, Greater Manchester, to speak to the man behind the glass hatch. The careers officer riffled through his little box of cards, and pulled out two. One card advertised a vacancy for a violin-makers apprentice; the other for a precision grinder, which paid twice as much. Edwards mother told him there was no choice. He became a precision grinder. He must have thought about this fork in the road many times since, because two years ago, at 62, he built a guitar. And the first thing I thought was: Why didnt I do this when I left school? Instead, he hopped from place to place, following work or girlfriends. I never really had a career path, he says. He had worked from the age of 12, painting ships alongside his father in the docks at Old Trafford. You grow up fast when youre the oldest of six boys. Edwards childhood home was full of music. My mum was singing all the time. I can still hear her now. One day my prince will come ...  The radio was always on. We had records. At 13, Edwards saved his wages and bought a PS50 bass on hire-purchase. It was red, shiny and beautiful. He had always been good with his hands, so when the precision grinding didnt work out, he got a job as a stagehand at the Davenport theatre in Stockport - his first step into the arts world. Further stints in the same vein followed - building sets at Cambridge Arts theatre, and working for a company that made structures for rich peoples parties. After he got married at 30, and had two children with his now ex-wife, music mostly faded from Edwards life. His childhood bass broke. He did a degree in civil engineering, became a maths teacher in Sussex, and when his marriage ended, turned to drink: Two or three bottles of wine with a meal. Then I started drinking spirits, he says. He returned to Salford in 2016 to care for his mum. Health problems - from breathing in sawdust for 20 years - made it impossible to work. His brother Graham gave him a guitar to fix. An old broken Fender, Edwards says. He wasnt interested in Fenders. He liked Gretsches. He said: You can have this if you want. It was in bits. I looked at it for a while, and didnt do anything with it. I had that Fender my brother had given me. So I decided Id do something about it - basically thinking of him When his mum died in 2018, Edwards drinking got worse. Then, two years later, Graham died suddenly in his sleep, and Edwards fell into a deeper despair. That was just a killer. He was supposed to be coming round the next night. It wasnt like he didnt have any plans. I went mad on the booze. In the two weeks between Grahams death and his funeral, I was waking up on the floor. Occasionally, Id have two bottles of rum a day. It was so stupid. He thought of ending his life. I thought: Should have been me, you know? Not him. Im the oldest. Hes 10 years younger than me. I used to change his nappy. Edwards was always a helpful child. My mum used to call me her little prince, he says, and saying the words makes him laugh. A week after Grahams funeral, Edwards had a realisation. I dont know why. Something made me stop. I just thought: This is stupid. I had that Fender hed given me. So I decided Id do something about it - basically thinking of him. He set about putting the pieces together. Since then Ive been hooked on it. He had other broken guitars lying around. He overhauled his shiny childhood bass, which is now a jigsaw of differently grained woods. Then he thought, Why dont I make one from scratch? Ive got skills. I had the tools. Now he has music and craft in his life, and he hasnt had a drink since 2020. Im learning things all the time. Creating new things that I think are beautiful, he says. The Telecaster that Graham had given him now features a sunburst of grained veneers. He plays along to Bob Dylan or JJ Cale, and occasionally Ill find the right key before the songs finished. Im not that good, he says. But Im not playing for anybody else. Im doing it for me. Im doing it to make me feel nice. And it does. Its better than any drugs. Tell us: has your life taken a new direction after the age of 60? * In the UK and Ireland, Samaritans can be contacted on 116 123, or email jo@samaritans.org or jo@samaritans.ie. In the US, the National Suicide Prevention Lifeline is 1-800-273-8255. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org.","SOURCE":"The Guardian"},{"ID":"money\/2022\/may\/17\/hot-desking-tea-rounds-and-surviving-meeting-irl-the-new-rules-of-the-office","URL":"https:\/\/www.theguardian.com\/money\/2022\/may\/17\/hot-desking-tea-rounds-and-surviving-meeting-irl-the-new-rules-of-the-office","DATE":"2022-05-17","PLAIN_TEXT":"After two years of lockdowns, offices are almost unrecognisable. In many of them, staff are returning under a hybrid model, working from home a few days a week and coming in for the others. Some organisations slashed their floor space during the pandemic, making what is left feel distinctly cramped, while others have removed desks, and look a lot like departure lounges. A lot of us are hot-desking for the first time in our working lives, without a desk, chair, computer or pot plant to call our own. And people have changed, too. Much to the disgust of Jacob Rees-Mogg and Boris Johnson, after two years of WFH we have got used to wearing jogging pants, talking to our pets, cooking our own lunches, picking children up from school and doing mid-morning naked yoga while also getting our work done. So, as the commuter trains start to fill once more and the mug cupboard gets its first proper action since early 2020, what are the rules of this new office life? How do I survive all these meetings? At least when I was Zooming I could pretend the wifi had gone down. When it comes to meetings, we should be having less of them, argues Cary Cooper, professor of organisational psychology and health at the Alliance Manchester Business School, and co-author of Remote Workplace Culture. If you have them, have them quick and have them late. Instead of having it at 9 oclock where it can go on until 12, have it at 11.30, because everyone gets hungry at 12.30. Three-hour meetings are useless. Reach your goddamn decision and dont have game-playing. You can also set an alarm on your phone to go off 10 minutes into one of those scheduled informal chats that can fill the soul with dread. Once your phone starts vibrating, you can claim its an urgent call to do something - anything - else. And if someone corners you when youre trying to wrap up for the day? If someone was hovering around my desk, Id just explain that I want to go home and see my kids, says Cooper. But Id add that Ill give them a call and talk properly another time. Everyone in my office stinks - perfume, gym, feet, cigarette smoke, aftershave, fruity vape clouds, breath. How do I cope? Should I tell them? Might they not realise? The onion armpits, the stagnant gym bag, the Hoover-bag breath: it is sort of amazing anyone ever sleeps with their colleagues. If youre in a position of responsibility and they are in your team and it was becoming a problem for business - say they were stinking out meeting rooms or clients were saying something - then I think it would be worth saying something, as long as they are your junior, suggests etiquette expert Jo Bryant. I dont think you can start telling your boss they smell - its not going to go well. But how exactly do you tell a colleague that they hum? I think it would be worth saying: Somebody noticed a smell the other day in a meeting, so Im just asking everybody to double-check that jackets and shirts are clean. In other words, make it vague and make it anonymous. Explain that youre just doing a team-wide thing - everybodys checking, because something has been said; you cant say by who. And if its your boss? My primary schoolteacher mum always swore by a dab of tiger balm under your nostrils, Olbas oil on your collar or mentholated chewing gum to block out the stench of other peoples bodies. Or maybe you should invest in a really heavy-duty face mask. Telling your boss they smell is not going to go well. Illustration: Vincent KilbrideThe Guardian The office chair is killing my back. Can I ask for a better one? And how do I stop colleagues from fiddling with the levers while Im away? Alison Green, author of Ask a Manager, points out that you are well within your rights to ask for a better chair if the current one is causing you physical discomfort. Frame it in terms of ergonomics, and ask for an ergonomic assessment, if thats a thing your workplace does. As for stopping colleagues from messing with it, that can be a losing battle. You can always try asking them to stop - but if they need to use that chair when youre not in, they need it to fit them just as much as you need it to fit you. The real problem may be that your office needs more chairs. I miss my spouse, children, dogs etc. Is it OK to Zoom them from the office? Modern etiquette, explains Bryant, is all about causing the least amount of friction. Before the pandemic, we would have gone to a breakout area, waited until lunchtime or gone out of the building for a few minutes to make a phone call; exactly the same rules should apply to video calls. The exception to that rule might be if it was late in the evening, the office was quiet, you were having to work late and you want to say goodnight to the children. But in normal, busy office hours, it should be avoided. Thats no fun. Is it at least OK to walk around the office while Im on the phone? I want to hit my 10,000 steps. If you see people just walking around - as if theyre in their sitting room or walking down the street - thats disturbing for other people, Bryant says. If you were that busy, you wouldnt be wandering around. Its the busy people who are always doing miles around the office, calling it multitasking and telling everyone how busy they are. Theres no need to draw attention to yourself in that way. If your office has hot-desking, how do you reserve your favourite seat (by the spider plant, with the view of the train line, out of view of the colleague who harrumphs whenever you open a packet of crisps) without getting in at 7am? Weve seen firms try to do hot-desking before, and one of the ways people tried to retain a little bit of ownership was almost like a dog cocking their leg - theyd keep it disgusting, says Bruce Daisley, author of The Joy of Work, presenter of the Eat Sleep Work Repeat podcast and former vice-president of Twitter in Europe. I think thats a classic performative bit of status. A low-status person definitely wouldnt dare to leave their space looking dishevelled. Unless your workplace has a formal booking-in system then you have to accept that youre not going to get your favourite desk, mouse, or chair, says Bryant. If youre hybrid working, in a team situation where you know youre doing two or three days and know who youre sharing your desk with, I think you could leave your notebook or pen neatly on the desk. But nobody wants to sit down in front of pictures of your children or novelty pencil sharpener. If youre hot-desk sharing or hybrid sharing with someone senior to you, then clean out every time. Also, dont leave anything around that could be personal or data-sensitive - be sensible about it. Is my professional tracksuit going to cut it at work? It is black and it does have a waistband - but it also has quite a lot of elastic and some fairly indelible porridge marks. A shirt or a suit makes some people feel more comfortable, says Cooper. Personally, I havent worn a suit for a year and a half and in that time Ive written five books. Cooper points towards the fact that the old model of hard shoes and shaved faces didnt seem to make us more productive. If we were so efficient pre-Covid, in the formal environment we had, why was productivity per capita bottom of the G7 and 17th out of the G20? Id say our environments werent relaxed enough. If youre customer-facing and you think your customers or clients want you to be formal, thats one thing. But I think we need to lighten up. What do I do if someone on a nearby desk starts coughing? Is it rude to move seats? Should I offer them a sweet? A lateral flow test? A mask? I think Id ignore it to start with, advises Bryant. If it didnt go away, Id ask if they were feeling OK, hint, hint. If it carried on, at the end of the day I might say: Do you think you ought to stay at home tomorrow because its horrible for you to have to be in such a dry, air-conditioned environment with your cough. Put it as a concern for their comfort, rather than your own, and highlight the fact that, hopefully, many of us are now more able to work from home. As for sniffing, my personal advice would be to follow the lead of my old classmate during our GCSE exams and wear earplugs. Is it ever appropriate to microwave fish in an office kitchen? My first ever office - in Leeds - had a working kitchen with a hob in the basement and I thought nothing of cooking a full stir-fry down there during my lunch break. I even grated the carrots. Another colleague ate tinned mackerel at her desk. To some extent, we forgot that being in an office meant the occasional smell of someone microwaving fish, Daisley points out. Or the challenge of dealing with the person next to you chewing gum all day. The mini-frustrations or hell that other people represent. Were just coming to terms with it again. You could always, if really tortured, put an Out of Order sign on the microwave, turn it off at the plug and go back to your joyless cold sandwich feeling smug. If really tortured by lunchtime smells, put an Out of Order sign on the microwave. Illustration: Vincent KilbrideThe Guardian Can I ask someone whos off sick to join our Zoom call? Its not going to kill them, surely? If theyre off work because theyre sick, its an absolute no, says Bryant. If theyre off work because theyre doing something like childcare, or waiting in for a plumber, then I think the pandemic has opened up the concept that we can log in from anywhere and do our jobs more remotely than we thought. If people arent incapacitated themselves, and are able to join the call from home, then I think thats fine. As long as youre not encroaching on some private emergency or crisis. There are boundaries. What do I do if I need to burp, fart, scratch, yawn or sneeze during a meeting? I cant turn off my mic and camera any more? Bodies are such chaotic, animal things. Even when they are dressed up in a navy polyester blazer and put in a swivel chair. We all need to relearn the techniques we used to use to handle these moments, before going remote, Green advises. Sneezing is generally recognised as uncontrollable; its going to happen. But if you have to burp, fart, or scratch yourself somewhere indelicate, ideally youd briefly excuse yourself from the meeting. Yawning is trickier. It can be just as uncontrollable as sneezing but can give the impression that youre bored or disengaged. Drinking water can help but if you really cant hold it in, try to be discreet about it. You want it to be as subtle and as far away as possible from a loud, back-stretching yawn. I dont wear a mask in the office but one of my colleagues does. Should I mask up when I approach them for a chat? If theres a group of us in a small room, should we all put masks on? There are no longer any real rules about this, which means each organisation must create its own guidelines and each member of staff is responsible for how they act. But what are the medical implications? It very much depends on whether you work with anybody vulnerable, who might be at higher risk, says Dr Sarah Jarvis, GP and clinical director of Patient.info. If its a relatively young, relatively healthy, all-vaccinated group of people and there are 10 of you, the chances of anybody being infected at any one time is probably one in five or so, which means theres an 80% chance youd be wearing face masks all day for no reason. Saying that, if you work with people who are older, more vulnerable and particularly if they have suppressed immune systems for any reason, then the risks are not remotely insignificant. You can usually spot if someone in your office is older but whether someone has an underlying health condition can be impossible to judge. I dont think its fair to put the onus on that person to talk to everyone in the team, Jarvis continues, so perhaps have a chat with your line manager. That is, after all, what bosses are for. As for the type of mask you wear, Sarahs answer is wry but pertinent: It does need to have at least two layers. But frankly, a fairly cheap, two-layer cloth mask is a great deal more effective if worn over your nose and mouth than the best FFP mask in the world when its only worn beneath your chin. How do I tell my manager that I want to keep working flexitime? They dont have kids and only have a 15-minute commute, so I just dont think they understand. Ideally, youd point to how well it has been working already, Green suggests. Explain that its been a major boon to your quality of life not to have to spend as much time commuting, and talk about what youve done to ensure it hasnt affected your work. If you havent already been doing it and thus dont have that data to point to, another approach is to ask to do it as a limited-time experiment, such as for six weeks, and then revisit it after that so that your boss has a chance to see that it works. Are tea rounds still allowed or do we all have to do the lonely caffeine walk to the kettle solo, now? I once worked with a woman who remembered whose mug was whose by lining them up along the counter from who she thought was most leftwing to most rightwing, while she boiled the kettle. You could, alternatively, reduce the chances of cross-infection by asking for a washing-up sponge and some detergent. The tea round was a wonderful, very gentle assertion of these mini bonds of connection between us, says Daisley, sounding wistful. In the past few years weve got our work done tactically, and weve maybe detached ourselves from some of the office idiots, but one thing weve definitely done less in the past two years is laughed. The late chief rabbi Jonathan Sacks talked about simcha. Its a Hebrew word that translates as joy, but its also a participle of we. Every time we have meaningful moments, they become part of who we are, they have simcha running through them. In a very small, British way, the tea round had that simcha to it.","SOURCE":"The Guardian"},{"ID":"t3_qwr6l2","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/qwr6l2\/best_way_to_leave_a_company_you_love\/","DATE":"2021-11-18","PLAIN_TEXT":"Hi, all. Ive been a developer for 12 years. 4 months ago I was hired to a new company. I like it a lot. Theyre great, good people that really take care of their employees. However, Ive recently received news that I am approved for permanent residency in my wifes home country. We are moving to the other side of the planet. My new company really needs me, and I think theyre a great organization. I know theyll be very disappointed with my resignation. How can I make it better for my company while also protecting myself?Im thinking of giving them like 2 months notice before my last day. Something like that maybe. Any other ideas?If it matters, I am currently based in the US.Update: based on the helpful feedback Ive received, Ive decided to give my company 2-3 weeks notice, explain that I still like the company, and offer to work remote as a contractor. Thank you, everyone!","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_srpk0e","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/srpk0e\/do_anyone_else_here_love_being_a_developer\/","DATE":"2022-02-13","PLAIN_TEXT":"I see a lot of complaining in this sub and other software subs. Im a bit surprised because I see this field as one of the best if not the best right now. We are literally payed to sit around and figure out creative solution while working with computers and software that interests us. Ive worked retail and warehouse jobs before and the change is literally night and day. Its hard physical work that is very soul crushing while the benefits are none. Now you get to sit in a nice office or at home infront of your PC, great pay and benefits. Even comparing it with my friends it sounds awesome. Dentist? Yeah he fucking hates that he cant work from home.Business people? Long ass hours and bad pay where we live.&amp;#x200B;I get that every career has problems but I do think we have one of the best jobs out there. I am just grateful daily that I can get payed by doing something I enjoy. Not a lot of people can say that so if you are, then try to cherish that.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_pl43ol","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/pl43ol\/how_he_hell_am_i_supposed_to_have_any_time_to\/","DATE":"2021-09-09","PLAIN_TEXT":"I work as a part time intern at a fortune 500. I was fulltime over the summer and they offered to keep me around as part time during the school, which I thought was great.I also am a full time student.&amp;#x200B;I am burning out incredibly fast.&amp;#x200B;Its my senior year of university and Ive now submitted over 200+ applications for software engineer positions across multiple states, including gov jobs.&amp;#x200B;I cannot get so much as an email back from 99% of them. The ones that do email me back send me an OA using hackerrank or codesignal, of which I usually have to google a bit of syntax stuff but otherwise pass their test cases, and then get ghosted.&amp;#x200B;My resume has been reviewed by about 30 people now who Ive asked to review it, all of which say it looks fantastic.&amp;#x200B;I have multiple completed projects spanning all types of technologies including OSS contributions, but I like to focus on web dev and absolutely love React. I will choose working on a personal project that means something to me over doing silly leetcode problems any day. People always tell me they envy my Github profile because its so nice and feels complete. I also have half a year of intern experience now doing ALL different kinds of stuff, from fullstack web dev, to firmware, to devops, and both my resume and github show that clear as day.How the actual hell am I supposed to:1. Get a response from these companies?2. Find time to do leetcode with other life stuff going on? I do NOT want to do it. I do not want a FAANG gig. Every time I open up leetcode or my copy of CTCI my eyes glaze over. I just want a job where I can feed myself and work on advancing my skills with relevant tech.Feeling incredibly depressed from the prospects of this industry given my experience so far, albeit its not much. Ill take any and all advice thats not shoving leetcode down my throat at this point.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/7a2ae85c-d3ac-5005-a7ea-3184c0f1c04b","URL":"https:\/\/www.nytimes.com\/2021\/08\/09\/us\/coronavirus-today-children-delta-military-vaccine-mandate.html","DATE":"2021-08-09","PLAIN_TEXT":"Coronavirus cases among children are surging across the U.S., with some doctors seeing more critically ill pediatric patients than at any other point during the pandemic.A surge among children","SOURCE":"New York Times"},{"ID":"t3_ky6dhe","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/ky6dhe\/warning_think_very_hard_before_going_into\/","DATE":"2021-01-15","PLAIN_TEXT":"EDIT: Imma just say that I was boiling over when I posted sarcastic comments and snarky remarks and I apologize for causing such a shitshow..lolTL;DR: Yesterday cursed out my friend in the DMs, took down the company website, and blocked him and everyone else in company in every possible way after being emotionally abused for too long.BackgroundIm a mid-twenties programmer with a good steady career path making enough money and getting enough perks that Im not complaining. I enjoy my job and my teammates, but the company I work for and the work I do isnt entrepreneurial. Having an entrepreneurial mindset myself, Im always looking for opportunities to build something with someone. Ive had one experience in the past of working with another friend of mine during college and we actually managed to build a cool MVP and get some funding from our universitys startup accelerator. It never went anywhere but was an amazing learning experience and solidified my love for startups and software.So, when I learned that my friend (who is the subject of this post) was working on a company with his family and they needed software help and expertise, I saw this as a chance do something again. I was excited at the idea because no one in the team had software knowledge and I could tell they needed help. At this point, the company was about six months old and was actually profitable from what I understood (at least, thats what he told me). So I decided to jump in and help out, being onboarded as the CTO.At first, things were great. I was able to prototype a lot of things very quickly and my friend and his family (2 other people) were visibly excited and happy at the rate of progress. I was essentially building the full stack for a website that would get used by business clients (anywhere from 10 users in the beginning to over 100 eventually). I told them front-end development wasnt my area of expertise but it seemed that nonetheless they were very pleased with the front-end design of the site. I admit maybe Im not totally incompetent at front-end, but it is far from being my specialty and I only really do it when I need to. I would still call it pretty amateur-ish, though.About a month in, there began being an incountable number of red flags that I sort of just swallowed and didnt make a big deal out of. I dont remember the exact timeline but here are some things that occured: Due to the his general lack of understanding of how software development works and the time scales involved, he proposed that we have the initial beta release about 1.5 months after my initial commit to the repo. Keep in mind, this is a tool used by business users and their livelihoods actually depend very much on our own website and business going smoothly. I dont take this type of stuff lightly and spent an enormous amount of time adding all sorts of fail-safes and tests to ensure the system would function smoothly. When it became readily obvious that we werent going to be able to launch on that date, he said he doesnt want to start a culture of pushing stuff back. Keep in mind that a week or two before this date, website features and enhancements started to take a back seat to me prioritizing system stability and bug fixing. When I didnt follow through with going out for drinks one night, he got mad and commanded me to not push back stuff for no reason - translation: he thought that I was using backend bug-fixing as an excuse and wasnt actually doing anythingenough on the website. Keep in mind, I work a full-time job and still managed to spend anywhere from 20-40 hours a week on this website, as my time allowed.  He was insecure about my commitment to the company and would always ask me if I was really ready to be a CTO and if I really care about it, asking questions like why I didnt put CTO on my Linkedin. I explained that it wouldnt look good in front of my manager, who I was connected with, to see that I recently started working on something on the side. He claimed he understood but I dont believe he ever shook that insecurity. I had asked for certain processes and practices to be in place. I continually asked all other team members to test the site as I was working on it. I also asked them to not send me feature requestsbugs in the DMs and to use our Trello board. I was constantly hoping one of the members of the family would ask me any questions about what tech I was using or what decisions I was making. The front-end to this system was a website but the backend was actually extremely involved and I was doing things that received no interest. Multiple times, I got requests for features that were already implemented into the website and nobody even bothered to go there and check to see if they were. There was zero enthusiasm about it after a certain point. Part of the site had an embedding to another site which previously held a bunch of data that was being storedprocessed (think of it as a legacy system). There was discussion about the rest of the site not looking similar to the embedding and that we should make the rest of the site look like it. The site that was embedded was actually a very high-profile site who has a major value proposition being that it has extremely good front-end (hundreds of UI employees - not going to mention it here but think of the most beautiful databaseexcel type site whose name is the name of a day of the week). Basically they wanted the rest of the site to look and feel like that. There was going to be a push to not rely on the legacy system anymore and recreate the functionality on our end, which I actually pushed for. So it seemed like a complete wasted effort to recreate the look and feel of the embedding. The straw that broke the camels back: Today was supposed to be our second try at releasing to beta. I asked about a week ago to please do some testing and make sure that everything works and everyone is happy. Well, yesterday morning I see a message in the group chat amongst all four of us from the guy saying that the site is a joke. Instead of offering any sort of constructive feedback (I dont think he even went on the site and tried to test anything), he proceeded to repeatedly call it a joke. (Note: I am NOT paraphrasing). He said that our competitor just released a site that had much more functionality and that if we didnt include multiple language options for users, fix the appearance of the website, and add a highly sophisticated item tracking system, then we cannot launch the site. He said that yet again we have to postpone the launch and I could tell he was in a bad mood. (Funny note, one of the requirements for launch were e-mails that we would send our customers when various events occurred. He always asked if there was anything he could take off my plate and I finally had something, which were these e-mails, so I told him to please do that. That was 3 weeks ago and he never managed to deliver a single e-mail to me, all the while being angry that I didnt deliver to him a website that would require a team of 4 people probably months to finish. One more example: it took another family member 2 weeks to put in credit card details to upgrade the tier of our services so that I could have a proper developmentproduction cluster, but I was blocked on doing this due to the fact that he didnt do this (it would take 5 minutes)I cursed him out in the DMs and said that he has no leverage in this situation. I had all the .pem keys to our EC2 instance (not that it wouldve mattered anyway) and all the code was in a private git repository that only I have access to. He didnt seem to understand the gravity of how absolutely furious I was because he didnt apologize or change his behavior but continued to criticize me. So what did I do? I turned off the instance, deleted all S3 buckets, and blocked everyone at the company. They can buy the code for 10k if they want. But Im never going back to that dumpster fire. Please: make sure your cofounders know what theyre getting into when it comes to a software business. And think really hard about going into business with your friends. Finally, make sure you keep as much as you can under your control in case anything goes as badly as it did for me.Edit: Forgot to mention one of the last things he said was that he could get a single guy in Eastern Europe to code every feature he wanted in under a month and that would not cost much money. Obviously Im not dumb enough to believe that and knew he was bluffing. But this type of emotional manipulation just put me over the edge. I know that the low-ball for the site that hes dreaming about would cost probably a hundred to a couple hundred thousand dollars to build properly.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/878fb9c0-834c-5e89-8c46-cdfa9dd59476","URL":"https:\/\/www.nytimes.com\/2021\/03\/03\/business\/return-to-work-coronavirus.html","DATE":"2021-03-03","PLAIN_TEXT":"A year and a pandemic ago, over 100,000 people filled the central business district in Charlotte, N.C., pouring out of offices, including several recently built skyscrapers, and into restaurants, bars and sports venues. Then as the coronavirus sent employees to their homes, much of the city center quickly went quiet and dark.Many employers are not making a decision until many workers are vaccinated. And some are making plans for hybrid work arrangements.","SOURCE":"New York Times"},{"ID":"t3_ju6qgt","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/ju6qgt\/learnings_from_a_successful_cs_career\/","DATE":"2020-11-14","PLAIN_TEXT":"I wanted to counter some of the selection bias on this sub by telling a bit about what I consider to be a successful cs career.A little about me Went to an OK school (uva undergrad), got OK grades (2.95) Never ground leetcode Applied to only a few jobs after school, nothing crazy. Entry salary was 50k as a new grad at a no-name government contractorOutcomes several years later: 300k total comp 250k in the bank  investments 100% remote position (even before covid) Own a home in Santa Cruz county. Early employee at a tech startup which was acquired recentlyThe prevailing view on this sub seems to be that in order to have a successful career you need to: graduate from a top tier school with a high gpa get into a big-n, unicorn, or fintech company with 100k base salary directly out of school Grind leetcode all day until you can do hards without thinkingId like to provide my career as a counter-example, which doesnt seem too rare among most software engineers that I know.My learnings: Start small and work up. Software companies want experience first, not necessarily good grades or algorithms chops. Since its your work history that stands out, work on that first. Sure, apply to google, but also apply to that non-tech shop that needs software engineering. Stick around long enough to learn something before moving on. When you are done or if your wage is stagnating, apply somewhere else. Lose the ego and be friendly. Learn to work well with other people. My best references now are people Ive worked with amicably. Improve yourself over time. If you arent learning what you want to on the job, learn about stuff out of the job. Always be learning. If you arent learning at work, go to tech meetups, use online courses, and hack for fun. If you can, go back to school. Pick up a Masters degree and specialize in something you are _interested_ in. At some point, work at a small startup, and really invest your time and energy. You will have significant equity, which means you will have a chance for a large payout if the company is acquired, and the harder you work the more value you are creating. Do your diligence to find the right company for you: good, savvy leadership, in a promising field. This is a gamble of course, but even if the company goes under, its an incredible learning experience. demonstrate your value, and draw on that to ask for what you want. Get involved in projects, and be do your best to be integral to their success. Another way to demonstrate value is to apply elsewhere and get offers. Remember once you have some experience, you will be in much higher demand. If you can demonstrate value, you can ask for things you want for your career, e.g. cooler projects, better pay, better title, better benefits, remote work.This has been my experience. Hopefully it gives some hope to other people who may feel like their grades or resume isnt stellar. Tldr: get any job programming, do awesome at it, get better yourself, jump to better jobs every so often, and build your resume.Edit: a lot of people are asking about timeline. I graduated in 2006. I realize this may change the tone of my post for some, as the tech job market has changed somewhat since then. I hope that the pointers are helpful anyway!Edit: formatting","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_vc4m04","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/vc4m04\/coinbase_announces_18_layoffs\/","DATE":"2022-06-14","PLAIN_TEXT":"Source: https:blog.coinbase.coma-message-from-coinbase-ceo-and-cofounder-brian-armstrong-578d76eedb12If you are affected, you will receive this notification in your personal email, because we made the decision to cut access to Coinbase systems for affected employees. I realize that removal of access will feel sudden and unexpected, and this is not the experience I wanted for you. Given the number of employees who have access to sensitive customer information, it was unfortunately the only practical choice, to ensure not even a single person made a rash decision that harmed the business or themselves.I also wanted to make sure that all affected employees are taken care of in this transition, and that we support them in finding a new role. Employees who are departing today will receive:Minimum of 14 weeks of severance plus an additional 2 weeks for every year of employment beyond 1 year4 months of COBRA health insurance in the US, and 4 months of mental health support globallyAccess to Talent Hub, where members of Coinbases team will work to connect with you with open positions at other firms (including portfolio companies from Coinbase Ventures and other top crypto VC funds) ===========================Edit: Due to the US housing slowdown, these two layoff news came out a few minutes ago:Redfin announced layoffs of 6% of its workforce:https:www.marketscreener.comquotestockREDFIN-CORPORATION-37247408newsREDFIN-CORP-Costs-Associated-with-Exit-or-Disposal-Activities-Regulation-FD-Disclosure-Financial-40721688Compass about 10%:https:www.marketscreener.comquotestockCOMPASS-INC-120835016newsCOMPASS-INC-Costs-Associated-with-Exit-or-Disposal-Activities-form-8-K-40721739","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_10djr7y","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/10djr7y\/any_of_you_thought_that_maybe_youre_not_made_for\/","DATE":"2023-01-16","PLAIN_TEXT":"I understand I am on a fine line here of getting flagged as venting but I think its an issue that a lot of devs can face later in their career and is worth discussing about. Ive been doing this for more than 5 years now and it seems like the more experience I get, the less gratifying it becomes and the less I care about bettering my skills and advancing my career forward. Once youre past the initial excitement of getting into the field and the grind mindset that comes with it, you come face to face with a career that basically asks you to always be on that hyper-motivated, curious to learn anything and everything mode, but the honeymoon has passed. These days I am hardly functional on a basic level if I am not fueled on cafeine. I have a coworker that says he just cant code without adderal. Im sure Im not the only one thats looking for a way out, but when you are used to the salary and WFH lifestyle, it is extremely hard to justify making that change. Now I am aware this could just be a necessary obstacle to get over and is the main reason why I am writing this here. Did you at some point experience something like this? If so what did you do? How do you take care of your mental health as a software engineer?","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"commentisfree\/2022\/oct\/15\/demonise-or-romanticise-choice-in-framing-working-class-lives","URL":"https:\/\/www.theguardian.com\/commentisfree\/2022\/oct\/15\/demonise-or-romanticise-choice-in-framing-working-class-lives","DATE":"2022-10-15","PLAIN_TEXT":"An old man walking between rows of terraced housing and, behind him, the sky erased by the huge bow of a ship being built. A teenager picking coal on a beach. A man manoeuvring his horse and cart around a car dumped by the sea. A young girl playing hula-hoop in a desolate, rubbish-strewn landscape. Chris Killip and Graham Smiths photographs, mostly of the north-east of England, in the 1970s and 1980s, the era of deindustrialisation, of smashed communities and broken lives, look like images of a different world. Two exhibitions opened last week in London showcasing their photography, one a retrospective of Killips work, the other a recreation of a joint exhibition, Another Country, first shown in 1985. They raise questions both of the nature of photography and of our perceptions of working-class lives. Smith came from South Bank, a working-class area of Middlesbrough, his father a third-generation steelworker. Most of his photography is of the local streets and pubs, of the last days of the steelworks and shipyards and of the dereliction that followed. The pubs he so often photographed, Smith wrote, are used by those whose future is the... next good drink. Killip, who died of cancer two years ago, came from the Isle of Man, but settled in the north-east and photographed working-class communities across the country. There is a lyricism and humanism to the photos of both men, born of a deep empathy with those whose lives they were capturing. Helen and her hula-hoop, Lynemouth, Northumberland, 1984. Photograph: (c) Chris Killip Photography TrustMagnum Photos For all the warmth and humanity, though, these are images shot through with a despairing bleakness. Even in the most hopeful of photos - employees at a Pirelli factory displaying an almost craft-like relationship to their work, men quietly repairing fishing nets, punks losing themselves on a night out - there is an edge of desolation. It is a bleakness perhaps best expressed in a pair of Killips twinned photos. The first, taken in 1975, shows a rundown terrace. In the second, taken from the same spot two years later, the houses have been demolished, the rubble strewn across the street. What remains intact is a piece of graffiti painted across a half-shattered wall. Dont vote. Prepare for revolution. It was as if the outside world was mocking the community, telling it: The only change will be the change we impose, and not just the physical infrastructure, or the social bonds of the community, but your hopes, too, will be reduced to rubble. Related: We wanted to value and document working-class culture: the photography of Chris Killip and Graham Smith In Poverty Safari, his blistering account of what it is like to grow up in a poor, working-class community, Darren McGarvey observes that in poorer communities, there is a pervasive belief that things will never change. This may seem like a self-defeating view, he adds, but people in such communities learn that the real problems are not of poverty as such but the problems of changing anything: Whats difficult is how many walls you come up against when you try to do anything about it. The system is designed not to meet working-class needs but for working-class people to be engaged by facilitators and mentors who help them water down whatever they want to do in order that community aspirations align with those in positions of power or influence. The writer Lynsey Hanley similarly observes, in an essay for the Killip retrospective, that the photographs cant but make you ask the question: why dont we revolt here? Why does there seem to be no limit to what working-class people will endure at the hands of the rich and powerful? Killips answer, she concludes, seems to be because we know we wont win. It is a despondency almost tangible in the photos. Sandy and his Aunty Elsie, Early Doors in the Commercial, South Bank, Middlesbrough, 1983 Photograph: (c) Graham Smith There was another world, of course, the world of resistance expressed through the miners strike and inner-city riots, the Right to Work movement and squatters groups. But these having been brutally crushed, Smith and Killip seem to be saying, agency and resistance were now expressed as much in ensuring survival as in fomenting change. The exhibitions also raise questions of how working-class lives are depicted. There is something predatory in the act of taking a picture, the essayist and critic Susan Sontag observed. By seeing them as they never see themselves, by having knowledge of them that they can never have, Sontag adds, a photograph turns people into objects that can be symbolically possessed. There is an element of truth in this. Killip himself was chased off and beaten up by locals when he first tried to take photos of the sea-coalers - the men and children who spent hours scouring beaches, often knee-deep in water, for the spoil tipped into the sea by the coalmines, to be bagged and taken away in horse-drawn carts. The authorities used to photograph them, too, to prosecute and deny benefits to the men who worked in this shadow economy. It took three years for Killip to build sufficient trust to be allowed to take photos on the beach. But out of that trust came some of the most remarkable photos, exposing the seam along which the Middle Ages and the twentieth century are entwined, as Killip himself put it. The issue Sontag raises is not just about how a photograph is taken but also about how we perceive it. When we look upon an image, we do not see it through the photographers eyes, still less through the minds of the subjects of the photograph, but, rather, through the social framework through which we come to understand any issue. Its a framework that, when it comes to working-class people, either condescends to them as victims, demonises them if they challenge authority or, occasionally, romanticises them as heroes. Too often, they are seen through the lens of otherness and through the sensibilities of outsiders. Just listen to todays discussions of the left behind or of the white working class. Killip and Smith did not take photos of another world. They recorded our world, showing what had been done to working-class communities and what such communities have had to do to survive. And, yet, both then and now, there is more to such communities than passive survival; there is also active challenge and resistance, too, seen today in everything from the summer of strikes to Enough is Enough. That, too, needs to be nurtured and celebrated. And photographed. * Kenan Malik is an Observer columnist Do you have an opinion on the issues raised in this article? If you would like to submit a letter of up to 250 words to be considered for publication, email it to us at observer.letters@observer.co.uk","SOURCE":"The Guardian"},{"ID":"t3_si6zkj","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/si6zkj\/are_there_incompetent_people_at_faanglevel\/","DATE":"2022-02-01","PLAIN_TEXT":"Im seven years into my career and have worked exclusively at medium to large financial companies. By and large, most of my stressful days have been a result of dealing with bad people. People who are lazy, incompetent, rude, bad communicators or some combination of the above. Most recently Ive been dealing with finance bros who seem to think developers are below them and have no interest in actually learning anything technical to make theirs and everyone elses life easier. The work is also not as challenging as Id like. I feel like a lot of my energy goes into managing people rather than my work, and Im not at a point in my career where I feel like I have a solid enough foundation to do that effectively, or even want to do that. Even though Im good at it, I dont see my career taking a managerial trajectory. I cant stand the people and the politics.But then I got to thinking, maybe I feel that way because Ive had such bad experiences. Im wondering if I should start looking for a new job at a FAANG (which in my mind is the next level up from my employer). Is there a higher caliber of people at these companies or can I expect to encounter idiots there too?And yes I have discussed all this with my manager. He sympathizes and agrees with all my points but unfortunately we dont have the people or projects right now to fully address my concerns.Edit: I was not expecting such a response to this post. I would like to clarify one thing since this is getting so much attention. Incompetent was probably poor wording on my part. What I meant was difficult to work with and incompetence is just one of the reasons why someone may be so. In my experience, it actually hasnt been the reason a lot of the time. Im reading every response so thank you all for your input. Its definitely giving me some food for thought.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"business\/2021\/may\/30\/home-working-drives-demand-shoffice-space-uk-gardens-shed-office","URL":"https:\/\/www.theguardian.com\/business\/2021\/may\/30\/home-working-drives-demand-shoffice-space-uk-gardens-shed-office","DATE":"2021-05-30","PLAIN_TEXT":"Cropping up at the bottom of gardens up and down the UK is the latest trend among the countrys home workers - the shoffice, an office in a shed. After more than a year working from kitchen tables, sofas or spare bedrooms, many Britons are looking to carve out a quiet workspace in the loft or in their garden. Jules Carluccio, who works in local government, is one of the millions of workers who has not been back to her usual workplace since last spring. In anticipation of permanent home working she decided to splash out on a shoffice. The new workspace in her Bedfordshire garden is much more than a humble garden shed. At more than 8 sq metres, the wood, metal and glass structure comes complete with a canopied seating area and mains electricity. It did not come cheap at PS17,500. It was a big [financial] commitment, but I weighed it up, Carluccio said. I looked at how long I would be staying at the property, how long I would be in my job, and also the kinds of uses I wanted from it. Office sheds are growing in popularity, as staff expect to spend more days at home. Photograph: Cherry BeesleyHandout More than a third (38%) of UK workers worked from home in mid-May, accordingto data from the Office for National Statistics. Few office-based staff expect to go back to their desk for five days a week. Earlier this month, the accountancy firm EY became the latest company to tell employees they will be expected to work from home for at least two days a week, even after coronavirus restrictions are lifted. Its 17,000 staff will move to a hybrid working model, combining home working with the office, as well as client visits. Many other large office occupiers plan to adopt hybrid working, to cut office costs as much as pleasing staff. These staff need somewhere to work on the days when they are not required to be at their desk. The booming demand for home offices pushed the company Smart Garden Rooms, Offices &amp; Studios to its best-ever month in April, when it notched up PS750,000 of sales, more than double its monthly average. Since reopening last May, the Suffolk-based firm has scarcely been able to build its garden offices quickly enough to keep up with demand, despite taking on a third more staff. Sign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk Its managing director, Matt Moss, said: People dont spend PS20,000 on a garden room on a whim, thinking I might be able to work from home going forward. People are committed to this. Our level of enquiries amazes us every single day; that it is so consistent, he said, adding that shoffices usually do not require planning permission. The trend is being repeated elsewhere. Sales of garden buildings rocketed by 500% between January and May, compared with a year earlier, while sales of sheds soared by more than 460%, according to the DIY and building supplies retailer Toolstation. Workers desire to create an office away from the office is also inspiring some to move upstairs. On Englands south coast, the Brighton Loft Company has had an 80% increase in inquiries during the pandemic, which its owner, Gilles Buxton, ascribes to demand for home offices.","SOURCE":"The Guardian"},{"ID":"t3_10m1zwc","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/10m1zwc\/are_companies_trying_to_get_us_back_in_the_office\/","DATE":"2023-01-26","PLAIN_TEXT":"I work for a company, and we have 2 day a week policy in the office. This morning it switched to 3 days a week, obviously its eventually going to 5 days a week as they slowly roll us back. Genuinely surreal to see this, 3 years of work from home all 3 years stellar feedback. Any other companies slowly transitioning back or is it just my firm? I am probably going to put in my 2 weeks, as I am not missing my kids first steps to be in a cubicle.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_y133cq","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/y133cq\/anyone_else_feel_lonelybored_while_wfh\/","DATE":"2022-10-11","PLAIN_TEXT":"Anyone else struggle with feeling lonelybored throughout your workdays while working from home?I joined a new job a year ago. I like the work I do and my coworkers are nice. But, there isnt all that much socialization and I sometimes struggle to get through a full workday without feeling somewhat alone. Anyone else feel this way? If so, is there anything you do that helps with that?","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/20b0db00-205f-5b23-a5de-4591607f9255","URL":"https:\/\/www.nytimes.com\/2022\/02\/20\/business\/dealbook\/class-of-2022-work.html","DATE":"2022-02-20","PLAIN_TEXT":"The DealBook newsletter delves into a single topic or theme every weekend, providing reporting and analysis that offers a better understanding of an important issue in business. If you dont already receive the daily newsletter, sign up here.As workplaces transformed by the pandemic negotiate a new normal, DealBook asked college seniors across the country what they hope it will look like.","SOURCE":"New York Times"},{"ID":"technology\/2022\/aug\/16\/apple-tells-staff-to-come-into-the-office-for-at-least-three-days-a-week","URL":"https:\/\/www.theguardian.com\/technology\/2022\/aug\/16\/apple-tells-staff-to-come-into-the-office-for-at-least-three-days-a-week","DATE":"2022-08-16","PLAIN_TEXT":"Apple has told its employees they must come in to the office for at least three days a week from next month, in an effort to restore in-person collaboration. In a memo to all employees, Tim Cook, Apples chief executive, said the policy would require all staff to return to the office on Tuesdays and Thursdays, as well as a third day that would vary team by team. We are excited to move forward with the pilot and believe that this revised framework will enhance our ability to work flexibly, while preserving the in-person collaboration that is so essential to our culture, Cook said in the memo. The official plan, emphasised as just a pilot in Cooks letter, is already a step back from an earlier proposal for all employees to come in on Monday, Tuesday and Thursday every week. The shift to a flexible day in addition to the two midweek days will allow some employees to continue to have four unbroken days at home each week. Apple had long been an outlier among its peers on the question of remote working. While tech companies including Twitter and Facebook implemented policies at the start of the Covid pandemic that allowed employees to opt for permanent home working, Apple has maintained throughout that its long-term plan is for all employees to return to in-person work. In June 2021, when Apple first proposed a return to the office for three days a week, Cook told employees that for all that weve been able to achieve while many of us have been separated, the truth is that there has been something essential missing from this past year: each other. Video conference calling has narrowed the distance between us, to be sure, but there are things it simply cannot replicate. The companys hardline stance on remote work has cost it already. In May, Ian Goodfellow, Apples director of machine learning, quit barely two years after being poached from Google to rejuvenate its virtual assistant Siri and the companys other AI projects. Goodfellow explicitly cited the return-to-work policy as the reason for his departure, telling staff: I believe strongly that more flexibility would have been the best policy for my team, according to the Verges Zoe Schiffer. Goodfellow rejoined Google, working for the companys Deepmind subsidiary. Apples stance is still not quite as strict as that taken by the car manufacturer Tesla. In a memo sent in early June, Elon Musk told employees to return to the office for a minimum (and I mean minimum) of 40 hours per week or quit the company. Employees were entitled to work remotely in addition to that time in the office, he said, but if they thought remote work was sufficient, they should pretend to work somewhere else.","SOURCE":"The Guardian"},{"ID":"commentisfree\/2022\/dec\/21\/jacob-rees-mogg-alan-sugar-daily-mail-home-working-woke","URL":"https:\/\/www.theguardian.com\/commentisfree\/2022\/dec\/21\/jacob-rees-mogg-alan-sugar-daily-mail-home-working-woke","DATE":"2022-12-21","PLAIN_TEXT":"Did the Met Office, with staff working from home, fail to predict the recent cold snap? This a question that appears to trouble the Tory grandee Jacob Rees-Mogg and his staff. But then, the former business secretary has long been on a campaign against public sector employees working from home. In April, he left notes on the desk of civil servants who were not in the office. More recently, he described working from home as second best. Rees-Moggs views about working from home may seem anachronistic, but they reflect a wider culture of in-personism. Since taking over Twitter, Elon Musk has demanded staff return to the office and work long hours there. Alan Sugar has deemed home workers to be lazy layabouts. Marc Benioff, the CEO of Salesforce, which recently bought the messaging service Slack, worries that the rise of remote working means his companys employees are not building tribal knowledge with new employees. Jamie Dimon, the CEO of JPMorgan Chase, claims remote working doesnt work for people who want to hustle. A recent survey by Microsoft found that 85% of managers said they struggled to have confidence that their employees were being productive when working from home. Newspapers such as the Daily Mail run endless coverage on why the UK must get back to the office, denigrating woke workplaces that give staff flexible working arrangements and declaring Britain the global leader in refusing to return to work culture. A Telegraph column last week praised the grafters of this great nation who journey to the office undaunted by any obstacle - including trustafarians who think nothing of gluing themselves to the M25 during rush hour. Of all the targets identified by the rights culture war, here is a new one: you, with a laptop in the kitchen. The former prime minister Boris Johnson was also at the vanguard of the war against wfh, saying that a return to the workplace would boost productivity. But what was the evidence for that? Indeed, much of the evidence points in the other direction. Continuing research led by Stanford Universitys Nicholas Bloom suggests that allowing employees to work from home a few days a week has significant benefits - including an increase in productivity if hybrid working is well organised. A chronic problem faced by the public sector - and indeed large parts of the British economy - is poor productivity. Rates of productivity in the UK economy have been flat for over a decade. A study by researchers at the University of Manchester found that public sector productivity had only improved by an average of 0.7% per year from 2010-2019. Economists have pointed out that productivity can be improved through a range of interventions including more spending on research and development, better infrastructure, improving skills and better quality management . One way to boost productivity is by allowing employees to work from home. And while it is true that managers who make decisions about home working tend to underestimate the gains to productivity that can come from home working policies, and workers are likely to overestimate the gains , overall, studies show that for suitable jobs, productivity can increase when working from home. Home working can bring other benefits to the economy. Lets start with pay. Currently many parts of the UK public sector are impacted by strikes as workers demand pay rises so their wages keep pace with inflation. While a decent pay packet is certainly vital, there are situations where workers are willing to trade off slightly lower pay for better conditions. This seems to be the case with working from home - if, of course, it is practical to do so. Blooms team at Stanford University found that people in the public sector said that the ability to work from home two or three days a week was equivalent to a 6.7% pay rise. That number is over 10% in the finance and technology sectors. One reason for this is that working for home reduces costs such as commuting and childcare. But working from home a few days a week also improves peoples quality of life - and this is something they are willing to pay for. This suggests that allowing people to work from home a few days a week may go some way towards making up for shrinking real wages. Giving people the chance to work from home can also help with retention. Despite what the founder of the Phones 4u chain, John Caudwell, says is a growing sense of entitlement on the part of workers who think jobs exist for their own convenience rather than to serve customers or the public, offering home working a few days a week can help employers to hang on to the people they have. Blooms survey found that a typical hybrid working policy reduced quit-rates by 35%. Many parts of the workforce are struggling with endemic staff shortages. While the chronic vacancies afflicting the NHS and social care, the restaurant sector, the arts and the high street need in-person staff, there are many other jobs where the UK is struggling to recruit people that could build in home working as an option - from engineering to technology. Many employers are spending money on initiatives such as free food and lunchtime mindfulness classes to try to entice staff back to the office and make them happier. There is little evidence that this works. Blooms research has found that employees generally report being happier, though, when they are able to work from home some of the time. Rees-Mogg and his outriders may think that attacking home working is a good way to keep voters on side. However, according to one study from Kings College London, 66% of London workers who voted Conservative thought it was unacceptable for politicians to claim that people who worked at home were less hardworking. Where Rees-Mogg is right is that requiring many employees to be in the office at least some of the time is a good idea. Having a few days a week when employees are in the office gives people the opportunity to interact, collaborate and build their networks. Also it gives younger employees an opportunity to learn from their more experienced colleagues. Indeed, Blooms research suggests that working practices seem to have settled on a new norm of people spending on average two days a week working from home. The added benefit is that for many of us being in the office is cheaper than putting the heating on. While some Tory politicians are clearly seeking to make working from home into a culture war, surely they should be leaving companies and people to sort this out for themselves. Where will this end? Will it be where JRM and the wfh culture warriors would wish? Two days a week, three days a week: shouldnt it be wherever millions of companies and their employees decide is most likely to make their lives and enterprises simultaneously profitable? They may see an opportunity, even if Rees-Mogg and others do not. Andre Spicer is professor of organisational behaviour at the Bayes Business School at City, University of London * This article was amended on 21 December 2022. An earlier version said that a study by researchers at the University of Manchester had found that public sector productivity had only improved by 0.7% over the past 10 years. In fact, it found an average annual productivity improvement of 0.7% from 2010-2019.","SOURCE":"The Guardian"},{"ID":"nyt:\/\/article\/bbaf0ad4-0d5b-56b4-9373-820ddcd96771","URL":"https:\/\/www.nytimes.com\/2020\/09\/25\/opinion\/remote-work-from-home-office.html","DATE":"2020-09-25","PLAIN_TEXT":"In the initial months of the pandemic, remote work seemed full of upsides: more flexibility for employees and an expectation of greater profits, productivity and retention for their employers. But what if the long-studied benefits of remote work look different in a post-pandemic world? In particular, what if employee loyalty and engagement decrease once remote work is no longer an exception but rather the norm? And what if thats not a bad thing? What if a more disconnected work force leads to changes that could make employees happier and companies more compassionate?What if you are better off without the office?","SOURCE":"New York Times"},{"ID":"technology\/2020\/sep\/29\/google-to-lease-extra-70000-sq-ft-in-uk-offices-despite-remote-working","URL":"https:\/\/www.theguardian.com\/technology\/2020\/sep\/29\/google-to-lease-extra-70000-sq-ft-in-uk-offices-despite-remote-working","DATE":"2020-09-29","PLAIN_TEXT":"Google is to lease an additional 70,000 sq ft in office buildings close to its PS1bn new UK headquarters in London, despite telling all of its 4,500 UK staff that they will be working from home until at least July 2021. The US tech giant, which is in the process of building a 330 metre-long office building nicknamed the landscraper next to Kings Cross railway station, is reportedly in advanced talks to lease more space in nearby offices. Related: Google commits to vast London office despite rise of remote working Googles request for more space comes despite many big companies attempting to shrink the size of their offices due to the coronavirus pandemic, as many workers are expected to continue working for home for many more months. The landscapers 330 metres will make it longer than the 310-metre height of the Shard skyscraper. The building, designed in the studios of Thomas Heatherwick and Danish architect Bjarke Ingels, has a capacity of up to 4,000 workers. It stands 11 storeys tall, is topped with a roof garden, and will boast a 25-metre swimming pool, indoor basketball court and nap pods for weary staff. Google is also planning to take over an eight-year lease of around 70,000 sq ft across two buildings nearby in Kings Cross from publishing company Macmillan, according to a report in The Times. Google did not immediately respond to a request for comment. The company has also agreed to extend a lease at the Central Saint Giles development near Tottenham Court Road, for a further decade. It comes after Google scrapped plans earlier this month to rent a building in Dublin with capacity for 2,000 workers. It said it was committed to Ireland but did not explain the decision. Googles expansion comes despite experts predicting that people will not return to spending five days a week in the workplace even when the pandemic is over. The British Council for Offices (BCO) said working patterns had changed for good as a result of Covid-19, and in future white-collar workers would adopt a mixed approach, combining remote working with several days a week spent at their desks. Sign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk Sundar Pichai, Googles chief executive, last week said the company would focus on a hybrid model that would include both office and remote working. We firmly believe that in-person, being together, having that sense of community is super important for whenever you have to solve hard problems, you have to create something new, he told Time magazine. We dont see that changing. So we dont think the future is 100% remote, we definitely value our offices, we value the culture, but we do think we need to create more flexibility, a more hybrid model.","SOURCE":"The Guardian"},{"ID":"nyt:\/\/article\/b33a8e33-dc81-5631-bf22-09655f570001","URL":"https:\/\/www.nytimes.com\/2020\/04\/17\/business\/vimeo-anjali-sud.html","DATE":"2020-04-17","PLAIN_TEXT":"Anjali Sud has never been busier. As the chief executive of Vimeo -- a video-streaming platform with 175 million registered users -- Ms. Sud is dealing with swelling traffic as the world, sheltering in place, looks for virtual connections.From her parents home, Vimeos Anjali Sud oversees 600 employees and surging demand for feeds of documentaries, yoga classes and funerals.","SOURCE":"New York Times"},{"ID":"t3_rvauwd","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/rvauwd\/burnout_prevention\/","DATE":"2022-01-03","PLAIN_TEXT":"Ive been doing this for about 5 years now. In that time Ive worked on more technologies, frameworks, languages, and awful codebasesdatabases than I can count. Ive also experienced burnout a number of times. Ive found out how to avoid it, and Id like to share my secret:Stop working so hard. Full stop. My goal is to always be around 50-65% capacity. Now, that doesnt mean I half ass my work. It means I work 4-5 hours a day most days, and it takes me a bit longer to do things, but I get them done properly, and usually faster than other people because Im fairly good at this stuff. Ill work a bit more if I have meeting heavy days, because those are easier for me than coding or architecting new systems and apps.If your company is understaffing, be mindful that you should be looking for significant and meaningful hiring practice changes, a large pay increase or bonuses (in writing) for the picked up slack, or another job.If your company is demanding that you shorten development and testing cycles without additional staff or allowing code debt reduction cycles first, start looking for a new job, and immediately cut your efforts to 50-65%. If your company is loading you up beyond what you can handle at 50-65% capacity, say no...you have more power than you think. If you say no and there is blow back, start looking for a new job. Thats not cool and you dont have to take one for the teamHere is why this is good for you, the business, and the rest of us:Management bases need to hire and level of skill required for a position based on what they think is happening. If you are working 50-60 hoursweek, you are hiding a staffing problem from management or stakeholders. Youre artificially inflating their profits. By working 40 hours or less, youre helping the company properly staff. By saying I cant do more projects youre communicating effectively your limits. By letting them trample you, youre doing yourself, your family, and the company and its employees a disservice. They need us to communicate these things in order to make better decisions. Then, if you do communicate these things and the company doesnt change, you know 100% that its time today to say fuckem and find a better position. Guaranteed youll find something better. They need you more than you need them in most cases. My point is, take this new year to focus on improving your mental health, lowering your stress, and fighting for better work environments. Stick it to these companies underpaying and taking advantage. Good luck and happy new year!!Edit:Based on some comments I think its important to point out that you shouldnt be wasting your extra efforts. You should be becoming a better human. Take courses, grow, be with your family, eat better. Do things that will make you more effective. If your working hours are more effective, then you are actually improving the company, standing up for healthy culture, and being a good example.Edit 2: Wow. How serendipitous that that Kent Beck quote would be in the headline of ExperiencedDevs today. Im not a great programmer. Im just a good programmer with great habits. I think this speaks volumes. Take care of yourself, and I implore you talk about this with co-workers, so they too can take care of themselves. If management hates it, its not you that needs to change, its management.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_m3geg8","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/m3geg8\/kinda_sadistic_but_i_am_enjoying_it\/","DATE":"2021-03-12","PLAIN_TEXT":"I am at this very moment living the days that so many of us only dream of. The joy of seeing people (who took your efforts, skills and work ethic for granted) genuinely struggle and suffer.The story:I having been working at my current company for 3 years now. I learnt everything about my process in my early days because I wanted to, and not because someone told me to.My early efforts made me very good at my job. This led to the manager to believe that my job is very easy.Cut to covid times, and all the core members except me had left the company. The manager hired all new peeps, and even a new TL. It was kinda insulting that they hired someone from outside to be my TL even though I had more experience in this process.During the lockdown, after giving all the new members initial training, I asked everyone to keep going through the code, this will raise many queries and to please bring those queries to my attention. During the 9-10 months I didnt receive even 1 query from any of them. They all had been basically enjoying their honeymoon. Being paid for doing nothing.Still, I didnt mind, coz I was more in contact with my client than my manager. And I enjoyed the work. Problem began when the new TL started to act like TL. He would join in on calls that didnt directly concern him. Ask me about updates on particular tickets which he didnt know anything about. He would speak out of turn in the daily stand-ups in front of clients, and then in private would try to pin it on me when he got an egg to the face for saying something stupid in the stand up.So, what none of them knew was I had been busy this whole lockdown upskilling. Got my AWS certificateS, learnt and built practice projects on Spring and React.Cut to last month. I received an offer from a pretty big company with a 200% hike (because I was already being way underpaid according to industry standards).I issue my resignation, and my manager basically scoffs at me. His whole air was like what you do isnt difficult, youre easily replaceable. A couple of weeks go by and I had been slowly taking myself out of the operations. Letting the other guys handle the client calls and work tickets. And then yesterday it happened. My manager calls me. Starts talking bs crap like how I have been holding up during the covid. Trying to make small talk. I test it like any other conversation and talk to him casually. After about 5 mins of pointless blabbering, he says, hell counter the other offer and with a 20% hike. I politely declined it. Told him its time for me to see the outside world. He ends the conversation abruptly in visible frustration. I have told my TL that I am happy to address any queries while I am still there. But the thing is, my notice period isnt long enough to cover the whole project(350k lines of code with a large chunk being legacy code, that has been there since 2008). And my TL knows it.I am just endlessly giggling internally seeing them struggle just to have a productive conversation with the client. The client is clearly getting frustrated, my manager is under pressure from the client to get the issues fixed and my TL is just in a very sad place. This makes me happy. Its sadistic, I know. But I am just a human.TL;DREnjoyed my work. Made it look effortless. Manager thought my job is very easy. Was overlooked for promotion and never got a decent raise. Issued my resignation, now theyre suffering trying to figure out how the hell I was doing it.Edit:MY GOD!! never thought my post would get this much attention. Everyone here has made me feel even happier.Edit: Addressing the other side.I see that some arent as approving of my post as others. To them, I would like to say thank you for bringing the other side of the coin into perspective. I assure you all, my intention was never to put anyone in a difficult situation. I just took a better job, everything else just happened by consequence. I am sure the people who are negatively affected by my switch arent intrinsicly bad people, but I also feel this was a lesson they all had to learn someday.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_vc2pnx","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/vc2pnx\/for_those_wfh_what_does_your_daytoday_look_like\/","DATE":"2022-06-14","PLAIN_TEXT":"I have a few friends who secured remote SWE jobs, and I am also applying for remote jobs so theres some likelihood I might end up working WFH. For this reason, I am interested to know more about the day-to-day routine of a software engineer WHF. What does your setup look like (e.g., do you have maxed-out WHF station with standing desk, at least 2 monitors, etc?) Do you work all the hours? Are you more a person who gets things done in the morning? In the afternoon? Do you still have many meetings? How do you keep communication with your team? Is it easier to reach out to teammates when you need help? Do you miss working in-person?","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_ia8lnc","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/ia8lnc\/people_who_complain_about_not_finding_jobs_in\/","DATE":"2020-08-15","PLAIN_TEXT":"The majority of posts Ive seen where people complain about jobs have the same kind of structure.Im a new grad  boot camp grad and I have little-no experience with no projects and I cant find a job. Ive been grinding leet code for weeks  months and can do Hards but its not helping. Ive only been applying to Fortune 500 companies and FAANG in the WestEast coast and now Im burnt outI graduated with a non CS degree, okay GPA, and a year worth of non-CS job experience. I applied for ~30 companies, got 2 interviews, and 1 offer. I didnt get lucky I just applied to small companies in the Midwest. I didnt even look at FAANG. I dont have a stellar paycheck of $80k starting but Im happy enough starting at $58k knowing I can find a new job with a years worth of experience that pays better. Also, a low paying job is better than no job. I have not once looked at any leetcode type website. My technicals were easy enough to problem solve through in those two interviews. I had 2 java based projects on my resume. Leetcode DOES NOT MATTER PRE-INTERVIEW. Even during the interview if you can reverse a linked list but botch your STAR interview questions youll flop. Projects to put on your resume that you can talk about are much more important. Id venture to say the majority of SWE positions do not even do leetcode style programming day-to-day.Stop grinding leet code. Stop only looking in densely populated areas. Stop only applying to large companies. Stop thinking youre gonna start your CS career at $100k a year. Your career is a marathon and not a sprint. The company I got an offer from said they had 3 spots open for months, and I was the first eligible candidate to apply. The 2 other spots just got filled last week (so, ~6 months from job posting)Edit: I guess people are still reading this post for the first time so Ill address some common comments:1) I said I had technicals for my interviews. This means leet code style problem and explaining space and time complexity. I didnt need leet code to prepare for this. 2)Ill reiterate leet code is not important PRE-INTERVIEW. If you manage an interview with a company then its a great tool to brush up on your problem solving skill. Most posters Ive seen on this subreddit do not manage to make the interview stage, making leetcode obsolete.3)You can have dreams to work at a big company, and you should definitely work towards it. But if you dont have the experiencegpa then stop burning yourself out with rejections from huge companies that can be picky with candidates. A smaller company that pays less can be a great stepping stone.4) If you have been applying to bottom of the bucket jobs and still not having luck, I apologize for the post, this isnt directed to you. Tune your resume and work on projects instead of leet coding if you cant land interviews. 5) I never said you had to move to the Midwest. There are small low paying tech jobs all over the states. These arent as good when in a HCOL area, but again, these are a stepping stone.6) I went on indeed and looked up computer science in {Specific state in Midwest}, United States and sent an application to anything asking for &lt; 5 YOE. I tailored my resume to focus on my skill with Java, which landed me a back end java job.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/7914191b-33c2-5e9f-81d5-fe15a183f9fd","URL":"https:\/\/www.nytimes.com\/2021\/07\/02\/opinion\/work-jobs-employment.html","DATE":"2021-07-02","PLAIN_TEXT":"In the spring of 2020, the U.S. economy went into what I described at the time as a medically induced coma: We shut down much of the economy in an attempt to limit the spread of the coronavirus. This was, in retrospect, a wise policy that should have been followed much more thoroughly. After all, by slowing the spread of the virus, we didnt just avoid overwhelming the health care system; we also bought time for the development and dissemination of vaccines, so that tens of millions of Americans who would have been infected without the lockdowns ended up dodging the bullet.Working from home was an infant industry; so was early retirement.","SOURCE":"New York Times"},{"ID":"t3_y8pb3z","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/y8pb3z\/where_do_you_find_extremely_chill_jobs_where_you\/","DATE":"2022-10-20","PLAIN_TEXT":"Basically title.Worked out the math, and even making top salaries at top paying companies (stripe, etc) youll still end up sacrificing the majority of your prime years (20s, 30s and even 40s).Seems like the only way to true freedom is to find one of those jobs where you have your laptop on for like 2 hours per day while being fully remote.Where can I find a job like this? Life is way too short.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_106dt09","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/106dt09\/returned_from_maternity_to_a_different_developer\/","DATE":"2023-01-08","PLAIN_TEXT":"Ive returned to work in October following a year of maternity. As you can imagine I was extremely anxious till I could learn everything about the site thats been built while I was away. I was welcomed with open arms and complete understanding from the team which was wonderful. For context before I left and since Ive returned Im on track to be made senior in the coming months.Unfortunately the developer culture was not how I left it. For context I felt it was a standard way of working: Pick up tickets, discuss anything needed regarding implementation, code it, demo and code review with the team once PR goes up, address comments from PR reviews, get approvals, merge, test etc etc. I came back to developers allocating tasks to each other when a story is subtasked, they mob tasks by getting on an untimeboxed call to work on a single task and easily spend over 2 hours watching one developer code the task. The PR then goes up and is expected to instantly get approved because we were all there for the PR call (the development call actually). This is all one developer that primarily micromanages the tasks and the team and is coding in these sessions. The issue is this guy was my maternity replacement and he started the week after I left so I never got to do a handover. He is also inexperienced in the framework we were using so he learnt on the job this past year. Theyve done an OK job but when I returned I spotted some serious issues which I highlighted. Im also the type of dev that needs to mull over the code so after these sessions Ive been going through the PR and adding comments, they didnt like that. Ive then been trying to be vocal during these calls and even then Im met with excuses for not making changes or fixes. This guy and the other front end developer on the team have created quite a bond over the last year, so I dont have the backing of another experienced dev to what Im trying to say. The other 2 backened devs on the team back me up on standards and best practices but dont go as far as to disagree with the frontenders because they deem it a different domain which has its own way of working. This guy was a lone wolf coder in his last place and is quite loud with his opinions. The dev that has glued to him can be hesitant in her skills and therefore has gone along with everything he says and does, even though she had more experience than him. Im feeling completely alone and like the asshole for disturbing their perfect way of working. How can I deal with a team like this? I feel they dont respect me or my opinions and dont want to change anything or learn anything new or different so why should I stick with this team?Update: Sorry for not responding to people but balancing toddler and free time as most of you know is not easy. Thank you all fornyour feedback. Some of you brought me awareness to the different ways of working while others gave me some sound advice. Ive been doing some soul searching into what I really want and frankly I want to feel part of a team. I made a suggestion on a PR, in chat and on call with the team backed with video evidence. A one line change that has blown up into a potential improvement ticket, a meeting with 8 people to implement a whole thing just to avoid my suggestion. Im basically outvoted and outnumbered on anything really. I have a few chats to make with people and then will see how things progress from there. But thank you all for your input, its been a great help.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"nyt:\/\/article\/f09f045f-7d3a-5e79-8567-b5527e6c0662","URL":"https:\/\/www.nytimes.com\/2020\/04\/09\/learning\/what-students-are-saying-about-remote-learning.html","DATE":"2020-04-09","PLAIN_TEXT":"Please note: This post is part of The Learning Networks ongoing Current Events Conversation feature. We invite students to react to the news via our daily writing prompts and, each week, we publish a selection of their comments.Teenage comments in response to our recent writing prompts, and an invitation to join the ongoing conversation.","SOURCE":"New York Times"},{"ID":"society\/2022\/jan\/07\/a-social-care-covenant-how-might-archbishops-plan-work","URL":"https:\/\/www.theguardian.com\/society\/2022\/jan\/07\/a-social-care-covenant-how-might-archbishops-plan-work","DATE":"2022-01-07","PLAIN_TEXT":"What is the problem with how we help elderly and disabled people? The quality of life of social care recipients in England is a lottery based on their council area, wealth and the availability of family to offer unpaid care. Social care is means tested and councils do not pay enough to care operators to cover the cost of state-funded recipients, so private funders in effect subsidise them. Standards and availability of care are patchy, families end up bearing a huge burden and people occupy NHS hospital beds when they could be helped in the community. Funding for people who need social care stands at around PS20bn a year compared with PS135bn for the NHS, and the population is ageing. How might Welbys covenant change things? Underwriting social care more fully and setting it alongside education and the NHS as a public good requires, in the archbishops words, making it a national obligation, expressed by the state. That would need wider public acceptance of the merit of improving the quality of life for people nearing the end of their lives, or who are disabled, perhaps by emphasising basic values such as kindness, empathy and justice. Far from everyone will need social care, so a broader state commitment to providing better care is likely to need to be sold by politicians as an insurance policy for all. What approach is the government taking? Its policy announcements have focused more on personal finances than quality of life. The reason for capping care costs at PS86,000 was explained as preventing people having to sell their homes, or in most cases, their children losing a valuable part of their inheritance. Chronic shortages of care staff, which mean about 400,000 people are awaiting care packages or assessments in England, can only be addressed with resources of an additional PS7-PS10bn a year, experts say. Nowhere near that amount is being offered. Does the government have a longer-term vision? The social care white paper, which sets out a 10-year vision, includes elements that could overlap with Welbys hopes. It talks about increasing housing options and spreading innovative community models of care so there is no longer a binary choice between struggling on at home or going into a care home. More intermediate assisted-living options are to be encouraged. This approach could help those who advocate building elderly care into new housing estates and linking care homes with schools to keep the old and young together. A gentler slope between healthy adulthood and death is hoped for.","SOURCE":"The Guardian"},{"ID":"t3_f9i2q7","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/f9i2q7\/my_success_story\/","DATE":"2020-02-25","PLAIN_TEXT":"Hi Reddit! Ive seen this style of post lately and when I was neck deep in job applications it was super helpful to read everyones success stories. It gets so awfully bleak sending out app after app but it does pan out in the end. So I hope this will inspire some of you guys! I also just really felt like sharing since Im so happy to be done with this shit job hunt. Also, I apologize for it being so long. I [22F] graduated in August 2019 with my BS in Computer Science and minors in both linguistics and German. I took summer courses every year so I didnt really have the opportunity to intern at any point while I was in school. I honestly had no idea that this was somewhat of a necessity until I started the job application process. Well started applying for jobs soon after graduation. I actually got my very first phone interview from my 27th application sent out. I passed it. I was thinking at the time that I was getting quite lucky and thought my job hunt was going to be a lot easier than everyone elses. I moved on to the technical interview... this was my first taste of actually realizing I needed to continuously improve on what I had learned during school. I completely bombed it. I started studying every aspect of my degree I could possibly think up in order to prepare for these technical interviews. Finally got through to an on-site at a company located about 2 hours from me at my 49th application. Long story short: I got the job offer for about $65K. However, at the exact same time, I was also offered a 3-month unpaid and fulltime internship position as a graphic designer and web developer. Probably the vast majority of you would think Im crazy, but I took the internship instead. There was something super depressing about the other job offer that made me feel soulless when I walked away, and I just couldnt imagine enjoying life working there. So I get this internship. I learn a lot. I learned I dont really like web development. However, during this time I was also working hard on learning React and Angular in my spare time, which sparked my passion for frontend development and motivated me to pursue this specific job role. I continuously applied for jobs during my internship and even got a handful of phone screens and a couple of Skype interviews. Internship ends. Still no job offer in sight. Internship company promises to put in a good word for a couple big-names like Google and Facebook. Never hear back from them again...2 months afterwards I finally start getting a rapid influx of response to my job applications. I had been preparing a little bit differently up to this point, working on Codility and learning React and a bit of Angular. I was doing coding challenges to keep abreast of my logic and problem solving skills. Finally, my 180th application I get a response from a company in Hamburg, Germany. Now, just as a quick background and a bit of a tangent, Ive been speaking and learning German since I was in early elementary school and always kinda dreamed of moving to Germany when I was older. I didnt really consider it as a possibility as a recent graduate until I realized that life was a little too short to not pursue goals early-on. So I started applying for jobs in both the USA and in Germany, hoping that it would widen my net. I actually remember talking to my parents and telling them that there was something about this job that felt right. Well my gut-feeling was spot on. I passed the remote coding challenge with 100%, passed the Skype pair-programming live technical coding interview, and passed 2 more interviews with HR and the founders of the company. Again, long story short, I got the job. So after a total of 193 applications sent out over the course of 6 months, I have finally landed my first full-time job and will be moving abroad in June 2020 to Germany.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_sj4r8q","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/sj4r8q\/asked_for_a_50_raise_and_got_it_new_tc_150k_im\/","DATE":"2022-02-02","PLAIN_TEXT":"Seen a few negative posts lately about tempering your exceptions for TC in general and based on where you live. Wanted to give a quick success story to raise spirits for any aspiring developers (or current developers aspiring for more) out there. Theres a little bit of luck involved here but I dont think Im an outlier and I think many could follow a similar path to me.I flunked out of college after sleeping my way through high school. Went on to work customer service over the phone for a few years making about $20 hourly at the end and got laid off, decided I wanted a better job for myself in the future. While I was collecting unemployment I decided to hone my lackluster developer skills and start looking for work in software development. I learned python online when I was 16 out of personal interest, so I had some experience to build on, but not much.I didnt do any leetcode, just worked on some personal projects. Found some odd jobs that made a couple thousand but nothing substantial but I made a few connections while doing that. One of those connections eventually landed me my first job as a WFH software developer. $25 hourly and eventually bumped up to a $60k salary. Was happy to take anything I could find to get my foot in the door. Learned a lot on the job and made some more connections. Got hired away through one of those connections with a nice raise to $100k TC still WFH. I was putting in good work and felt that I was outputting a similar quality and quantity of work to the rest of my team but felt like I was making substantially less than them. I thought the company and project were awesome and really didnt want to go looking for other jobs so I asked my supervisor for pretty big raise and several weeks later he gave it to me. New TC at $150k.Now, Im not saying that everyone should go ask their supervisor for a 50% raise and expect to get it. Thats pretty unrealistic. This is just my success story and yeah, Im feeling pretty great about it right now. But if theres some of you out there bummed about your current salary or hoping to land that first dev job, dont get down about it. Work hard, focus on doing good work, and learn as much as you can. Its ok to settle for less in the short term to look for long term gain, work experience and connections go a long way in this field. Best of luck and I hope others can find the success that I have.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/230df041-bf71-51db-9624-e5cebc10f0f0","URL":"https:\/\/www.nytimes.com\/2023\/01\/19\/business\/remote-work-office-sweetgreen.html","DATE":"2023-01-19","PLAIN_TEXT":"Its a tough time for companies that cater to the needs of office workers. For some, like downtown lunch spots that rely on servicing white-collar professionals, remote work options could pose an existential risk.Downtown lunch spots that rely on catering to white-collar professionals are rethinking their business model as more employees work from home.","SOURCE":"New York Times"},{"ID":"t3_ibxk5w","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/ibxk5w\/meta_so_long_and_thanks_for_all_the_fish\/","DATE":"2020-08-18","PLAIN_TEXT":"Hey guys. Just wanted to let people here know that Im dropping my mod status in this sub. Ive been a mod for a while now (was made mod shortly after [this post I made](https:old.reddit.comrExperiencedDevscommentsf6a7t5meta_time_to_crack_down_in_questions_from). The primary reason for me is that Im more or less going to stop participating in any of the IT beginner sub because frankly, its costing me way more energy than it should.Secondly; if I carry responsibility I also want to be in control. Thats not really how the modding system works at Reddit; I dont feel like doing a ton of work in a sub where the actual control is still with a few completely inactive mods.And third; we Dutch have a saying dweilen met de kraan open which literally translates to to mop while the tap is open which is what modding a sub like this feels like. No matter the goals we set for this sub; even with clear beginner questions, there are WAY more people actually responding to the question than there are people reporting them. If this community actually wants a group for experienced developers, it should stop accomodating the much larger group of inexperienced devs that over time will turn this sub in a smaller rcscareerquestions.Cheers :)","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"nyt:\/\/article\/c4a1b397-82ea-59a5-9966-01b80f638da4","URL":"https:\/\/www.nytimes.com\/2020\/04\/22\/us\/politics\/house-remote-voting-coronavirus.html","DATE":"2020-04-22","PLAIN_TEXT":"WASHINGTON -- Democratic leaders backed away on Wednesday from a plan to change the rules of the House to allow lawmakers to cast votes remotely for the first time in history, after Republicans who are clamoring to reopen Congress registered their sharp opposition.Speaker Nancy Pelosi scrapped a planned vote to change House rules to allow remote voting for the first time in Congresss history, amid Republican opposition.","SOURCE":"New York Times"},{"ID":"t3_r4xuaw","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/r4xuaw\/why_do_most_recruiters_on_linkedin_wish_i\/","DATE":"2021-11-29","PLAIN_TEXT":"Usually I get a nice spam message from a LinkedIn Recruiter, this often looks like just an automated copy-paste message they probably send to a massive amount of people.I often ask something along the lines of:Hello, thanks for reaching out to me! Whats the salary range? Is it remote work? What cities are you hiring for? Which Tech Stack does the position use? How is the work-life balance &amp; culture at this organization? What time zone would I be working if remote? I am currently available for Senior or Mid-level positions &amp; promotions.My response is any combination of these questions, but they so very often rather setup a 15-30 minute call with me. Is there any reason they prefer to operate like this? Do they get bonuses for logging videoaudio calls? Am I being scammedtaken advantage more easily by accepting their calls?Ex-Junior developer looking to transition into a more mid-level role. Excuse me for the inexperience in the recruiting process!EDIT: Title is supposed to read--Why do most recruiters on LinkedIn wish I schedule a 15-30 minute phone  video call with them, instead of answering the few questions I have via messaging?","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/4d8f7090-810a-57e4-ab2a-898422e2d227","URL":"https:\/\/www.nytimes.com\/2020\/08\/07\/us\/remote-learning-fall-2020.html","DATE":"2020-08-07","PLAIN_TEXT":"With some combination of optimism, anxiety and wishful thinking, many educators spent their summers planning, in minute detail, how to safely reopen classrooms. Teachers stocked up on sanitation supplies as superintendents took a crash course in epidemiology and studied supply chain logistics for portable air filters.Education leaders spent months preparing to reopen classrooms. But with online learning set to continue for millions of students this fall, schools must catch up with reality.","SOURCE":"New York Times"},{"ID":"nyt:\/\/article\/5045612c-cf47-5944-84f1-f114e381d02b","URL":"https:\/\/www.nytimes.com\/2022\/03\/04\/business\/economy\/remote-work-is-changing-how-climbing-the-career-ladder-works.html","DATE":"2022-03-04","PLAIN_TEXT":"Remote work is often favored by established employees who know their manager, are comfortable in their role and want to balance work with family responsibilities or other personal obligations. For those just starting their careers, working in isolation can make fitting into an organization -- and eventually progressing up its ranks -- more difficult.","SOURCE":"New York Times"},{"ID":"t3_gh319k","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/gh319k\/is_anyone_here_motivated_by_money_rather_than_a\/","DATE":"2020-05-10","PLAIN_TEXT":"TLDR: If you are a good programmer making decent money - did you enter the industry knowing the earning prospects, or because you were genuinely fascinated by programming?Im 22, have worked 2 years (Uni dropout from civil engineering after 1 year) in sales, considering going to back to University at UNSW (top Australian school) to study for 3 years to get a high paying SDE job.Financial independence is my goal.I have learned some great sales skills from working in sales for the last 2 years however I dont have any technical skills and dont want to be in pure sales for the rest of my life. A senior salesperson in my industry with 7+ years experience can make about 300k but this process is often quite stressful and luck dependent with frequent 60 hour workweeks.Im thinking software development may be an easier route to financial independence (less stress. higher probability) Ive seen my friends graduate with a software Engineering degree and get 180k TC offers from FAANGs - Id like to jump on this boat too.Only issue is Ive never been that drawn towards programming. My successful programming friends have always been naturally interested in it, Ive done a programming class before and found it OK interesting, however its definitely not something Ive ever thought about doing in free time.I am fully prepared to give away 10 years of my life grinding my ass off to achieve financial independence. Not sure if its best for me to do it in sales or study hard and become a great programmer - and then love it because of how much money Im making?And when people ask me to follow my passion - well, Im not getting into the NBA. I am an extraverted people-person and I entered sales thinking it was going to be extremely fun all the time - Ive now realised that its relatively repetitive &amp; uncreative with little transferrable skills. I just want to know where I should be focusing my efforts for the next 10 years of my life to set myself up for financial freedom and happiness. ","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"lifeandstyle\/2021\/jul\/05\/let-your-kids-entertain-themselves-tips-for-keeping-children-occupied-while-working-from-home","URL":"https:\/\/www.theguardian.com\/lifeandstyle\/2021\/jul\/05\/let-your-kids-entertain-themselves-tips-for-keeping-children-occupied-while-working-from-home","DATE":"2021-07-04","PLAIN_TEXT":"Like many parents, I have had to cancel travel, play dates and school holiday activities thanks to the lockdown thats currently enforced in greater Sydney. And like many parents, thats also meant working from home with my children hovering over my shoulder, asking for their next snack or chance to leave the house. Its an impossible juggle, made worse by wet weather last week keeping us indoors. According to survey results from the Australian Institute of Family Studies, 67% of Australian parents work from home (up 25% since Australias lockdowns began in 2020), but their experiences are far from seamless, with 49% saying they find it difficult to combine work and care responsibilities, and 40% saying they were always or often actively caring for children while working. So how does one manage? Rachel Tomlinson, registered psychologist and author of Teaching Kids to be Kind, suggests trying to keep your children as close as possible to their usual routines - even packing their lunch boxes - to protect their sense of consistency and safety. Set up activities that involve delayed gratification or some future goal, like ... planting some herbs, or an art project Rachel Tomlinson The random nature of lockdown and the lack of preparation or awareness that often comes with it - coupled with the confusion around Covid-19 itself - makes for an emotional time for children, who dont cope well with change at the best of times. Setting clear expectations, routines and boundaries can also help children adjust around your work schedule. Having clear signals or symbols that represent time or situations where parents cant be interrupted, like a sign on the office door, or headphones on, is really important, she says. If we involve them in the planning of the day, or negotiations around how boundaries are set, they are more likely to respect the rules ... because they were involved in the process. She also advises carving out time to be truly present with your children, looking them in the eye, sitting close and engaging in quality interactions without the distractions of work or phones. Related: Happy hookers: how prescribing creativity might help wellbeing Then, when you do need to work, she suggests choosing tasks for children that offer a sustained involvement. Having a tick box or activity list can work really well to keep kids occupied long enough for you to tackle your to-do list. Set up activities that involve delayed gratification or some future goal, like ... planting some herbs, or an art project, she says. Balance out their activities and plan something to meet [their] different needs - physical, emotional, social. Dont keep virtual meetings to yourself either, Tomlinson advises. Put your kids to task on online courses, video demonstrations, or even games and quiz sessions with friends and family online. Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning This was Andrea Christie-Davids exact thought when she extended the services of Leor - the in-home, early childhood education and disability support service she founded in 2018 - to families stuck at home during the lockdowns of 2020. She knew there was a demand for a fun and engaging interactive learning program that could free parents up for an hour each day. She is holding free online playgroups for families at 11am AEST every weekday until 9 July. Families can book into the online playgroups through Leors Facebook page, and can expect their children to do things such as yoga, craft, show and tell, and treasure hunts with items in the home that they can then show other children in the group. We have been overwhelmed by just how engaged children have been ... they have focused on the yoga and completed craft activities with other children online, she says. Resilience educator Fiona Perrella suggests getting your kids to create a boredom buster jar filled with activities they decided on themselves. Photograph: Sonja RachbauerGetty ImagesiStockphoto If youre reading this and wondering about your own childs ability focus, dont fret, because resilience educator and mum Fiona Perrella says that boredom can actually be healthy for your children too. Every time you find something for them to do, you are teaching them that their entertainment is dependent on other people, she says. Lockdown is an opportunity to let your kids develop the ability to entertain themselves. Perrella founded Strength Heroes, which creates art and play-based experiences for children, in 2012. She offers activity ideas on Facebook and Instagram, as well as a free downloadable kit of activities on the Strength Heroes website. Like Tomlinson, she says creating a day plan with your children with blocks of time for different purposes, and sticking to it, can be an effective way to safeguard work time. It puts the onus on them to address their own boredom. Fiona Perrella recommends asking children to do activities that will keep them social - like interviewing their grandparents about what their lives were like as children. Photograph: Pollyana VenturaGetty Images While you work, children can choose activities from a boredom-buster chart or jar, containing tasks they themselves have put together. Stuck for ideas? Turn to social media, where listicles of ideas by parents abound. Sydney mum Daniela Minns list of screen-free activities has reportedly gone viral. While some tasks require parental supervision, others can be tweaked for the working parent by setting them as a challenge. Perrella also has a pro-social approach to her strategies, like writing cards or drawing pictures for people in local nursing homes, chats with grandparents about their childhood over Facetime, and writing missing you cards to friends. Tomlinson says that parents need to be kind to themselves too - practical about their own output, accepting of fluctuations in their energy levels, and adamant about normalising their feelings and engaging in self-care. Its important to be realistic, she says. Most parents dont have degrees in teaching or child education, [and dont have] additional hours in the day to cope with extra duties.","SOURCE":"The Guardian"},{"ID":"world\/2023\/jan\/12\/cold-remote-and-risky-why-australia-is-turning-to-robots-to-boost-its-presence-in-antarctica","URL":"https:\/\/www.theguardian.com\/world\/2023\/jan\/12\/cold-remote-and-risky-why-australia-is-turning-to-robots-to-boost-its-presence-in-antarctica","DATE":"2023-01-11","PLAIN_TEXT":"Robots could soon collect tissue samples from whales off the coast of Antarctica or fly long distances over the icy continent with surveillance cameras, allowing Australian scientists to observe dangerous and previously inaccessible areas. The Australian Antarctic Division (AAD) has partnered with Prof Peter Corke, a robotics expert, to develop a shortlist of new technologies that could improve safety and scientific research on the continent. This process also has a strategic motivation; the federal government has a 10-year plan to boost its presence in the 42% of Antarctica where Australia has a historical territorial claim. Related: Australian team sets off on Antarctica mission to drill for oldest ice core ever obtained Antarctica is where the impacts of climate change are very strong and very easy to discern, so it is important to study the changes in this environment, said Corke, who is a researcher at Queensland University of Technology. But doing this work in Antarctica is just incredibly challenging. Its very cold. Its very windy. Its very remote. Getting people to do this type of work is expensive and theres an element of risk. Sign up for Guardian Australias free morning and afternoon email newsletters for your daily news roundup Corke, who has developed prototypes used at the International Space Station, spent three months with AAD scientists in Hobart researching opportunities for robots. His report has now been presented to the federal government. The division is already using robots to study remote Adelie penguin colonies and to map the ocean floor. Corkes proposals include autonomous vehicles that could service remote campsites. You can imagine a smallish robot - smaller than a regular passenger car - that can tow a sled without a driver. You just tell it where to go and it will do its thing and then come back to you, Corke said. The problem is that when humans do something like this, you cant just have one person out there for safety reasons. There has to be two people at least. And then if something goes wrong, a search and rescue team need to be deployed. Adelie penguins off the east Antarctic coast, near the AADs Mawson research station. Photograph: Australian Antarctic Division Brett Chatwood, a manager in the AADs technology and innovation branch, said work had already started on using robots to monitor whale populations in the Southern Ocean. We are looking at collaborating with international partners to develop the ability to deploy tagging devices from drones and to take biopsies of whales, Chatwood said. At the moment, that work is done by putting scientists into small boats in the Southern Ocean and trying to get close enough to have that interaction with the whales. From a safety point of view, doing that work with a drone is going to be a lot safer for our people and less disruptive for the animals. The federal governments 10-year plan set aside $109m for the development of a new drone fleet, autonomous vehicles and medium lift helicopters. Chatwood said long-range drones would be tested from the research vessel Nuyina, once it returns from repair work. Related: Australian scientists observe rapid decline in Adelie penguin numbers off Antarctic coast The drone itself is a bus. Its a bus that allows us to take sensors to places that we have not been able to take them before, either off a research vessel or stations or field camps, he said. The environment minister, Tanya Plibersek, said the development of robotics was vital to ensuring Australias environmental record in Antarctica. Australias science in Antarctica and the Southern Ocean provides a window into past and present climate that helps informs us about the extent and consequences of climate change, Plibersek said. Academia and industry are working together to develop and adapt robotic technologies for the harsh Antarctic environment in the delivery of globally important climate and ecosystem science. Corke said many of the technologies needed already exist, but must be strengthened to survive in the harsh Antarctic climate.","SOURCE":"The Guardian"},{"ID":"business\/2023\/feb\/12\/remote-working-problems-company-culture","URL":"https:\/\/www.theguardian.com\/business\/2023\/feb\/12\/remote-working-problems-company-culture","DATE":"2023-02-12","PLAIN_TEXT":"The pandemic is over - sort of. But one big question it generated is here to stay: should we ever go back to the office? Its a question I have been asking myself for 18 years. My technology consulting company went fully virtual in 2005. Prior to that we - I ran the business with my father - had an office in a suburban neighborhood of Philadelphia. When my father passed away I started to spend more time in the office and I realized something: the office wasnt so great. Related: Unlimited holiday time for workers is good for business - even small ones | Gene Marks Clients preferred to meet about their projects in their offices, where they could bring together more of their team, so our employees were either at clients offices or working from home (yes, people did that in 2005). Other than a coffee maker and a cat, not a lot was going on. I shut the offices down and we became a fully virtual company. A very, very dysfunctional company. Sure, our overhead became much lower thanks to not paying rent or all the costs of maintaining an office but - initially - it was a pain. Those were the days of dial-up connections, ISDN lines and broadband. No Salesforce, Teams, Zoom, Slack, Gmail. Our companys accounting and other databases were kept on a server in the basement of my house, precariously close to that same cats litter box. All of that has improved of course. And the ease of virtual working means its here to stay. Gallup expects fully remote work arrangements to nearly triple compared with 2019 figures. But running a fully virtual business still isnt any better today than it was in 2005 and - long term - I can tell you it has issues. And then some. First, closing the office should have cut my overhead. It has and it hasnt. I no longer have to pay rent and utilities, nor do I have to maintain a coffee machine and pay a cleaning service or all the other expenses required to maintain an office. Instead Im forking out endless, ever-increasing subscription fees for countless cloud-based applications, tools, services and platforms and for security software. Then there are the ever-evolving list of tax issues. What forms should that remote employee or contractor be filing to be in compliance with all the local rules? What are my responsibilities? What are my liabilities? These are headaches I never had in 2005. I have workers who Ive never personally met face to face. There are additional employment costs, too. Im reimbursing my employees more for their travel as their need for human contact has increased and for the costs of their own home offices, for which I have assumed responsibility. Im paying extra if theyre located in higher tax locales. Im paying more for their paid time off and expanded flexibility which comes hand in hand with a virtual organization. I may be paying more for their lack of productivity but I have no way of knowing this. All of those are the direct costs of running a virtual company. But theres something - though indirect - that amounts to a much bigger cost: my companys culture. My team never - never - sees each other, except rarely at clients offices. Thats strange. I have workers who Ive never personally met face to face. Ive met other employees at clients and had to do a double-take to make sure it was really who I thought it was. In the past Ive tried to have holiday parties but the gathering of strangers who shared a slim employment connection was just too awkward to bear and so I discontinued those. Related: Its business as usual as in person conferences catch up to pre-Covid levels Theres no collaboration, no innovation, no fun, no personality, no dramas, no shared opinions of The White Lotus. Everyones off on their own little islands. We dont exchange client stories or ideas or problems or issues and solutions on projects which, if pooled together, would certainly benefit everyone. I sometimes have trouble hiring people, particularly younger people who - despite what some studies may say - want to be in an office, at least some of the time, so that they can be mentored, guided and helped to adjust to their new life. We have no onboarding or off-boarding rules. I have trouble evaluating people, other than relying on client feedback and my accounting manager emailing me when theres a collection issue due to bad service. We are a small, interconnected collection of strangers who happen to be working on the same clients. You could tell me that all of these problems are fixable. I could make it a point to hold more face-to-face meetings, social events and team-building activities in restaurants, hotels, event spaces or public parks. We could throw axes together, join a volleyball league, go on a company retreat, barbecue burgers but ... nah, Im too lazy for that. And besides, most of my employees - surprisingly, you might say - have been with my company for enough years that Im pretty sure they would resist. Given that turnover has been pretty low, Id say theyre happy with this arrangement. Maybe things would be better if I opened an office. Ill never know. Sure, running a fully virtual company can save money and apparently its what people want. But it can also be very, very dysfunctional. Thats been my experience. So now you know.","SOURCE":"The Guardian"},{"ID":"nyt:\/\/article\/84abe362-0a3a-5fcb-8751-6c6702ae4a32","URL":"https:\/\/www.nytimes.com\/2021\/06\/09\/opinion\/women-motherhood-jobs.html","DATE":"2021-06-09","PLAIN_TEXT":"Veterinarians and pharmacists may be able to help us with more than our pets and our pills. Perhaps they can also guide America to a society that works better for Americas moms.The big problem for professional women isnt old-fashioned discrimination. Its bigger than that -- but there is a way forward.","SOURCE":"New York Times"},{"ID":"t3_10h2fo7","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/10h2fo7\/dont_self_sabotage\/","DATE":"2023-01-20","PLAIN_TEXT":"I recently had the chance to talk with a few people from reddit and HN about some job offerings my company had. It was a cursory discussion not as a recruiter but as a manager looking for candidates for across our company. Here were the biggest issues I noticed:- For some reason those on video didnt clean up. Wearing a beanie. Wearing a wrinkled t-shirt. I at least threw on a polo and combed my hair. If talking with someone about a 6 figure job at least present yourself business casual- If you are desiring a remote position figure out how to present yourself remotely. Namely - have a working microphonecamera. I use a $15 model nexigo camera from amazon and never had any complaints. Practically everyone had microphone issues, their camera and mic couldnt be on at the same time, or had other technical issues. - If your talking with me about potential jobs have a resume or cv ready - dont just send me to your linkedin page. I need something I can distribute and a linkedin page doesnt always come across the way you think it does. Having a C-suite guy only have a linkedin page that says CEO of X company and a couple other Director positions with no detailed information was a bit of a letdown. When i asked for ResumeCV to share with others he had neither prepared.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/wirecutterarticle\/e7dc7e49-a436-5326-af65-2a27a73619b7","URL":"https:\/\/www.nytimes.com\/wirecutter\/blog\/work-from-home-starter-kit\/","DATE":"2020-03-23","PLAIN_TEXT":"If youve ever had to work at a hotel while on vacation or at a family members house over the holidays, you know you can still get work done (if your job allows it) with just three items: a computer (or even a tablet), a reliable (preferably high-speed) Internet connection, and power. Thats the bare...If youve ever had to work at a hotel while on vacation or at a family members house over the holidays, you know you can still get work done (if your job allows it) with just three items: a computer (or even a tablet), a reliable (preferably high...","SOURCE":"New York Times"},{"ID":"nyt:\/\/article\/4cdde018-d71c-5469-9f18-09840caf8a9a","URL":"https:\/\/www.nytimes.com\/2021\/01\/21\/arts\/television\/international-losing-alice-gomorrah-flack.html","DATE":"2021-01-21","PLAIN_TEXT":"Even in these boom times for television imports, its an unusual bounty.A jam-packed itinerary of premieres includes France (Call My Agent!), Italy (Gomorrah), Israel (Losing Alice) and Britain (Flack and The Sister).","SOURCE":"New York Times"},{"ID":"nyt:\/\/article\/c08fa2bb-b094-5151-a54c-3f167b09d2c3","URL":"https:\/\/www.nytimes.com\/2021\/07\/20\/technology\/apple-return-to-office-delay.html","DATE":"2021-07-20","PLAIN_TEXT":"Apple pushed back its return-to-office plans by at least a month in response to the recent surge in coronavirus cases, which has been fueled by the spread of the Delta variant.Employees are now expected to come back to the workplace as early as October, a month later than planned.","SOURCE":"New York Times"},{"ID":"nyt:\/\/article\/4d22fce9-4cfa-54f6-9abc-db85f116323c","URL":"https:\/\/www.nytimes.com\/2020\/03\/30\/learning\/has-your-school-switched-to-remote-learning-how-is-it-going-so-far.html","DATE":"2020-03-30","PLAIN_TEXT":"Has your school shifted to remote learning in response to the global pandemic? How is it going so far?What does a school day now look like for you? Are you able to stay on task? Do you have enough work to do -- or too much? What do you miss the most about going to school in person every day? What do you miss the least?","SOURCE":"New York Times"},{"ID":"t3_10tnhi2","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/10tnhi2\/handling_resentment\/","DATE":"2023-02-04","PLAIN_TEXT":"Im approaching 10 years in the industry, having worked in different roles both in small shops and Fortune 500 companies.The amount of idiocy in the management and leadership is driving me nuts. These people are everywhere, they have spread like cancer and theres no way I can see to fight them. One useless clueless corrupt idiot isnt going to fire another one for doing exactly same things.Engineers who carry this entire industry on their shoulders are constantly belittled, made fun of, and generally treated with utmost disrespect and open disdain. The work from home debate was the final straw. The amount of shit I heard from MBA types telling the cattle to get back into the stable was truly astonishing.Working in middle management I find myself surrounded by people whose values I am disgusted by, working as an individual contributor I find myself burnt out because all my care and skill is flushed down the crapper by people cosplaying pointy hair dude from Dilbert.Is there any hope or I should go open a flower shop?","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_udea3v","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/udea3v\/is_the_tech_lead_position_the_short_end_of_the\/","DATE":"2022-04-27","PLAIN_TEXT":"I feel this can easily vary from company to company, but right now I am working as a TL that feels like is doing a bit of management, scrum master, dev and just now Ill be doing PO work while we look for one. I work for a well funded startup that is looking to hire more at the moment.Is this common? Is it the exception?","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"nyt:\/\/article\/ab90614f-8bbe-5530-b884-3eb87cbe2657","URL":"https:\/\/www.nytimes.com\/2022\/07\/14\/nyregion\/municipal-workers-have-joined-the-great-resignation.html","DATE":"2022-07-14","PLAIN_TEXT":"Good morning. Its Thursday. Well look at why municipal workers in New York City are quitting. Well also meet someone whos not rattled by rattlesnakes, on the job or off.New York City employees are back in the office, and many of them are not happy about it.","SOURCE":"New York Times"},{"ID":"nyt:\/\/article\/d9b43abc-d7ab-5402-a01e-fa36425a08a8","URL":"https:\/\/www.nytimes.com\/2020\/07\/27\/business\/dealbook\/remote-work-risks.html","DATE":"2020-07-27","PLAIN_TEXT":" Our DealBook Debrief call this week is with Tom Friedman, the Times Opinion columnist, who will discuss American diplomacy in a post-pandemic world, and take your questions. Register here to join us on Thursday, July 30 at 11 a.m. Eastern. (Want this delivered to your inbox each day? Sign up here.)Profound changes may result if remote working becomes more widespread and long-term, creating winners and losers.","SOURCE":"New York Times"},{"ID":"t3_p2bmvl","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/p2bmvl\/why_are_employers_against_remote_work\/","DATE":"2021-08-11","PLAIN_TEXT":"Ive commonly heard the reason middle managers want to be able to monitor everyone and lord over their reports but that seems a bit angsty and unrealistic that so many middle managers feel that. What is the actual reason?","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"nyt:\/\/article\/779a0399-5f38-56f7-b38b-925b3c22898e","URL":"https:\/\/www.nytimes.com\/2021\/03\/15\/opinion\/cities-covid-remote-work.html","DATE":"2021-03-15","PLAIN_TEXT":"In 1957 Isaac Asimov published The Naked Sun, a science-fiction novel about a society in which people live on isolated estates, their needs provided by robots and they interact only by video. The plot hinges on the way this lack of face-to-face contact stunts and warps their personalities.Lessons from Alexander Hamilton and the book trade.","SOURCE":"New York Times"},{"ID":"commentisfree\/2022\/sep\/21\/year-home-office-asylum-interview","URL":"https:\/\/www.theguardian.com\/commentisfree\/2022\/sep\/21\/year-home-office-asylum-interview","DATE":"2022-09-21","PLAIN_TEXT":"Last month, my wife and I learned that we are having a baby boy. I feel really glad, so grateful, but at the same time, I want everything for him. Its been more than a year since my interview with the Home Office and I have heard nothing: I still dont know if we will have permission to remain in the UK. Its frustrating when you have presented so much evidence, so many documents, and you know they have all the information to make a decision. Until they do, though, I dont have permission to work - and we are still living off the PS80 a week we receive in asylum support. Now that we have a new prime minister, were watching the news, reading up on the new cabinet, looking at any speeches that could show what their policies towards asylum seekers may be. Will the new government make the processes faster or slower? Were dependent on them for access to the NHS, to accommodation, for our sons education and healthcare, for everything. Earlier this year, with the first talk of transporting asylum seekers to Rwanda, I realised how quickly things can change. Part of my heart was thanking God that we hadnt crossed the Channel illegally so it wouldnt apply to us. The rest of my heart went out to the poor people who have risked their lives to come here, a country they believed to be safe, only to be told they now face going to Rwanda - somewhere they may know nothing about. For me, this would be terrifying. Related: Fridges are expensive. This winter I may have to finally turn mine off | James Every week, its harder to live within our budget. When we first came to the UK, we were eating chicken maybe twice a week. Now we cant afford that - we have a lot of baguettes stuffed with vegetables or some kind of filling. Bread is probably not so healthy, but at least it makes you feel as if youre full. Last week, my wife and I started back at college for our English and maths classes. The four-day passes for the buses cost us PS20. It meant we couldnt put anything aside to save for the glasses that we both need - we think they will cost us PS95 each. So for now, I have to sit at the front of the class where I can see, and try not to flag down the wrong bus because I cant read the numbers on it! Going to college is one thing that we cant give up. We have accommodation, were not allowed to work at the moment, and we dont pay energy bills - but I can see how hard it is, how everyone is suffering. Its like standing on a beach where things appear calm, knowing a tsunami is approaching and youre going to be in big, big trouble. If I am given leave to remain here, we will need to find a home, Ill need to find a job that will pay all the bills, Ill need to support my family. I can see how hard it will be, but in my country, my family always worked hard. My parents were both teachers. My father actually had three jobs: teaching in a school, driving the school bus home and working as a tutor in the evenings. I hate to think of my son growing up and seeing me like I am now, as someone who doesnt work, who doesnt bring home the food, who sits around waiting for the result of his asylum claim. I want to be someone who contributes. Id love to work in a job that involves taking care of people, so Ive signed up for a course at my college on work in the mental health sector - although I had to join another long waiting list. I know I can do it. As told to Anna Moore. Paul is in his 30s and is an asylum seeker living in the north of England. Names have been changed The Trussell Trust is an anti-poverty charity that campaigns to end the need for food banks. Show your support at: trusselltrust.orgguardian Do you have an opinion on the issues raised in this article? If you would like to submit a letter of up to 300 words to be considered for publication, email it to us at guardian.letters@theguardian.com ","SOURCE":"The Guardian"},{"ID":"nyt:\/\/article\/5ff569d9-e9d0-5e8f-8f54-ffaa3ae22a62","URL":"https:\/\/www.nytimes.com\/2020\/09\/05\/at-home\/work-school-from-home.html","DATE":"2020-09-05","PLAIN_TEXT":"In March, several days before the coronavirus pandemic brought New York to a halt, Mary Ausman, a parent and church educational coordinator, moved with her husband, their two sons and two dogs from a house in the Riverdale neighborhood of the Bronx to a 600-square-foot apartment in Hells Kitchen. The family wanted their younger son, Alex, 10, a student at the School of American Ballet in Midtown, to be able to walk to dance rehearsals and acting auditions, and looked forward to living in a more central location.The hours blur together, sure, but creating distinct spaces, keeping a schedule and sharing resources can help.","SOURCE":"New York Times"},{"ID":"business\/2021\/dec\/13\/polyworking-and-zoombies-welcome-to-the-new-home-office-jargon","URL":"https:\/\/www.theguardian.com\/business\/2021\/dec\/13\/polyworking-and-zoombies-welcome-to-the-new-home-office-jargon","DATE":"2021-12-13","PLAIN_TEXT":"Name: Zoombies. Age: They are products of our times. Appearance: Pale blue talking heads, dead behind the eyes. I remember them - they lived on an island and needed rescuing. Youre thinking of Zoombinis, the childrens video game. Yeah, maybe. My brain is fried. Were talking about Zoombies - the exhausted, zombie-like survivors of back-to-back Zoom meetings. This sounds like a pandemic thing. It is - part of a new tide of office jargon coined for a workforce that hasnt visited an office in almost two years. I love working from home. Ive only got dressed from the waist up for almost two years. Nevertheless, remote working has consequences. Zooming recreates all the stress of the office without the mitigating compensation of actual human contact. Its dispiriting and exhausting. I had a Zoom meeting this morning, and everyone was bright-eyed and totally focused on work. If you cant spot the Zoombie in the Zoom meeting, then the Zoombie is probably you. Everyone did keep asking if I was OK. Im just tired, I guess. Have you been polyworking, by any chance? No, Im married. Polyworking is another new term: it means seizing the opportunity of home working to perform two or more jobs. You mean people are working harder at home than they would in the office? What is wrong with this country? You know what they say: if a thing is worth doing badly, its worth doing two things badly for twice the money. I confess Id not heard that one. What other jargon is arising from employment in the time of Covid? Blursday is a word coined to evoke the idea that the days of the week have lost their significance in the new paradigm. Thats very 2020. And 2021 too, come to think of it. Give me another. Workers now talk about synchronous communication, when they just mean speaking to each other in real time. Not in my Zoom meetings they dont. What else? Are you familiar with the acronym RTO? It rings a bell. It stands for return to office, and relates to timings and strategies for the gradual reintegration of a remote workforce into fully synchronous, in-person employment. Im starting to think we might not need that one. You may be right. Email me asynchronously about it. Do say: The account manager Zoom-bombed our hybrid team meeting today, which was unprecedented. Dont say: Sorry, I need to take this - its my other boss.","SOURCE":"The Guardian"},{"ID":"lifeandstyle\/2023\/jan\/14\/one-eared-rescue-dog-paintings-van-gogh","URL":"https:\/\/www.theguardian.com\/lifeandstyle\/2023\/jan\/14\/one-eared-rescue-dog-paintings-van-gogh","DATE":"2023-01-14","PLAIN_TEXT":"When a Connecticut animal shelter struggled to find a home for Van Gogh the one-eared rescue dog, they knew just what to do: break out the canvas and paint. The seven-year-old, 70lb boxer mix saved from a dog-fighting ring has now been adopted following a highly successful online auction of his masterpieces, created by Van Gogh licking peanut butter and liverwurst from a plastic bag and smearing the paint on the canvas below. Related: Dogged determination: the pets who forget their disabilities - in pictures The Happily Furever After rescue center of Bethel, having crafted an artistic new way of attracting publicity, is planning another exhibition next month to try to find homes for its remaining gallery of animals. Its a beautiful thing because [people] are not only supporting the rescue, but they are supporting the dog, Jaclyn Gartner, founder of the organization and art show curator, told Fox News digital. For him, [painting] is enrichment and a treat. He enjoys doing it. Gartner said there was little interest in Van Gogh after he arrived last summer from a shelter in North Carolina. A suspected bait dog for a fighting ring, he was found abandoned, injured and bleeding in a drainage pipe, leading to the amputation of his left ear. His first in-person art show at the shelter was poorly attended, leading Gartner to place his paintings for sale online. Assisted by a viral TikTok video that attracted 300,000 views, Van Goghs artwork sold out immediately, and he even picked up some private commissions. After seven months with a foster family, Van Gogh also earned an adoption application from his new owner, Jessica Starowitz, who had promised to allow him to continue painting his post-impressionist pieces. Like his 19th-century Dutch namesake, one of the worlds most famous artists who created about 900 oil paintings in his lifetime, including Sunflowers and The Starry Night, the canine Van Gogh is prolific, Gartner said. He has recently completed his 140th work. Starowitz told Fox that Van Gogh had experienced a lot of trauma, and was currently working on his manners and learning to be more comfortable around other dogs. Gartner also said that unlike the real Van Gogh, whose recognition came only after his death in 1890, the dog gets to enjoy the fruits of his labors. He is properly compensated for his work in toys and treats, she said in the video.","SOURCE":"The Guardian"},{"ID":"t3_nio8ny","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/nio8ny\/how_do_you_deal_with_coworkers_like_this\/","DATE":"2021-05-22","PLAIN_TEXT":"How do you compete with coworkers who eat, breathe and live programming and have nothing else going on in their lives?Ill give an example that happened to me: The manager assigned a new project to be worked on by me and one other dev, Ill call him Ben. The idea was the whole project would take a few weeks to complete, and me and Ben would split the work evenly. At the beginning, me and Ben had a meeting and divided the project into small subtasks, and agreed to each do half the tasks. But Ben worked over time every day and the weekend too (I saw him committing code to the repository late at night on Saturday), and finished his half of the tasks very quickly. Then he started giving me unsolicited tips on how to do my tasks (of course ccing the manager), and then he outright just started doing my tasks for me. The entire project got finished in a week, and Ben did 90% of the work. Ben is not smarter or more efficient than me, hes just willing to work unlimited over time. Of course Ben made sure the manager was aware he did most of the work and now the manager is very impressed with Ben. I have no problem with people getting credit for working hard, but I do have a problem with being made to look mediocre compared to someone just because I have a work-life balance and they dont. Note that I am in no way a slacker, I dont goof off during work, Im not slow or anything, I put in a solid 8 hours every Monday to Friday. Im just unwilling to work any more than that. I have worked on several different teams during my career and it looks like theres a Ben on every team. How do you deal with such people? Advice from managers would be especially helpful.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"business\/2022\/jun\/03\/retail-figures-uk-shoppers-stay-home-footfall-below-pre-covid-levels","URL":"https:\/\/www.theguardian.com\/business\/2022\/jun\/03\/retail-figures-uk-shoppers-stay-home-footfall-below-pre-covid-levels","DATE":"2022-06-02","PLAIN_TEXT":"Retailers are warning of fragile confidence among shoppers after figures revealed visitor numbers to UK high streets, shopping centres and retail parks last month remained 12.5% down on pre-pandemic levels. The shift to working from home and concerns about the cost of living continue to hold back trade, with visits to shopping centres down by more than a quarter on 2019 while high streets had 14% fewer visitors. Scotland, Wales, north-east England and London fared far worse than the east Midlands and north-west England, according to the latest British Retail Consortium (BRC) footfall monitor conducted in partnership with shopper monitoring operator Sensormatic Solutions. The declines marked a slight improvement on Aprils numbers, with high streets seeing a particularly strong recovery. Visitor numbers were also strongly up on last year - by an average 19% across all types of destination - as warm sunny weather and the prospect of the forthcoming jubilee celebrations helped to boost sales. Helen Dickinson, the chief executive of the BRC, which represents most big retailers in the UK, said: UK footfall made small advances for a third month in a row, as the particularly warm May weather saw more people shop in person. The anticipation for the jubilee celebrations offered an added boost to footfall, with the public hitting the shops to find the best decorations and festive food and drink for the long weekend. Sign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk She added: Improvement to footfall remains fragile as the cost of living bites. With UK discretionary incomes falling, governments financial support to tackle surging energy costs may only provide temporary respite for households. As inflation continues to climb and consumer confidence falls, it is by no means certain footfall will continue to improve in the months to come. Andy Sumpter, at Sensormatic Solutions, said that UK high streets were recovering more strongly than other G7 countries with footfall in Germany and Italy both down by about 20% in May and France by nearly 22%. However, Sumpter cautioned: With households already starting to feel the pinch of the rising cost-of-living and growing inflationary pressures, retailers will be hoping that cracks dont start to appear in the footfall recovery. As they look ahead to June, retailers will be hoping that high streets will be rallied by the jubilee weekend celebrations and that the event will prompt ambient shopper traffic and retail spend.","SOURCE":"The Guardian"},{"ID":"money\/2022\/sep\/27\/25000-wreck-25m-home-indoor-pool-three-house-sales-modern-britain","URL":"https:\/\/www.theguardian.com\/money\/2022\/sep\/27\/25000-wreck-25m-home-indoor-pool-three-house-sales-modern-britain","DATE":"2022-09-27","PLAIN_TEXT":"Statistics tend to define the way we think about property. As a nation, we buy and sell more than 100,000 homes a month - more than 3,000 a day. House prices went up 7.8% in the year to June 2022, taking the average property value in the UK to PS286,397. The average deposit for first-time buyers is now about PS75,000. People aged over 65, who represent less than a quarter of the population, own almost half of Englands housing equity. But behind the numbers, each property transaction is a story with a cast of generally anxious characters. I set out to find properties worth PS25,000, PS250,000 and PS25m - and speak to everyone involved in each sale and purchase. Taken together, the stories of three very different houses offer a snapshot of an industry that shapes all our lives and communities. PS25,000 - Easington Colliery, County Durham When I tell my friends the prices of the properties Im selling, they cant believe places like this exist The house at the bottom of a street in Easington Colliery is in a sorry state. The windows have been boarded up, the front door padlocked shut. A rusting skip waits to be collected on the pavement. Inside, broken glass covers the carpets. Even the bannisters have been ripped out. Requires modernisation, the online listing had said. A couple of weeks before my visit in August, I watch six people bid for the three-bedroom house in an online auction. Russell Taylor, the managing director of Taylor James Auctions in Birmingham, says it is unlikely that any of them has even been to Easington Colliery, a coastal former mining town between Sunderland and Hartlepool. After 22 bids made over a few hours, the house sells for PS27,000 - slightly higher than the PS25,000 Taylor had predicted. She was overjoyed, he says of the buyer, a beauty salon owner from the Midlands (who prefers not to talk to me). The auctioneer says he sells more than 100 homes a year at about PS25,000, the majority of them in County Durham, which was once the countrys leading producer of coal. He works in a rarely scrutinised sector of the market, where homes can cost less than cars, and rental yields can seem hard to resist. When I tell my friends some of the values of the properties Im selling, they cant believe places like this exist, Taylor says. The boarded-up end-terrace house. Photograph: Christopher ThomondThe Guardian The street is one of Easington Collierys A streets (their names all starting with the letter A) of terrace miners cottages. They were laid out in rows off Seaside Lane, a high street that was extended east of the old village of Easington after the pit was sunk in 1899. There are clusters of B and C streets, too, each built around the site of the former colliery. Christine Wood lives a few doors up from the empty house. Her home of more than 40 years is immaculate. A painting of a pride of lions hangs above the mantelpiece, which supports porcelain figurines of siamese cats. Wood, who is 76, keeps her late husbands miners lamp on a dresser. She grew up in Easington, where her father was also a miner. It was lovely here back then, she says. All the miners were working and everybody cared about each other. Everyone looked after the houses and everything was clean. She cant remember if their rent was PS2 a week or a month. As many as 2,500 miners worked here for decades. There were two schools, a cinema and a brass brand. Easington was such an archetypal north-eastern colliery that the A streets served as the location for the 2000 film Billy Elliot. Yet the backdrop for the film - the 1984-85 miners strike - was the beginning of the end for the pit, starting a spiral of neglect that is still playing out on the street. The colliery gates shut in 1993. Today, a miners cage lift stands as a monument on cliffs overlooking the North Sea. Mining families were offered the chance to buy their homes for PS3,000. The Woods stayed put. But anybody who could get out did get out, says David Boyes, a driving instructor and Labour councillor for Easington Colliery. And that left the houses prey to unscrupulous landlords. Boyes, who is 59 and the grandson of a miner, says several terraces have been demolished, including the streets that appeared in Billy Elliot. Other houses were sold off in lots. Taylor says landlords are now a mix of businesspeople with several properties and sometimes naive opportunists. None of them, including a Nigerian oil executive living in the US, are keen to talk. Weve got landlords living in Dubai, in Ireland - all over, Boyes adds. Its all a bit mercenary. Graham (not his real name), an IT consultant from Surrey, bought the empty house more than 15 years ago as part of a batch of houses across the north-east. It was the worst decision I ever made, he says. The birth of the buy-to-let mortgage in 1996 had triggered a boom, as amateurs took advantage of cheap borrowing, high rental yields and soaring property prices. Many saw property as a smarter bet than a pension. If you had a reasonable income, you were able to borrow quite a lot with not very much scrutiny, Graham recalls. New landlords flocked to former mining towns. Auctions, which are standard at this level of the market, make it easy, Taylor says. The highest bidder exchanges contracts on the day, and generally youll have completed within 20 working days, he says. Spend another couple of thousand on a cheap refurbishment and find a lettings agent and you could very quickly be renting out a house for PS350 a month. But the symptoms of social deprivation are plain to see. Unemployment and crime levels are high. Wood, who has lived alone since her husband died in 2015, had to call the police after rocks were thrown at her windows. A man who answers the door next to the empty house describes the area as being like Beirut. He adds: There are three problems in this area - no work, nothing going on, and drugs. Boyes says the town now has about 70 heroin users registered for treatment. He says many tenants flit between houses, moving on as rent demands and utility bills start to pile up. We know for a fact that somebodys had a leaflet in Durham prison saying if you need a house, come to Easington because its so cheap, he says. Screengrab of a YouTube video showing the interior of the Easington Colliery house. Photograph: YouTube A cycle of vandalism and vanishing tenants meant Graham collected rent for about five months in the 15 years he owned the house. About five years ago I just decided not to spend any more money on it, he says. He sold the house at a loss, having spent thousands on refurbishments and repairs. Graham, who has made money on his other properties, is keen to defend landlords. I always took the approach that if you provide good homes for people, then its a public service, he says. There are a lot of shitty landlords out there, and Ive never wanted to be that. Boyes is bracing for winter as the cost of living crisis deepens. Demand at the local food bank has gone up by 350% so far this year, he says. Were going to protect people the best way we can. The council has invested in more CCTV cameras and this year introduced a selective licensing scheme, which legally requires landlords to maintain standards of homes and tenants. A community spirit still binds Easington Colliery. Last year, hundreds of villagers marched down Seaside Lane in memory of 83 men who died in a pit explosion in 1951. Most are buried in Easington Colliery cemetery, which sits next to what used to be known as the Withering Hope allotments. Mining heritage is embedded in this community and were determined not to lose it, Boyes says. On the street, Christine Wood is waiting to see who will move into the house on the corner. She sees little evidence of the old spirit as she goes to bed alone, fearing the crime on her doorstep. She has endured extraordinary loss: her mother and brother died in a motorbike crash when she was 12. Her son died by suicide when he was 29. She has lost her husband - and her community. She would move but her own house isnt worth much more than PS25,000, which wouldnt buy her a place anywhere else, or even pay rent for long. She says her faith is all she has left. I do still believe God is going to step in and put the Earth right, she says. In her lifetime? I hope so. PS250,000 - Didcot, Oxfordshire I looked at this plain red-brick house with a tiny garden and thought: how can this be worth a quarter of a million pounds? When Penny Cooke stepped on to the property ladder in her 20s, she remembers it being pretty easy. She had been leafing through the local paper when she spotted some flats being built in Didcot, the Oxfordshire town where she was born and lived. It was around 1980, and she bought her flat for about PS30,000. Average UK property prices were then about PS20,000. Average wages amounted to about PS4,000 a year. So the average worker could buy the average house for about five times their salary. I also bought the flat on a 110% mortgage, so all my moving fees were covered and I didnt even need a deposit, says Cooke. Her first job was at a milk bottling plant in Didcot, which was named a few years ago as, statistically speaking, the most average town in England. Cooke, who is now 63, continued up the housing ladder. In 2002, she bought a modest red-brick semi on a cul-de-sac in Didcot that is part of a sprawling estate built on farmland during the 70s. Many of its roads have aspirational names on a royal theme: Buckingham Close; Sandringham Road; Jubilee Way. Cooke loved the small two-bedroom house, where she lived alone, latterly with her greyhound, Honour. She added a small conservatory. But the pandemic, among other things, shifted her priorities. It was time to leave Didcot for a different pace of life on the Hebridean island of Mull. Warren Copping, a local estate agent at Hodsons, came to value the house last year. Cooke, who now works as a remote personal assistant, was stunned to learn it had doubled in price in less than 20 years. I looked at this plain red-brick house with a tiny garden in Didcot and thought: How can this be worth a quarter of a million pounds? she tells me from her new home. Yet, at the time, PS250,000 was the average house price in the UK (it has since risen to above PS280,000). Average wages, meanwhile, are now a little above PS30,000. So the average worker must now pay almost 10 times their salary for the average house. Id hate to be trying to get on the property ladder today, says Cooke. Michael Harkness and Carla Martinez with Amaya, at their new house in Didcot. Photograph: Sam FrostThe Guardian The house also seemed expensive to Michael Harkness and Carla Martinez, who are both 29. But after sinking more money in rent than they would care to calculate since they met in 2013, the couple were desperate to buy. At one point they had been paying PS1,050 a month for a one-bed flat in Brentwood, Essex - and then not much less for a room in a shared house on the edge of Reading. It just felt a bit pointless, Martinez says Harkness, who is a civil engineer, was working night shifts on the motorways to try to save up. Martinez, who grew up in a modest flat in Barcelona, was doing agency shifts on top of her full-time job as an NHS care assistant. The stakes then got even higher; after getting married last year, the couple had a baby, Amaya, in June. Almost half of first-time buyers rely on the bank of Mum and Dad, according to recent analysis by the estate agent Savills. We have this absurd situation where parents are lending money to kids who cant afford the prices the parents mates are charging for their homes, says Henry Pryor, a veteran estate agent and property expert. Beyond funds for a new fridge, neither Harkness nor Martinez had access to family money. A mortgage adviser set their maximum price at PS275,000, just under the PS282,000 average for first-time buyers in 2021, according to analysis by Barclays. They applied for a government help-to-buy Isa (now discontinued), which would give them an extra PS3,000 towards a house worth up to PS250,000 - if they could save up to PS12,000 themselves. Harkness started online searches for two-bedroom homes with good transport links not far from his workplace in Wokingham, Berkshire. Cookes house ticked lots of boxes, with a spare room upstairs for Amaya and space in the conservatory for a desk. They quickly made an offer. The Isa helped with the deposit, which the couple managed to negotiate down to PS20,000 - almost a third of the UK average for first-time buyers. Their mortgage payments of PS840 a month are only a little higher than their previous rent. They also escaped some of the effects of soaring inflation on mortgage deals, which are now making life even tougher for first-time buyers. Had we waited even a couple of months, it would have been a real struggle, Harkness says. Martinez was gleeful when she got the keys. It felt like such a big thing to have our own place. While its harder than ever to get a foot on the ladder, Copping says demand in Didcot has actually risen among first-time buyers this year, partly due to a pandemic-related exodus from London. Buy-to-let landlords have also been less active in the town. Selling to young couples rather than landlords involves a lot more work, Copping says. But we get real satisfaction from it. Theyll forget us but we wont forget them. The couple made some modest improvements (it helps that Harkness is handy) and bought a cheap barbecue for the tiny garden. Sitting in their small living room in late July, five-week-old Amaya asleep on Martinezs lap, they are aware that they are ahead of the game. Their friends are still mainly paying ratcheting rents for rooms in shared houses, with no obvious way out. Others are leaving the south-east to move to cheaper areas in Scotland and south Wales, aware that in some cases they will unlikely be able to afford to return. Its really hard, says Martinez. The couple are now trying to make friends in Didcot, where they are a 20-minute walk from the high street and train station. But they feel lucky, and are naturally positive. You have to go for what you can get and make lemonade out of lemons, Harkness says. PS25m - Belgravia, London If I were to say that refrigerated bathroom cabinets were becoming standard now, you might think Im a little crazy You wont find anything so vulgar as a for sale sign outside a grand house on a coveted square in Belgravia. But the owner of the property, a Scandinavian businesswoman who declined to talk but kindly let me look around, certainly wants to sell it. Just dont even think about offering her anything less than PS25m. Im greeted at the triple-locked front door by Simon Deen, the estate agent tasked with finding a buyer for the Grade II-listed 19th-century house. Six floors rise from the basement in a layer cake of gleaming stucco. Deen offers me a Mini Magnum from an enormous freezer a few days after the marketing launch. It had been a hot evening, and the ice-creams had felt like a nice touch. At this level of the London super-prime market of PS10m-plus properties, houses become brands, with their own social media accounts and expensively produced digital content. Or theyre quietly sold off-market - the sellers preference in about half of such sales, Deen says. Yours for PS25m - or more ... Photograph: Ryan PrinceThe Guardian Either way, Londons super-prime market is buoyant. Relaxing travel restrictions and a weak pound have helped it return towards its 2015 peak, about the time the then mayor Boris Johnson boasted at a real estate conference in Mayfair: London is to the billionaire as the jungles of Sumatra are to the orangutan. We are their natural habitat. There were 155 sales above PS10m in the capital in the year to April 2022 - the highest number for six years, the estate agent Knight Frank reported in July. Forty-six of these transactions were above PS20m. And after a slight cooling prompted by tougher planning, higher taxes, Brexit and the pandemic, foreign buyers are back in force, accounting for 80% of the latest sales (if not the Russians, although Deen says they have not been very active for years). The leafy squares and avenues of Belgravia, which border Kensington and Chelsea, are at the heart of super-prime London. This particular house has always been home to the very rich, including naval commanders and sons of baronets. Related: Super-prime mover: Britains most successful estate agent To the casual viewer not in possession of a spare PS25m (the asking price is actually PS27m at the time of writing), the 10-bedroom house looks to be in excellent condition. The marble floors and stone fireplaces are buffed, the chandeliers sparkle and the basement swimming pool shimmers under a giant mural featuring a Greek temple and cedar trees. But no major work has been completed here since the late 1990s, and Deen knows that any prospective buyer will want to bring it up to the standards of the 21st-century super-rich. He persuaded his client to wait for almost a year so that he could commission designs and get planning permission for a total refurbishment. The owner is abroad when I visit, and personal effects have largely been stripped away, bar a few family photos and a bedside copy of Melinda Gatess memoir, which Malala Yousafzai described as an urgent manifesto for an equal society. In each room, computer-generated images of the new scheme stand on easels. Therell be a new wine cellar and a hammam, and the existing gym and cinema will switch places. There will be air-conditioning throughout and eight suites as finely finished as those of a five-star hotel. Deen estimates the work would cost at least PS6m to complete. Graham Harris, the man behind the designs, is a founding partner at SHH Architecture and Interior Design, the go-to firm for the super-rich doer-upper. His other work has included a vast mansion on Belgrave Square that at one point had an asking price of PS125m (its basement swimming pool turns into a ballroom at the flick of a switch). He also masterminded the restoration of Athlone House, a neo-gothic pile on the edge of Hampstead Heath that, even in its former derelict state, cost the Russian billionaire Mikhail Fridman PS65m to buy in 2016. (Harris had finished the job long before Fridman was sanctioned after Russias invasion of Ukraine.) A computer-generated image of the proposed informal dining areaorangery. Photograph: Simon Deen Real Estate Harris, who is 59 and set up his firm in 1992, says his job is to stay ahead of the mores of his uber-prime clients. So if I were to say to you that refrigerated bathroom cabinets were becoming standard now, you might look at me and think Im a little crazy, he says. But if youve got your Creme de la Mer tubs of moisturising cream at PS150 a pop [for 30ml, or PS1,780 for the 500ml tub], where are you going to keep them? Harris has also recently completed several gin rooms, a 26-car basement garage and what he claims to be the largest private walk-in humidor in Europe. This house is small by his standards at 9,000 sq ft, which is more than 10 times the UK average, but less than a quarter of the size of his biggest projects. I always say to my clients that you can live very comfortably with 6,000 sq ft, Harris says. Beyond that, youre going to kind of lose yourself. Deen, who is 41 and remembers drawing floor plans of his own modest home while growing up in north London, is aware that he operates in a world with a tricky reputation. Until money laundering laws tightened in 2017, buyers could hide behind offshore companies registered in tax havens. Pockets of super-prime London became stuccoed vaults for wealth of not always impeccable origin, the homes themselves often being left empty. But today, Deen says: I know who buyers are, where they live and that the funds are legitimate ... Apart from anything else, my clients want to know who theyre selling to because no one wants an issue down the line. Harris, who grew up in Leeds, where his father was a developer of leisure centres, says he thinks long and hard before taking on a client. We still have a moral compass, he says. He is hoping that whoever buys the house will proceed with his designs. Deen says interest has been high. He has a lot riding on the sale; while he is tight-lipped about his cut, a typical 2% commission would leave him with PS500,000 or more. As we leave, and lock the door behind us before the next viewing, the estate agent rushes to wipe up a drip of ice-cream that has fallen on to an immaculate slab of marble flooring. * Do you have an opinion on the issues raised in this article? If you would like to submit a letter of up to 300 words to be considered for publication, email it to us at guardian.letters@theguardian.com","SOURCE":"The Guardian"},{"ID":"t3_s4rkbe","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/s4rkbe\/after_6_years_of_struggle_i_made_it_brosgals\/","DATE":"2022-01-15","PLAIN_TEXT":"2016 - Graduated with below 2.5 GPA. No job, just my johnson in my hand.2017 - Live at home NEET, crazy depression, anxiety, and suicidal thoughts. Burned an entire year watching anime, netflix, and movies. Also sleeping 12 to 16 hours a day. Waking up and smoking enough weed to put an elephant asleep because every waking moment was extremely painful.2018 - start of therapy and medication. Had to learn how to function as a human again. While also trying to cram leetcode and general cs theory2019 - Condition improve, but continued to try to learn too many things at once. Didnt help that I was living in abusive home enviorment. Managed to land a internship that paid $10 and hour for 3 month.2020 - Switched to an ad agency for $25hr. Covid happen and was laid off during the height of pandemic. Couldnt code at home because of abusive enviorment. Rented a co-working space when everyone was staying home. Was practically living there because I could not afford to move out. Stayed for 3 months, because I could not afford $250 a month open desk. Spent another 3 month working my malls outdoor food court 12 hours a day. 2021 - Got a better deal from co working space for $100 a month. Was practically living at the co working space again. A small win, but there was increase of random violence at home. Took remaining amount of money, and left the country. Was able to focus on building a product. Applied, and interviewed for a job November. Received and signed offer in December.2022 - I start working.What I learned1. Dont try to learning everything at once. Focus on one thing at a time.2. Be brave and leave a toxic home enviorment. You wont be able to actually digest material if you are in constant state of fight or flight.3. Watch out for coding anxiety. Dont code for the sake of coding. Think about what you want to achieve. Use bloom taxonomy to learn deeply.4. Take your time, and pace yourself accordingly.5. Believe in the process and believe in yourself. Took god damn 6 years because I was constantly in state of anxiety and flight mode. Took me 6 months to readjust to a healthy baseline. FML but I made it and so can you. Dont give up. To the bitter end.Edit1. I was a non-cs major that majored in accounting. My 3rd year i have a 3.0 to 3.2 gpa. Always loved tech but coming from an extremely poor family i was never introduced or had guidance to coding until college. I do recall learning how to make a website with dreamweaver as a freshie. But I loved tech since i was a kid.I believe coding is just the modern day carpenter and anyone can do it.Edit2. I did not get FANNG nor was asked an algro question. Though doing tons of leetcode allowed me practice visually mapping algros and cleaned up my coding logic.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/44358ca8-adf8-5e1f-85f3-64fe14669686","URL":"https:\/\/www.nytimes.com\/2020\/07\/08\/us\/drisana-rios-lawsuit-hub-international.html","DATE":"2020-07-08","PLAIN_TEXT":"A California woman has sued her former employer, saying that she was fired because her young children were making noise during business calls while she was working from home because of the coronavirus pandemic.Drisana Rios of San Diego said in a lawsuit that she lost her job with an insurance brokerage firm after a supervisor complained that her children were being noisy during meetings.","SOURCE":"New York Times"},{"ID":"world\/2023\/jan\/10\/astonishing-pompeii-home-of-men-freed-from-slavery-reopens-to-public","URL":"https:\/\/www.theguardian.com\/world\/2023\/jan\/10\/astonishing-pompeii-home-of-men-freed-from-slavery-reopens-to-public","DATE":"2023-01-10","PLAIN_TEXT":"An ornate house - containing a fresco featuring a huge phallus - that was owned by two freed men freed from slavery in the ancient city of Pompeii has reopened to the public. The House of the Vettii was buried by the eruption of Mount Vesuvius in AD79 before being rediscovered in a largely preserved state during excavations in the late 19th century. The home, believed to have been constructed in the second century BC, has reopened after years of complex restoration work. Erotic frescos feature in the house, which is believed to have incorporated a small brothel. Photograph: Silvia VaccaAtrio Vettii Located in the ancient citys wealthy quarter, the sprawling House of the Vettii was owned by Aulus Vettius Restitutus and Aulus Vettius Conviva, who became rich by selling wine after being freed from slavery. Theories in the past have suggested that the two men were brothers, but it is more likely that they met when enslaved and had the same master, whose name was Aulus Vettius, according to Gabriel Zuchtriegel, the director of Pompeii archaeological park. If they were from the same family the first two names would have been different and they would have the same surname, he said. It was uncommon to have biological siblings who were slaves and then set free, because family ties were cut with slavery so its very unlikely they were brothers. Its more likely that they were buddies during their time as slaves and then set free. Priapus, the god of fertility and abundance, with a scale and bag of money - symbolising the wealth accumulated by the houses owners. Photograph: Silvia VaccaAtrio Vettii Restitutus, meaning given back, was a typical name given to a freed slave, Zuchtriegel said. It was not unusual for people freed from slavery to thrive in ancient Pompeii, and the House of the Vettii was filled with elegant frescoes by the two wine traders, who also expanded the home to include a garden with statues and a fountain. Among the most striking frescoes is one at the entrance of the home: this depicts Priapus, the god of fertility and abundance, with a large penis balancing on a scale next to a bag filled with money, thought to have symbolised the wealth accumulated by the men. Inside the home is a 15cm-high frieze that runs along the wall of a room believed to have been a dining room, which features cupids engaged in activities such as making perfume or selling wine. It also depicts divine couples and gods including Poseidon, the Greek god of the sea. A small room close to the kitchen, which contains erotic frescoes, was believed to have been used as a brothel. Next to Priapus at the entrance is a small inscription in Latin which refers to a woman with a Greek name, who is described as having nice manners, alongside an image of two Roman coins. The inscription is believed to have referred to the homes small brothel. Aulus Vettius Restitutus also joined the high-ranking Augustales, a college of priests who were in charge of a form of emperor worship. A frieze showing cupids at work runs around the wall of one room. Photograph: Luigi SpinaCasa dei Vettii 26 Zuchtriegel said the abundance of treasures contained in the House of the Vettii is absolutely astonishing and if he was a visitor to Pompeii and had the opportunity to see just one home in the archaeological park, it would be this one. This is the house which tells the story of Roman society, he said. On the one hand you have the artwork, paintings and statues, and on the other you have the social story [of the freed slaves]. The house is one of the relatively few in Pompeii for which we have the names of the owners. * This article was amended on 10 January 2023. Vesuvius erupted in AD79, not AD74 as an earlier version stated.","SOURCE":"The Guardian"},{"ID":"t3_z0vyny","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/z0vyny\/my_junior_is_finally_starting_to_get_stuff_so\/","DATE":"2022-11-21","PLAIN_TEXT":"So about a 3 or 4 months ago we had a new hire and it became mine and the teams job to train her. Just to note Im in no way a senior developer, Im a junior myself, however I pretty much know the ins and outs of what I work on (Im a devops engineer), so this girl was straight out of collegeuniversity and she needed lots of hand holding. Time seniors did not have, so as being trained I was tasked with giving training. Now I had made some fantastic notes and a training plan and I was so excited. I thought that it would be a breeze, but I was wrong. She was struggling to understand things and didnt ask any questions, never made any documentation on anything I taught her. She would just watch the training and then forget and complain to her friend (who was also one of the people I was training) that she was learning too much, how can she keep up with the pace. Now dont get me wrong, Ive automated most of the processes. Theres hardly any manual things to do, I was simply trying to ensure she understood how weve set up our environments, cloud infrastructure, Jenkins etc. I realised this was going to be a very long and hard task and so I decided to set her some training activities make a very simple pipeline which uses the cat command and then emails the output to the user. She struggled so much with this one task I think it took her total 1 month to complete - and even that I had to go in and hold her hand and show her how to do it.Unfortunately at that point I was lost, I had no idea what to do. She was deleting important Jenkins jobs, she was destroying environments which were being used for testing (after she decided to use it and I asked her why are you using that environment? Who asked you to etc?) then when the team asked her why she simply blamed me, they obviously knew it was not me, and that I didnt tell her to.Even as Im typing this I gave her one ticket this sprint in which she simply has to ask another team to complete their task. Its small steps and she asked me how can she get in contact with that team, but at least shes taking initiative to start her ticket! This to me is progress and not even in a condescending way. Genuinely, the fact she is starting to take her own initiative makes me proud. Having to give micro level instructions is very tiring. Thursday evening I had a long talk with the girl and said look if you dont care about the work then ask to move teams. You arent making notes or documentation, and I have to give you micro level instructions for you to complete any task. Youre not understanding anything and you keep telling me youre doing stuff (such as learning Linux or git - no cap she literally claimed to be learning the cat and find command for 3 weeks and l asked her to use it and she said she didnt know it). We work remotely. So I asked her again what she does when she doesnt have any active tickets to do and she simply said she does nothing. I honestly didnt know how to react I was shocked, anyways it seems she pulled her socks up she sent me some documentation this morning about a few of the basic processes we have. Its not much but it is some progress.Anyways Im leaving the company in like a few days so at least I am done with that. But I have some advice for new joinersjuniors.Please record training sessions. This will help you review and understand in the future. You need to want to learn, be proactive, read the emails that come to your team debug them in your own time, understand what solutions your team have given. Make draft solutions to automation tasks and ask your seniors what they wouldve done differently. How could you improve it etc. talk during scrum calls highlight what youre struggling with, what youre doing.Overall just have fun, otherwise youll just resent the work youre doing.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"society\/2023\/mar\/12\/in-englands-worsening-housing-crisis-millions-are-unable-to-afford-their-own-homes","URL":"https:\/\/www.theguardian.com\/society\/2023\/mar\/12\/in-englands-worsening-housing-crisis-millions-are-unable-to-afford-their-own-homes","DATE":"2023-03-12","PLAIN_TEXT":"John Harriss article (House prices are crumbling - and so is Britains faith in property ownership, 5 March) provides a timely contrast with the letter from Peggy Seeger (2 March). John describes the pitiful number of council houses being built in England, and hence the worsening housing crisis, with millions unable to afford their own home. Peggy describes a proposal by Oxford city council to build 32 houses in Iffley village, Oxford, as ecocide and a crime. I know this housing proposal is unpopular with many locally: it is one reason I lost my Labour Oxford city seat in 2021, in the adjoining council ward to Iffley. The very same opponents would often say the housing crisis is Oxfords biggest problem. I appreciate the need for biodiversity, but the council proposes to translocate protected species in the proposed development. This is not ecocide. Surely people, particularly those who own their own homes outright, need to weigh in the balance the needs of those requiring housing? Satisfying Peggys argument that this development is an example of a growth agenda to which we have become addicted would mean stopping almost all housebuilding, and making it even more difficult to address the housing crisis.Richard TarverOxford * I found John Harriss article on the housing crisis to be a really strong analysis. As he said, the old Tory vision of the property-owning democracy may be shrinking. But, with Labour promoting itself as the party of home ownership, we are a long way from tackling the heart of the crisis. People need safe, secure, decent and affordable places to live. Home ownership is clearly one way to achieve this. But ever since the Tory vision led to the expectation that prices will always rise, houses have become investments rather than places to live. This is the crux of the current crisis. Until it changes, and a fall in prices may help, the equally viable and workable option of lifelong secure tenancies, which John described, is unlikely to get the political momentum it needs.Steve TownsleyBridgend * Have an opinion on anything youve read in the Guardian today? Please email us your letter and it will be considered for publication in our letters section.","SOURCE":"The Guardian"},{"ID":"commentisfree\/2022\/jun\/13\/civil-servants-go-home-paddington-revolt-rwanda-deportation","URL":"https:\/\/www.theguardian.com\/commentisfree\/2022\/jun\/13\/civil-servants-go-home-paddington-revolt-rwanda-deportation","DATE":"2022-06-13","PLAIN_TEXT":"Like many civil servants, I joined because of the principles. We work here because we want to serve the public, to make vital services work well, and to help people. I work with dedicated, skilled and compassionate people. We understand that we arent the politicians; we just want to get on and make things work for the public. But at the Home Office, it is unavoidably clear that the things we are now ordered to put into place - from borders to policing to immigration enforcement - are doing real harm to many people. As the report on the historical roots of the Windrush scandal showed, the Home Office has a long and ugly history of structural racism, with UK immigration policy shaped for decades to try to minimise the number of black and minority ethnic people in this country. Related: Appeal court rejects last-ditch legal bid to block flight taking asylum seekers to Rwanda - live So it is little surprise that the barbaric Rwanda transportation plan - to forcibly fly people who have escaped trauma and horror to another continent - is presented to us by senior fellow civil servants as humanitarian. The laughably absurd idea that it has anything to do with preventing people smugglers is repeated with a straight face. If the racial priorities in our work werent clear enough from the Windrush scandal, Russias invasion of Ukraine has rammed the point home. Of course, innocent people bombed out of their homes must be offered help and a place to rebuild their lives if they choose to. Yet this is hardly the only war going on. The difference in response when there are white faces involved couldnt be more stark. Whole new visa routes were created with vastly more generous conditions, such as not being banned from working or accessing vital public funds. A fake deportation notice thats part of a protest from civil servants against the Home Offices Rwanda policy. Photograph: Twitter Ukraine, like Covid, has shown some glimpses of how the government can rouse itself to care for people and support lives - but only sometimes. Why has this kind of response never happened for the people in desperate situations in Yemen, Ethiopia, Sudan, Palestine, Afghanistan? Let alone the climate crisis. Time and again we have seen official leadership so unable to demonstrate basic humanity that those of us in the regular ranks look at each other and shake our heads. Can this really be happening? Is this who we are? So, we say: enough. Were tired of accepting that things have to be this grim. Tired of quietly going along with every new step we are told to take into an ever more controlling, more divided world. Were sold a beautiful dream of an organisation that has learned from Windrush - One Home Office is the name of the departments transformation programme. But if we really are to become One Home Office, we need to play our part. Related: Paddington, go home: Home Office staff pin up faked deportation notices Welcome to Our Home Office, a growing network of civil servants employed by the Home Office who take our principles seriously. Such as impartiality and fairness and respecting the rule of law for everyone, and upholding the rights that every person has. And we are finding ways to put these into practice ourselves. In what we do, and what we resist. In speaking out. In listening in, to voices often disbelieved or ignored. In finding whatever cracks we can in the stifling, inhuman, bureaucratic walls, prising them open to make space to build something better. We speak to colleagues and share our support, we act however openly or subtly we feel we can - from posters reminding colleagues of our true values, to the Refugees Welcome stickers we are placing in our buildings. We are trying to find a way to live by and act on our principles. Maybe, somehow, this hostile environment that entangles all of us can be disarmed, unwound. And we invite our fellow civil servants: which strands will you help untie?","SOURCE":"The Guardian"},{"ID":"nyt:\/\/article\/7a6b071c-96a9-53c9-865f-b1e49dd20e82","URL":"https:\/\/www.nytimes.com\/2022\/05\/16\/business\/worker-happiness-management.html","DATE":"2022-05-16","PLAIN_TEXT":"Garry Ridge, who runs the chemical company WD-40, has a leadership style guided by two sources -- Aristotle, and the BlackRock chief executive Larry Fink.To some, the pursuit of workplace happiness -- and its price, like an $18,000 happiness M.B.A. for managers -- can seem like a corporate attempt to turn feelings into productivity.","SOURCE":"New York Times"},{"ID":"t3_vxz9ew","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/vxz9ew\/how_not_to_get_distracted_during_the_micro\/","DATE":"2022-07-13","PLAIN_TEXT":"For larger chunk of down time, e.g. 5-10 minutes while the test suite runs, its easy to take a break or answer emails.But what about micro downtime, e.g. 10-20 second waiting for a script to lint and start remote jobs? For me, it usually goes like this:1. Kick off scripts2. Get bored after 10-20 secs. Check reddit  hacker news for minutes3. Come back to find out the script fails4. Take more time to debug the script than necessary due to lost focus5. Back to (1)So even though the downtime is only for 10-20 secs, I end up wasting minutes during each cycle. Over a work day, I can easily lose 1-2 hours this way.How do you deal with this problem? EDIT: I too value breaks, I just want to take longer, meaningful breaks to nap, talk to my kids, read a book, etc. instead of getting lulled by seconds of waiting into internet doomscrolling.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"world\/2022\/apr\/13\/italys-superbonus-110-scheme-prompts-surge-of-green-home-renovations","URL":"https:\/\/www.theguardian.com\/world\/2022\/apr\/13\/italys-superbonus-110-scheme-prompts-surge-of-green-home-renovations","DATE":"2022-04-13","PLAIN_TEXT":"For years, people living in Castelnuovo di Porto, a medieval village close to Rome, had put off doing maintenance jobs on their homes, whether it be fixing the roof or cracks in walls caused by earthquakes, because they could not afford it. So when the Italian government said it would foot the entire bill for a range of renovation works, on the sole proviso of rendering buildings energy efficient and earthquake-proof, they could not believe their luck. When I first heard about the government getting all this money from the EU, I didnt think it would affect me in the slightest, said Chris Warde-Jones, a British photographer born in Italy. But when people in the village started talking about doing up houses - and there are a lot that need doing up here, quite a few are showing their age - our ears pricked up and we thought: hold on, can we do this too? Thousands of Italian and foreign homeowners have flocked to access Italys generous superbonus 110% scheme, which has so far cost the government about EUR21bn (PS17.5bn) since launching in July 2020 as part of the countrys post-pandemic recovery strategy. As the name suggests, homeowners are entitled to a tax credit of up to 110% on the cost of upgrading their home, such as installing insulation systems, heat pumps and solar panels or replacing an old boiler, or undertaking works that reduce the risk of damage from seismic activity. People can claim the subsidy by subtracting the costs of the works from their tax returns over a five-year period, or pass the onus on to the building contractor, who subtracts it from their taxes or sells the credit to a bank, which in turn is refunded by the government. The extra 10% covers bank interest. The scheme applies to works on either single houses or buildings that contain more than one home, although in these cases the permission of the other homeowners is needed. Warde-Jones has come together with four shared homeowners to do several jobs on their 18th-century tufa stone house totalling more than EUR200,000, including replacing the roof. Its been a bit of a nightmare from the point of view of organising four different families, but were getting there, said Warde-Jones. Work has not yet started, but the bureaucratic side of things is well on its way. Several other EU countries have subsidy schemes for home improvements as they work towards carbon emission reduction goals, but none are as bountiful as Italys. Some say the subsidies, the vast majority of the money coming from the EUs post-Covid recovery fund, are too generous, describing the move as a shock tactic to get the system going in a country with a huge stock of old or poorly constructed buildings. It certainly achieved that. As of 1 March, more than 122,000 applications had been approved. The EU said we need to become a zero-emission society by 2050, and to do that, the entire property stock, private or public, needs to be restructured, said Riccardo Fraccaro, the deputy and senior member of the Five Star Movement who first proposed the superbonus. This was a way to incentivise people and companies to do it. Fraccaro points to the schemes success so far, such as an immediate boost for the construction sector, GDP and the creation of more than 150,000 new jobs. However, soaring demand also pushed up the cost of building services, although Fraccaro said the government had now put price caps on raw materials, and left the limited supply of contractors capable of doing the works booked up to the hilt for at least a year. And even though the initiative impedes illegal activity as the credit can only be claimed via tax returns, Italys tax agency found EUR950m worth of fraud connected to the superbonus and other home improvements schemes late last year. As with everything, there are always those who try to be crafty, but the fraud within the superbonus was minimal, things like people creating fake building sites, said Fraccaro. We are making the system more rigid, although it is very difficult to defraud the superbonus as so many requirements and technical checks are needed before the subsidy is approved. Another issue is the time constraint - the initiative will be gradually reduced in size before ending in 2025. However, the main question is whether the superbonus is having the desired effects. Michele Governatori, from the climate and energy thinktank Ecco, said the scheme was commendable and most definitely needed, especially with buildings in Italy consuming an enormous amount of energy. It will definitely lead to improvements, although how much is too early to say, he said. His main criticism is that the subsidy allows for new gas boilers, ultimately continuing use of fossil fuels. If you replace your old boiler, adding certain efficiency parameters, with a gas one, you can also get a tax rebate. But this is a mistake that needs to be rectified immediately, we need to be using electric heat pumps and detaching from gas. Fraccaro said many households had already detached from gas and in the long-run the initiative would significantly reduce dependence on the fuel, especially in light of Russias invasion of Ukraine. Italy is heavily reliant on gas imports from Russia and, like other European countries, is now scrambling for alternatives. In Castelnuovo di Porto, Sergio Iaquinta, a co-founder of Aiku Srl, an alliance of architects, is busy working on 13 superbonus renovation projects, including the home of Warde-Jones and his neighbours. Iaquinta is also benefiting from the scheme on his own property. He said it was chaotically executed, more so at the beginning, but believes the chaos will be worth it. We have already seen results of insulation works, with clients calling us to say they noticed the difference straight away, he said. And it is helping raise awareness about the climate crisis and environmental needs, which is one of the most important things. This article was amended on 13 April 2022 to make clear that the superbonus scheme operates as a tax credit, rather than a deduction. ","SOURCE":"The Guardian"},{"ID":"t3_11bml32","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/11bml32\/are_all_the_bigger_companiesover_1bil_market_cap\/","DATE":"2023-02-25","PLAIN_TEXT":"I started working for a public company 8 months ago, not super big or anything but between 1-2billion market cap. Before this, I worked mostly for small startups... like a max of 25 employees so lots of pre-series A. I personally have 11 yoe.I initially sought out work for a biggerpublic company because I thought I could get paid a lot more than all the small companies I had been working at... I was right, my TC jumped 2.5x(more like 1.75x now due to the stock taking a hit).The company has a legacy rails monolith that around 70% of its business logic runs through. Working in this thing sucks, not just because its rails. The dev environment is always a pain in the ass to set up... Im not exaggerating, whenever I want to run it locally there is about a 50% chance I need to fix something that broke it, other devs agree with me. This means a 15 min bug fix I want to test quickly can turn into a 4 hour ordeal which happened to me last week.Everyone knows this at the company, the plan is to break this monolith up into smaller go services; however, Ive been told this has been the plan for the last 3 years. There isnt enough push to get it done faster which I understand... you cant just hold back on ALL features until the refactor is done otherwise the company will go bust... but when Im asked to build something in the monolith because otherwise we would need to wait for another team to refactor that portion of the monolith it feels like were going in the wrong direction. Im typically told that its much more complicated than I think and our team definitely doesnt want to take on the refactoring of X.Anyways... my question is really about if this is normal. This is my first big company so I can only assume this is a symptom of being on a bigger ship that is harder to turn. I dont want to go back into the job market just to discover that the next big company I work for is exactly the same. I feel like that spark of joy I used to get from building a feature is gone because I cant build very impressive things anymore due to how hamstrung I am by our environment... I cant be creative in my work anymore.Is this normal for bigger companies? If so, how do you cope with it?tl;dr: My companys legacy codebasedev env is awful, Im forced to do work in it and I hate it. Do you guys also have the same issue at your large company?","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"world\/2021\/nov\/20\/flexible-working-a-system-set-up-for-women-to-fail","URL":"https:\/\/www.theguardian.com\/world\/2021\/nov\/20\/flexible-working-a-system-set-up-for-women-to-fail","DATE":"2021-11-20","PLAIN_TEXT":"Employees want it, employers know they have to offer it; flexible working has transformed almost every office during the pandemic and its here to stay. It is a change that has been demanded for decades by groups including women, those with caring responsibilities and disabled people. But economists and employment experts are warning it could lead to more inequality at the office, particularly for working mothers. The latest to voice concerns was the Bank of England policymaker Catherine Mann, who warned of a she-cession, and said women who accept their employers offer of working mostly from home risk damaging their careers, as they arent returning to the office after Covid to the same extent as men. Related: Women working from home risk being caught in a she-cession Mann told an event for women in finance hosted by the newspaper Financial News that technology and virtual working methods couldnt replace spontaneous office conversations that are also vital for career progression. There is the potential for two tracks, she said. Theres the people who are on the virtual track and people who are on the physical track. And I do worry that we will see those two tracks develop, and we will pretty much know whos going to be on which track, unfortunately. Related: Switch to more home working after Covid will make gender inequality worse Traditionally, more women than men - particularly those with children or caring responsibilities - have requested flexible working. Women were found to have taken on more responsibility for household chores during the pandemic, and surveys suggest they also bore the brunt of home schooling. The switch to working from home has, more than 18 months on from the start of the first lockdown, changed a traditional office-based culture for good, even prompting the government to consult on making home working the default option. For some, however, the more flexible approach has resulted in setbacks. Jennifer*, a mother-of-two from Kent, recently returned to her role as a user experience researcher after her second maternity leave. During the pandemic her employer decided to close its London offices, and now rents space in a co-working building. The 38-year-old has opted to work three long days each week and is continuing to work from home, but she worries about missing out. What I have seen is the people who can go, will, and are, doing the networking and having the coffees and the informal chat, and meeting the new CEO. I am very conscious it doesnt feel like something I can easily do, as I need to go and pick up the kids, Jennifer said. Her experience differs vastly from her husbands, who was one of a rare group of remote workers pre-Covid. His company has now shifted to permanent remote working for all employees, which she believes has put him on an equal footing with the rest of the workforce. Hes not a second-class citizen. I also dont get the feeling hes looked down on for being a parent, she said. Anna Whitehouse, a broadcaster and the founder of Flex Appeal, a campaign for the adoption of flexible working across all UK jobs, believes women are disadvantaged because they usually take responsibility for looking after children. I got so frustrated with Catherine Manns comments, that its a female issue, for us to fix, she said. Were obviously going to be taking up more flexible working because of the way the system is, the burden of childcare is still firmly strapped to female shoulders. But thats not to say that there are these hapless dads who dont want to step up to the challenge. Whitehouse, who runs the popular Mother Pukka blog, is calling for families to discuss how they divide up household chores and childcare, and for more men to push for flexible working. We are in a system set up for women to fail, to an extent, and I think we need companies to help us bridge that gender pay gap. Indeed, some campaigners advocate increased uptake of flexible working by men as one way of improving pay disparity, especially given data from the Office for National Statistics which suggests that the gender pay gap widened during the pandemic. Last Thursday marked Equal Pay Day - the date when women effectively begin working for free each year, because on average they are paid less than men - as calculated annually by the Fawcett Society. Flexible working is here to stay, said Andrew Bazeley, the policy and public affairs manager at the society. There are a number of people who will prioritise it in job applications, so in a tight labour market employers will realise they have to offer it, especially if they dont want to widen the gender pay gap. The challenge for managers is that many have not been trained on how to supervise remote workers, according to Ann Francke, the chief executive of the Chartered Management Institute (CMI). Nearly a third (29%) of managers said they felt promotion opportunities would decrease for remote workers, according to a recent CMI poll of 1,200 UK bosses, although 58% said they thought remote working would make no difference to staff prospects. The majority of organisations have not yet done anything to ensure that a home office is not an obstacle. According to the survey, 30% of managers admitted their organisation had not taken steps to ensure employees were not passed over, while 38% did not know. Only a third of (33%) companies had put procedures in place to ensure staff working remotely home workers had an equal shot at future promotions. Even though both men and women wish to work flexibly, of course more women than men will request it, and the implication is they are the ones who will suffer, said Francke. It is extremely important that organisations are not complacent. They need training on judging people and promotions by productivity not presenteeism. * Not her real name","SOURCE":"The Guardian"},{"ID":"t3_r0kblk","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/r0kblk\/im_going_backward_titlely\/","DATE":"2021-11-23","PLAIN_TEXT":"I downgraded my role from tech lead to senior. Less responsibility, more hands on work and salary bumped 50%. Im happier but others would perceive Im going backward instead of forward, my LinkedIn profile look weird though.Does anyone here going backward for the sake of a bigger paycheck? I think Im making more than my manager of my prev company.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_lm6w8t","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/lm6w8t\/my_interview_experience_as_an_experienced_dev\/","DATE":"2021-02-17","PLAIN_TEXT":"For the past few months Ive been going on interviews at various companies and Id like to share my experience as an experienced dev.EDIT: Sorry for the long and somewhat boring post. Scroll down to conclusions for tl;dr.# Background Based in Canada YOE: 13 (non-FAANG) Bachelor and Master in Computer Science Mostly backend engineer throughout my career and most recently infrastructure and cloud Have been coding since 13 but never great at LeetCode# Preparations About 150 LeetCode, mostly medium Grokking the system design interview (educative.io) System design interview by Alex Xu System performance by Brendan Gregg# Interviews## PinterestPinterest was my first interview I went on. The recruiter contacted me in October. I was very nervous before the phone screen, since its going to be my first LC-style interview, but it turned out fine. Just be sure to voice your thought process, write small functions and gradually fill in the details. The question was about intervals, which isnt too hard, but easy to mess up under pressure.Did well enough to go onsite. Standard 2 system design and 2 coding rounds, plus a manager behavioural round. The system design rounds were similar. Both related to designing a streaming system somewhat related to Pinterest. I think I did alright even though at times, I feel like they were looking for very specific keywords. The coding rounds went very smoothly to my surprise. One of them is slightly harder which involves implementing a trie. Having come across that in my preparations, I solved that with much time to spare. Then it came the manager round, which I felt is a disaster. The manager was very dis-interested when I was talking about the projects Ive been on, and in the end, asked whether I had machine learning experience, even though the JD didnt call for that.### OutcomeI didnt get a response for almost 6 weeks, until recently the same recruiter asked me if I want to try another role, to which I answered no.## LightStepLightStep is a startup in the observability space. Ive tried their product for a while, and am pretty happy with it. I was pleasantly surprised when their recruiter reached out to see if I was interested in a SWE role. There were no tech screens and I went on onsite with them towards the end of December.The onsite has 5 sessions: high-level architecture, past projects, whiteboard coding and behavioural.The format is a bit novel. No LC style coderpad questions. In the high-level design session, I was asked to design a LightStep feature, and talk about the data structures Id need to use to implement that feature while taking care of potential scalability concerns. Then theres the past project session, which I was asked to talk about a project in detail, the design decisions, trade offs, outcome and so on. For the coding round, I was a bit confused at first, as I was presented a Google doc, which I thought I need to only write pseudo-code, but half way through, they asked me to write real compilable code. I thought I wasted much time on the initial discussion, and made some mistakes in the refactoring which led to the code not being able to compile. I did figure that out after the interview was over, but I guess it was too late. The behavioural round was pretty basic - all about situations and STAR.### Outcome2 weeks later the recruiter told me they were not moving forward, which was kind of expected given that I didnt finish the coding round. I wish I hadnt spent that much time trying to convince the interviewer that you can use a stack to implement DFS without recursion.## InstacartThen came Instacart. The recruiter reached out to me about a role on the infrastructuretooling team. The coding problem in the phone screen was pretty interesting. Not particularly hard, but does involve some thinking. Not very LC-like, but does test your data structure and algorithm skills, particularly binary search.For the onsite, typical behavioural round, although I confess I didnt prepare for it very well. The system design was focused more on domain design, rather than architectural. The two coding rounds were again not very LC-like, but instead, having multiple stages. The first one was focused on parsing (FSM-style). In the end I solved all test cases, but it wasnt a very smooth ride. The second one was more difficult which involves string matching. I solved all but one test cases.### OutcomeA few weeks later the recruiter came back to me with an offer.## BrexI got the Brex recruiter contact around the same time as Instacart. Brex seems like a cool Fintech startup, and the position was very much up my alley - observability, cloud and Kubernetes. I went in with a lot of expectations. The phone screen was the most difficult among the ones Ive been on. Its related to graph traversal. I think my confidence was boosted having been through all these coding interviews and I did fairly well. The came the onsite. The behavioural round, again, I was ill-prepared for, but I didnt think I did too badly. Next was the system design round, which they asked me to design a transaction system. The interviewer was a little hostile in the beginning, but his attitude changed gradually as the interview went on. I was able to talk in detail the transactionalpayment systems and the key ideas behind many designs for resiliency and reliability. I think the interviewer was satisfied in the end. The next round was a Brex special - debugging round. They present you with a piece of code that had several bugs in it, and asked you to find them and make the tests pass. It was a bit nerve-wracking at first, but once I collected myself, this round was actually fairly easy. The bugs were quite easy to find and fix. I finished all of them with 15m to spare. Finally, the real coding round. This time it was a 2-part question which asked you to implement some kind of a linked ledger system. The problem looked difficult at first, but when parsing through the requirements, it was actually not that difficult (easier than the phone screen problem Id say). I finished this round again with 10+m to spare.### OutcomeI walked out of the interviews feeling pretty good despite the questionable behavioural round. At that time I already had the Instacart offer and I thought I was going to get an offer from Brex which I could use as leverage. I couldnt believe it when the recruiter told me they passed the next day. In terms of performance on the tech interviews, I felt it couldnt have been better. I asked the recruiter if theres any feedback he can share as to why I failed the interview, and he said hes going to get that answer for me. That was a month ago and I havent heard back from him ever since.## FacebookFacebook production engineering contacted me last November. I agreed to do a phone screen earlier this year. Production engineer, if you didnt know, is like Googles SRE - engineers with system and infrastructure knowledge. Its well-suited for my interest and experience, but I have never done any FAANG interviews before (not quite true, I failed at the Google SWE phone screen 2 years ago), so naturally I was very nervous. Production engineering has two phone screens: coding and Linux troubleshooting. The coding round was very practical - reading data from stdin, munging it and spit it out in a different format. I finished it with minutes to spare. Its not at all LC. The Linux troubleshooting round was very hard - you had to work collaboratively with the interviewer to figure out a performance issue. You have to be very familiar with the tools available (e.g., top, iostat, vmstat, netstat, etc) and what various metrics mean. The second part of that interview was about Linux memory management. I thought I failed that interview, as I wasnt able to identify Linux memory overcommit model. I was surprised when the recruiter told me that I was moved to onsite and both interviewer gave me good feedback!Around the same time, another recruiter from Facebook reached out to see if I want to do an interview for SWE - infrastructure. I already had the Instacart offer and thought I didnt have enough time for that, but they were able to skip the phone screen and fast forward me to onsite the next week.### SWE onsiteI dont know how Facebook arrange their interviewers, but every single interviewer on my SWE panel was Asian! Was it because Im Asian too? shrug. Anyway, the behavioural round was very different from what I thought it was going to be. More project focused, but not much about STAR. The first system design round was for designing a permissioning system that can scale. Then came the first coding round, which was fairly easy (2 LC-easy problems). The second system design round - thats where things got worse. I couldnt very well figure out what the interviewer was saying. She had a pretty bad accent and the line was cutting in and out too. I reckon that I didnt do well on that one. The final coding round was even worse - the interviewer dwelled so much on a single issue that she knew little about (that Pythons `del hashmap[key]` is O(n) or O(1)) - in the end, she admitted that she didnt know Python. With 15m go to, she whipped out a LC-hard problem (calculator) for me to solve... ### SWE outcomeI wasnt too surprised that I didnt pass the SWE interview. I thought there were some highlights, but the last two sessions were pretty unsatisfactory for various reasons.### PE onsiteHad the PE onsite the next day. PE interviews are very thorough - 5 rounds, each one is different. First one is networking. You need to know the OSI-layers, and popular protocols for each layer that make the internet work. I thought I did fairly well, even though Im not a network engineer. Next up was the system design round. I was asked to design a system that looked a lot like a container orchestration system (thats the most I can say without breaking NDA). Then came the behavioural round. This time I did prepare, especially for PE, they need to know if you can fit in the PEs way of working. I recommend reading the Facebook chapter in the Seeking SRE book by David Blank-Edelman. Coding round was next. It was similar to the phone screen where the question wasnt too LC-ish but rather practical. Make sure your solution scale well - e.g., for reading large files, dont read everything in memory but rather use a generator etc. Finally, the system internals round. This is the round that tests your knowledge of Linux kernel. The first question stunned me already - how the Linux glob pattern works. Then came a barrage of questions on Linux syscalls, the C-equivalent of them, process management, signals, etc. I answered them to the best of my knowledge, and still I missed quite a few, especially around the C API. It left me the same feeling as the troubleshooting one - feeling quite exposed but at the same time, I thought I did well enough that an offer is not outside of the realm of possibility :)### PE OutcomeThe recruiter called the next day and indeed I got an offer, from Facebook!## (series-A Database company)This also happened around the same time as the Instacart and Facebook offer. Their recruitment process was quite novel - no phone screen but a take-home assignment. I know some of you are vehemently against take-home assignments but I think its a fair &amp; practical way to gauge a candidates competency. The onsites are more conversational - one session on core database concepts and data structures that power databases. No actual code is required but only a high-level understanding of indexes, binary search, B-trees etc. Then theres another round on the take-home assignment. You need to be able to defend your design decisions. Furthermore, two rounds of past projects and Kubernetes experience. Finally, two rounds with the founders. Id say the overall experience was very positive and the least taxing :)### OutcomeGot an offer!# ConclusionI realized this is getting fairly long and uninteresting :) Just want to share my experience as someone who hasnt been interviewing for a while. What I learned from these interviews?- Not every company does LeetCode, and even for the ones that do (Facebook), theyre fairly reasonable (Ive been on 10-ish coding rounds and never once was I asked dynamic programming)- Similarly, dont be afraid of LC. Practice the basics and improve proficiency, especially for the Facebook rounds, where they ask you 2 questions per coding interview.- Behavioural rounds are important! Find some potential questions that you may get asked on behavioural rounds and practice your talking points. Prepare 3-5 projectssituations which can be used as examples for the behavioural questions.- System design interviews are the most unpredictable. You can prepare all you want, and if the interviewer thinks that you missed the point, its hard to change their mind. Still, prepare a repertoire of common system design problems is beneficial. Make sure you understand sharding, replication, load balancing, consistent hashing, consistency vs availability trade-off etc.- Dont overly optimistic or pessimistic about the interviews. Brex is a great example where I set my expectation too high and ultimately set myself up for disappointment. On the other hand, I thought I failed the Facebook Linux troubleshooting interview but the interviewer actually had pretty good feedback for me.- Dont get discouraged if an interview result doesnt go your way. Its natural to have the imposter syndrome when you didnt succeed in something but knowing that interviews arent science - there are lots of factors involved in whether or not you do well on them. For us experienced devs, give yourself a pep talk - you have made it and dont let one bad interview performance ruin your confidence.- Finally, dont loathe LeetCode. I know yall love to hate LC. Trust me, I dont like LC-style interviews either. I wish there were a more objective and practical way to evaluate someones coding skills, but practicing LC does help in various ways, e.g., proficiency, thinking about complexity and edge cases.Thanks for reading!","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_s9rpk0","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/s9rpk0\/flunked_out_of_faang_zing_and_realized_that_my_6\/","DATE":"2022-01-21","PLAIN_TEXT":"First thing: I believe its important that I tell you how I got here.The first 5 years of my career were spent working on legacy projects at a couple different companies. I fixed some bugs and pushed some features, but I knew I was falling behind wouldnt ever be able to call myself a senior engineer at this rate.This past year I fumbled my way into one of the Big-N and got my face ripped off every single day until my manager finally got fed up with me and PIPed me out the door.Two main takeaways here. Im much slower than most people when it comes to becoming competent with new stacksframeworks and code bases. This cannot continue. I desparately need some sort of experienceproject that will fool myself into thinking Im good enough to apply to senior engineer roles.To address the slowness, I believe trying to get up to speed on and making contributions to some open source project would be best. Maybe Firefox or the Linux kernel (please dont laugh). Ill also have to torture myself to learn as many bullshit toolsframeworks I can think of to get used to learning fast (Ruby on Rails, React, Spring, Kubernetes, Gradle, AWS, kill me).EDIT: I come off a bit too salty here, and my internal monologue is a lot more vulgar than most peoples. By bullshit, I mean arbitrary. As in, I dont care about the quality or utility of a given frameworktool. If its new and unfamiliiar, Im going to learn just for the sake of doing so. Learning new things is also mildly stressful for me (if it isnt, it means I already kind of knew it). Its really not that bad once I get started, but the energywill required to get myself to start can be monumental.For senior engineer experience, I can make some sort of large personal project and have pretty architecture diagrams and docs for it. Maybe a hefty game or some technically complex (yet elegant) website thats can withstand the weight of public popularity. The problem with the website is I dont think I can make one popular enough to drive enough traffic to be impressive. Can I really call myself a senior engineer if all Ive made is some no-name site thats never been under real load?EDIT: I do plan on job searching while also working towards these targets. These are just extras that I think I need to catch up to everyone else.Thats enough whining from me today. Feedback and comments are very much appreciated. I guess I could use a mentor too, if thats a thing that still exists. I wonder what its like to be good at your job. I imagine its nice.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"nyt:\/\/article\/22bf3568-ba28-512f-9caa-373e8c3200d0","URL":"https:\/\/www.nytimes.com\/2020\/05\/20\/nyregion\/coronavirus-students-schools.html","DATE":"2020-05-20","PLAIN_TEXT":"Salah-Deen Fouathia, an eighth grader at Voice Charter School in Queens, was struggling in school. It was hard to pay attention. Math was a challenge. His grades in health class werent great.At home, it seems to be a bit easier to focus on all the work, said one eighth grader who was struggling in school. Everything in general is easier.","SOURCE":"New York Times"},{"ID":"t3_qwgr23","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/qwgr23\/just_got_out_of_my_second_cubital_tunnel_surgery\/","DATE":"2021-11-17","PLAIN_TEXT":"TLDR: If you start losing feeling in your arms, thats downstream of being a programmer and inflaming your forearms holding your hands in a cocked position. Which then compresses the nerves etc etc etc. And then you dont do anything about it for a year and a half and then you get to have a surgeon move some nerves around. Woops!So do something about it yesterday.Longer version:In 2019, I started losing feeling in my hands and suffering severe and ongoing forearm pain from an inflamed common extensor tendon in both hands. My right mouse hand was worse. In late 2019, I started doing the process of getting it looked at and then had to stop when COVID hit.So at home, I stretched, stopping using trackpads (I have an M705 on every surface I will ever use my laptop on, youre welcome), and shifted over to either the Newtral Mouse or, no joke, the [Cutesy Beanie Baby](https:www.amazon.comTY-Beanie-Baby-CUTESY-DogdpB015EV60HG) as a wrist rest on my main dev box.And then in early 2021 once I had managed to get my shot, I gave in and went to PT which made things even worse in general and great for 2-3 hours following every appointment. Dry Needling is legit. And then we gave up and went to surgery. The right hand in August, the left hand at 7AM EST this morning.The problem is that the swollen tendon would trap the nerve so when I bent the elbow, my ulnar nerve wrapped around the elbow and stretched out. And then it got super-swollen, so it was even bigger and even when we got the forearm to (sorta) go down, it made things worse. And the resulting surgery is to literally pull it up on the side of the elbow with some slack so it never needs to stretch.I cant say its perfect, Ill probably get 9.3 fingers back at any time and its really really sensitive to vibration so long drives are no bueno and Ill probably wear either elbow pads or compression sleeves for the rest of my life. But its a massive improvement especially as I keep working on my tight forearms.So your todos today:1. Ask yourself about numbness, tingling, or lack of fine motor control in your hands2. Stretch, massage, Theraband, and rest. Hammer stretches for wrist rotation, table stretches for the wrist ROM, door stretches just in case your compression is in the shoulders (I had a touch, that did respond well to PT also known as grabbing a door and leaning forward for 3-5 minutes at a time). For massage, foam rolling is good, getting someone to pull up a wooden rolling pin for baking and roll out the tops of your forearms is even better. 5 minutes a side every day.3. If you need help, go get it early. The idea with PT is to work the muscles so they heal stronger and better but if youre at the surgery point, thisll knock out all remaining feeling in your hands when it makes all your problems worse.4. Completely related, dry needling looks ridiculous and is amazingly effective. I might go out to a PT in a few months and try another round or 17 twice a week just to get the forearms loose again.5. Its not a bad surgery if you get that far. Id say a couple weeks to 90% of OG typing speed, a couple months to full strength. FWIW, Im following Lyle McDonalds injury diet and it does seem to work (You.... do not understand what enough protein is.)6. Noting that I love WFH, having two setups and also an hour (or four, see I love WFH) of commuting to at least put your wrists in another position and a distinction between your work and home setups might be a big part of the reason this took so long to get so bad.As an aside, amusingly, this all happened on the downstream of Amazon at Compass and then at Google and not Amazon. Had a lot of other health problems at Amazon, but this wasnt one of them.EDIT: As of March 2022, Im now on 3 surgeries because the nerve fell out of my right elbow after the first surgery. ","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"business\/2022\/mar\/14\/mens-suit-uk-inflation-basket-covid-changes-ons","URL":"https:\/\/www.theguardian.com\/business\/2022\/mar\/14\/mens-suit-uk-inflation-basket-covid-changes-ons","DATE":"2022-03-14","PLAIN_TEXT":"The traditional mens suit has been removed from the basket of goods used to calculate the annual inflation rate - the latest casualty of the increase in working from home since the start of the Covid pandemic two years ago. The Office for National Statistics said the change in working patterns meant the suit - ever-present in the basket since its inception in 1947 - was no longer one of the more than 700 representative goods and services selected to measure the UKs cost of living. Announcing details of this years changes, the ONS said a new mens formal jacket or blazer item was being introduced to ensure mens formal and business wear was still represented in the selection. Related: Cost of living for UKs poorest could be 10% higher by autumn, thinktank warns Other items that will no longer be tracked include doughnuts, which are being replaced by multipacks of cakes, and coal, which has been removed in anticipation of the government ban on domestic sales of the fuel from next year. Suits have been a feature of the inflation basket since its inception in 1947. Photograph: PA Other items added to the basket for the first time this year also reflected lifestyle changes since the start of the pandemic. These included antibacterial surface wipes, sports brascrop tops and collars for dogs and cats. The ONS said demand for antibacterial products was still high, and people had responded to the pandemic by exercising more and owning more pets. Doughnuts have been removed from the list of goods and services. Photograph: Jill MeadThe Guardian Canned beans, chickpeas and lentils entered the basket for the first time alongside meat-free sausages, reflecting the growth in vegetarianism and veganism, driven by greater consciousness of health, animal welfare and environmental concerns. Last year, hand sanitiser, smartwatches and hand weights for home exercise were added. The ONS said this year it had added 19 items, removed 15 and left 715 unchanged. Inflation is at a 30-year-high of 5.5% but is expected to rise further in the coming months as rising energy costs bite. Meat-free sausages were included for the first time. Photograph: Adrian PeacockAlamy Sam Beckett, the ONS head of economic statistics, said: The 2022 basket of goods sees some really interesting changes, with the impact of the pandemic still evident in our shopping habits. With many people still working from home, demand for more formal clothing has continued to decrease. So, mens suits disappear from the basket and are replaced with a formal jacket or blazer. Sign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk Last years lockdown living saw an increase in the number of us working out and exercising. That has continued into 2022 with the addition of the sports bra into the basket reflecting greater spending on sports clothing. Responding to criticism from the food writer and campaigner Jack Monroe that the official inflation figure fails to reflect the true cost of living for poorer households, the ONS said it was launching a personal inflation calculator, which could be used to calculate an individuals personal inflation experience based on their spending patterns. The UKs statistical agency also announced it would be using new and improved data sources as part of an attempt to provide a clearer picture of what was happening to prices. It said it was working with retailers to get data straight from their tills, which would include how much each item costs and how many of each type - including value and premium brands - were available from shops in every part of the UK. Beckett said: Todays announcement is a key part of our long-term transformation of prices collection that is designed to keep the measurement of UK inflation as accurate and relevant as possible. ","SOURCE":"The Guardian"},{"ID":"t3_wqoo4r","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/wqoo4r\/not_giving_developers_root_access_to_their_dev\/","DATE":"2022-08-17","PLAIN_TEXT":" I have ran across this a few times, mostly in the financial service and healthcare spaces. And it just completely sucks to high heaven. I have found that anytime I dont have access to root development is just a constant uphill battle. Everything is unnecessarily hard. And on top of that, some top level governance decides on your development tools which are often substandard. The weird thing is that companies that love to restrict developer access also tend to crack the whip more. Always imposing ridiculous deadlines. From what I can tell there is never a good reason to restrict a developers access. I get that you dont want them always pulling in tools from the wild wild web. But I feel that if youre not shopping commercial software (and oftentimes youre not in these orgs), then it should be fine to get your work done. I just never understood reducing developer choice.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_mz148a","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/mz148a\/leaving_my_new_job_after_a_month_because_its_a\/","DATE":"2021-04-26","PLAIN_TEXT":"A month ago I started a new remote job at a mid size tech company no one has heard of for a mid level dev role. Here has been the insanity that has ensued in that time frame:- The job title I interviewed for was not the one I received in my offer letter. Thought nothing of it, until I started to find out I would be doing support and not writing code. I spoke to my manager and she said it was 80% support, I might get to code later in the year. They did the same thing to two other new hires, WTF - Required to watch a recorded zoom call. The call actually got heated between management and employees. The CEO cut off an engineer and said LOOK HERES THE DEAL... This is shown to all new hires lmao- Was told I got equity day 1 in the interviews as part of my comp. Well to my surprise its radio silence about equity. I spoke to my manager about this and she said this was coming soon. So what I was told in my interviews about that comp doesnt even exist but is supposed to come later? WTF- Day 1, four hours into my shift I started doing support. I didnt even have my bank account setup to get paid nor did I know who anyone was. No idea what I was doing and I just fumbled through it. - Work life balance is trash. There are certain PMs that are on Slack 24 hours, you can contact them any time. Boss seems to do 10-11 hour days on average- First week and 3 engineers left. Granted I dont know how engineering is laid out, but definitely heard we cant do X because we lost a guy more than once. Department lead mentioned issues around employee retention in all hands meetings WTF - Culture is trash. No one talks in slack channels, no fun talk about things outside work, no light hearted convos. Dont know anything about my coworkers, Its just work work work. Some people might prefer that but believe me its about as welcoming as a morgue slab.So naturally after week 1 I saw the writing on the wall (the bait and switch alone had me out the door) and continued interviewing. Well I got an offer and they want me to start in two weeks. Im thinking after this fucking madness I will only give them 1 week notice and take the next week off to recharge. Then I will leave it off my resume forever. What do you think? Should I even care about burning that bridge?","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_hkz25z","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/hkz25z\/protip_never_let_your_client_work_on_your_project\/","DATE":"2020-07-04","PLAIN_TEXT":"So my client was a programmer. He paid me, and handsomely, but at the end he started working on the project himself. He didnt pull the repo, and ended up sending the wrong request to the server. He ended up not paying a large sum of what he owed me because he thought the code is faulty. Plus he was kinda... emotionally needy. He expected me not to work on any other projects whilst I was working on his.&amp;#x200B;So here are a few things that Ive learned from my second project:&amp;#x200B;1- Never befriend your client. People who ought to pay you make the worst friends.2- Never let your client work on your project. This guy, I respect him and all, but he was kinda stupid, I told him three times that I have changed the header name in the backend but he didnt know much about Express so he thought Im speakign gibberish or something. Thats why sadly things ended up badly between us.3- Never, ever be verbose with your client. Determine a time, like, 7 PM, and tell them that at that hour, exactly, you will be available on Slack, WhatsApp or what have to update them on the project. NEVER be on their catch and call 247. Dont work on the weekend or else they get cocky.4- Expect a clean, laid-out document detailing what the client wants. Dont just ask them. If they decide to change X whilst you have put a lot of time on it, cite them. Yeah cite the fuckers. This dude changed the project over 15 times, and I had to scrap much of my code. At the end he asked me to rewrite the frontend the way he wanted. I liked his way but he didnt pay me for it because he thought its broken, because of the header thing which I told him thrice about.5- Kinda extension of the first point but if your client is a programmer, only give him read access to the repo.&amp;#x200B;6- Never let your client test the project. Always test your project yourself first. Only let your client test out the project at the end of each cycle which brings me to...&amp;#x200B;7- Make milestones. And always make them pay you at the end of each milestone. Also, take a retainer. Like, 14 of the end fee as the retainer.&amp;#x200B;I worked with a programmer because I didnt have a published app to my name. Im going to take a break from working with remote clients, my professor has found an investor for my chore app. Im going to work on it for a month so I have an a published app instead of lines of code. I had two apps when I started working with this guy but he kinda asserted himself as my supervisor because he himself was a programmer. Damn. Should have never let it happen. When he was working on the app he would ruin the repo and I had to spend 2 hours each day fixing his mess. He reverted my changes because he believed redux-persist is in a loop Goddamit what does that mean. &amp;#x200B;Okay I didnt mean to vent just to relay my experience. If the guy is reading this please be decent and dont post because I have the proof that you messed up. Thanks.&amp;#x200B;&amp;#x200B;PS: if you guys have any tips for working with clients, tell me.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_yjewy3","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/yjewy3\/got_promoted_to_director_after_boss_quit_any\/","DATE":"2022-11-01","PLAIN_TEXT":"Currently a high level IC with 2 decades of software dev experience. Happy being an IC. Boss put in his notice and I was asked if I wanted the role. Never really been interested in management track. Took the offer because I figure Id give it a shot and see if I was any good at it and liked it. Also figured itd be good (maybe) on my future resume. I have a fallback that if I dont like it or its not working for any reason I can go back to my IC role. Looking for any advice from anyone who might have been in this situation before. Thanks.Update: so thank you everyone for your sage advice and recommendations. To answer some repeated questions, its a small company with 1 team of 5 people who will all report to me. There is no engineering leadership outside of the director role, no SVPs or CTO. Were just not that big. Ive been in the lead IC role now for over a year and my boss leaned on me heavily to own and direct the technical aspects and of our product, which Ive done and proven to be good at. The biggest difference with this new level of responsibility I think will be that I will now have a seatvoice at the executive table and will have direct reports from an HR perspective. Ive always subscribed to the servant style of being a leader, even in my IC role, providing direction, feedback and helping teammates where I can, but more specifically from a software perspective vs career perspective. I always look out for the team. My last few roles have had me basically being the right hand person to director and Ive always paid attention to the politics of it all, at least what Ive been exposed to. So I dont think Im going in blind. I agree it will be hard for me to let go of the day to day IC but there is a strong Sr Eng on the team who has been stepping up and I have all the confidence he will do great taking over my old duties and I will support him to the best of my abilities.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_pf5ymx","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/pf5ymx\/where_do_software_engineers_make_the_most_money\/","DATE":"2021-08-31","PLAIN_TEXT":" Where do Software Engineers make the most money on average?Ive heard Software engineers make good money in these places Big companies FinanceHedge funds as QUANTS Niche specializations (consulting) Getting a remote job in a country with higher wages StartupsWhat would you do if your only concern was making as much money as possible, while still having some work-life balance?","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"nyt:\/\/article\/466b1826-181e-5651-9e20-b7d41fadc035","URL":"https:\/\/www.nytimes.com\/2021\/07\/18\/us\/politics\/congress-remote-voting.html","DATE":"2021-07-18","PLAIN_TEXT":"WASHINGTON -- When the House revamped its rules in the early days of the pandemic to allow lawmakers to vote remotely, Representative Ralph Norman of South Carolina was among 161 Republicans who sued to block the arrangement, arguing that it subverts the Constitution.An emergency measure intended to allow Congress to function amid a nationwide lockdown has become a matter of personal and political convenience for House members of both parties.","SOURCE":"New York Times"},{"ID":"t3_tveiy8","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/tveiy8\/takehome_aws_test_that_cost_me_90_only_to_be_told\/","DATE":"2022-04-03","PLAIN_TEXT":"I applied for a job. The test included setting up an app using AWS services rather than code (ie apigateway rather tham node express, etc). I told them tagt I had no experience with these AWS services, but many times the test is to see how fast you can learn something, so they were like thats fine, and if you need extra time etc etc. So a few days later, its all done and I submit it (it did exactly what was asked, even according to another dev that reviewed it). Then some weeks later, I get told that they aremt moving on with the process because they are looking for X years experience (even though my resume already stated what my experience was). Whatever, I got and accepeted an offer a werk after that for more money than they were offering, and where the work is all code and no AWS (the wix of devops). Then I get my $90 AWS bill for the services I bought to do the test. I will never do a take-home test ever again.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_fxs9h5","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/fxs9h5\/unpopular_opinion_job_hopping_is_a_luxury\/","DATE":"2020-04-09","PLAIN_TEXT":"I see posts that say if you dont like whats going on, if it isnt perfect, if they arent doing things exactly like you want, just leave for another job. Little to no advice on how to make things better or improve the situation, just email your bevy of recruiters and find something new.This is a luxury not all developers have. Not everyone work in areas where we have a dozen friends working at a dozen different companies each with openings ready to take new people without a problem. Some of us cant just move eight states away at the drop of a hat, some of us want more from a job than just technical superiority, some of us need specific work conditions. Ive always wondered what hiring managers think of someone who has had X jobs in X +- 1 year.There are absolutely times when you should get out of a company. And I hold no rancor towards those who have no patience for companies that arent doing things the way they want - if you can pop off to the next adventure after 6 months without screwing yourself, Im happy for you. No one should work in a job they hate, but find something else isnt a great option at the first sign of difficulties.I just think we need to foster a bit more resilience to adversity in technical positions. Work a bit on being the change you want to see. Push back on the shitty managers, push for better technology, put out initiatives to improve the state of things.The advice we provide people should be based on our experience at dealing with challenges, not on how to find another job. It should be focused on helping people in bad situations improve those situations, not leave them behind. And, yes, it should eventually be how to find another job when it is clear things are not going to improve.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_uqiggi","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/uqiggi\/remote_work_has_had_my_motivation_incredibly_low\/","DATE":"2022-05-15","PLAIN_TEXT":"Ive been work from home for almost a year now. Admittedly we are hybrid... once a month.The days were in the office, my motivation is through the roof. I check all the slack channels, I do lots of work, I pair program with senior engineers and learn lots from them, we go for coffee and lunch together, I can go out for a walk and hang round the office, were all sat together and I just - enjoy. working.When Im work from home for the other 30 days of the month: I sleep all day, I wake up for meetings, I do the bare minimum work, I dont engage in discussions, I learn nothing, I have tens of slack channels unchecked for weeks.We do a fair bit of pair programming too, this is incredible in the office, I love doing it and interacting with the engineers and learning. When its WFH I feel like a fucking snail, a zombie even. 8 hours on a call following instructions given to me. It turns my brain into mush, I learn absolutely nothing and its incredibly mind numbing.I genuinely dont know what to do anymore. Im a junior so these early years of my career are so vital to my development but every single week is getting wasted and wasted. I have absolutely 0 passion nor motivation to work when its remote.What can I do about this? Any advice?Edit: thank for you all the support everyone, there are a solid few comments that are kinda attacking me for being that guy whos ruining WFH for everyone (even though Im literally not!) so thank you for all that are actually being supportive whether or not you prefer WFH or IRL. Its important to remember that not everyone is the same. Yeah sure, 99% of the world love WFH, but to people like me, its getting more and more damaging, so its important to be understanding and supportive of each other regardless of what you prefer.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"business\/commentisfree\/2022\/may\/15\/let-them-eat-cheese-working-from-home-is-here-to-stay","URL":"https:\/\/www.theguardian.com\/business\/commentisfree\/2022\/may\/15\/let-them-eat-cheese-working-from-home-is-here-to-stay","DATE":"2022-05-15","PLAIN_TEXT":"One of the bestselling business books of all time is called Who Moved My Cheese? by Spencer Johnson and has sold 30m copies worldwide since 1998. It is a book about change and features two sets of creatures, mouse and human, who are either trying to replicate old patterns and find long-lost cheese or be adventurous and discover new supplies of it. It is rather a fitting parable for the emerging battle lines around post-pandemic working practices, specifically how much knowledge workers use the office and what productivity gains look like with new hybrid working patterns. Another Johnson is also using cheese to make his point. The prime minister said on Friday: My experience of working from home is you spend an awful lot of time walking very slowly to the fridge, hacking off a small piece of cheese, then walking very slowly back to your laptop. This message - that all you do is nibble unproductively and waste time when you work from home - has been echoed by a series of poster-men (and it is men of a certain generation) for RTO or return to office from business and government around the world, including David Solomon of Goldman Sachs, who called working from home an aberration; Lord Sugar, who railed against the lazy gits at PWC who are working summer hours out of office; and of course Jacob Rees-Mogg, who took to touring empty Whitehall offices and leaving passive-aggressive Sorry you were out notes on desks. From a management and leadership perspective, all I can say is that this strategy is not much better than calling workers cheese-eating surrender monkeys (a term memorably coined by The Simpsons - the same year that Who Moved My Cheese? was published - to describe the French), and it is interesting that some politicians and business leaders are deciding that attacking the workforce is their best line of defence against the seismic changes they are facing: the tightest labour market in decades, rising inflation, and a global rejection of a return to office life with all the economic and cultural disruption that implies. The timing of Boris Johnsons remarks coincided with the media briefing by Rees-Mogg that the civil service can be cut by as much a a fifth. He has deliberately conflated the question of cuts to the service with criticism of the emerging hybrid model of three days a week in the office and two remotely, which is fast becoming the norm in post-pandemic cities around the world. To do so is not just bad politics but flies in the face of evidence that new working patterns which give workers agency, flexibility and a mix of in-office social time with self-managed, less monitored work is productive. Professor Nicholas Bloom of Stanford showed in a study of 16,000 workers that productivity can rise by as much as 13% on this basis. Data from Ipsos consistently shows that across all demographics flexibility to work differently is desirable, with 65% saying they are more productive when they work flexibly. So why the political and management resistance? Lets go back to cheese. Old habits die hard, and changing command-and-control models is an undeniable challenge. Implementing hybrid is hard and will involve experimentation and iteration. The indecisive, change-resistant human characters in Who Moved My Cheese? are called Hem and Haw. It takes them considerably longer to realise that they have to go through the maze they are in to find new sources of cheese than it does their more entrepreneurial counterparts Sniff and Scurry. Today Hem and Haw are those leaders who would prefer to see pointless presenteeism rather than be curious enough to find out how their staff like to work and can be best productive. The post-pandemic office is entirely different from how it was before. Teleconferencing and technology have collided with cultural shifts, and people want to better integrate their work self with the rest of their life. When it comes to the politics of work and the post-pandemic workplace, 2022 will be remembered for the battle between the fridge and the watercooler. But to borrow from another phrase, those creating the policies and tasked with making them work need to keep it real. Change is in the air and someone just moved the cheese. Julia Hobsbawm is the author of The Nowhere Office: Reinventing Work and the Workplace of the Future and the co-presenter of the podcast The Nowhere Office","SOURCE":"The Guardian"},{"ID":"t3_usrwyf","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/usrwyf\/my_failed_attempt_to_jump_to_a_bigger_ship_w_3\/","DATE":"2022-05-18","PLAIN_TEXT":"I have 3 YOE at a large (not well known) company, originally hired as a junior graphics programmer with some computer vision. Yet the last 3 years my company had me working in the C++ plumbing side of things, solving system-specific featuresissues. More recently I was moved to a lead role for various IOS projects despite my annual requests for more graphicsCV roles. Ive probably only written 4 shaders during my time here. Ive kept my projects up to date, but they arent anything mind blowing. One weekend night, out of frustration I tossed some applications out there not expecting much, but to my surprise got callbacks for 1013 positions, mainly at some of the giants in our industry. So I got to studying again, while continuing to work full time, and I only had 1 month to prepare. The study plan:My primary areas of focus were as such in order of importance:1. Leetcode (85 done in 4 weeks)2. C++ (the usual, but with a focus on multithreading)3. Graphics4. Linear Algebra5. HardwareOSI filled up 7 pages of paper back to back writing out my notes for #2-5. Monday-Friday, Id do 3 LC questions from neetcode, where Id attempt the problem first. After 15 minutes Id watch the solution, then implement it on my own. Then Id review the notes written up to the previous day, and write some more notes. For stuff like linear algebra Id do a final exam wsolutions released somewhere on google from some university. Every Saturday and Sunday was dedicated to re-doing all of the LC problems Id solved up to that point.RESULTS:My resume got me good callback rates, and I made it to onsites for about half of the 10 callbacks. My study plan was great as well, there wasnt a single problem I wasnt able to solve, though they werent always optimal. In the end, the odds didnt work in my favor. Out of the 10 callbacks:Made to onsites:- Some fruit company: Did perfectly on phone screen, and the tech screen. Onsite I did well on about 75% of the interviews, but it was enough to drop me from the running. I knew I was out of my league here, but it was a valuable experience.- A startup: Crushed nearly everything, some of the interviews on the onsite were a bit shaky since it seemed like they were looking for a unicorn. I honestly used this one for practice, but did get an offer. However the comp wasnt great and I dont want to be at a startup at this point in my career.- A game studio owned by Microsoft: I did solve all the problems they gave me, but it required a hint or two from the interviewer. Someone definitely just did better than me here.- Company that makes VR goggles: They didnt ask me a single question related to graphics lol. From beginning to end it was LC, so again someone probably just did betterfaster than me, even though I found optimal solutions.Dropped after tech screen:- Rainforest: I dropped the ball on a LC-medium question that couldve been easily optimized, I wasnt on my A-game.- A social media app: Did well on the tech screen, but dropped regardless. Other candidates probably had better backgrounds.Dropped after phone screen:- Companies Green, Red, Blue: For all three, I suspect my lack of graphics driver experience was the culprit.- An animation studio: The devs on the team seemed to like me, but my lack of graphics research experience hurt my chances here.Some obvious proscons about myself I could pinpoint:Cons:- Others likely had superiormore relevant projectsexperience like with graphics drivers, subdivision surfaces, CUDA, etc. That wouldve helped me get past the phone screens for places like green and stand out better for the other stages.- All the tech screens were solely Leetcode. I at least solved all of the ones they gave me, but sometimes had trouble pinpointing how I could optimize or shorten some of them. More grinding is required for the top positionsPros:- I am very experienced in various parts of the stack with multiple languages and platforms (which happened unintentionally because of my company haha). Companies were interested because of it, hence the good callback rate.- I may be an introvert, but I can communicate effectively and quickly build rapport. Even if a problem doesnt go my way, I can talk my way through it and come up with at least a solution.- Open to relocating, and open to non-remote. This one is huge. It greatly increased my odds.Conclusion:I still have a job, and even if the comp isnt the best its still good to live on and build some savings. Despite the stress, this ordeal helped me figure out areas I needed to grow in more and gave me confidence in other regards. I did damn amazing in the LCtechnical for only 1 month of studying, and even I couldnt believe I got 1013 callbacks.Ill do my hunting more casually now. I still do want better comp and a job closer to actual graphics, but prepping for and doing 20+ interviews in the span of 3.5 weeks is god damn misery. Suffered severe mood swings. Seriously, dont do this unless your firing is imminent or something.If youre working fulltime with some YOE, and you think you want to switch jobs, dont start applying like I did. Youll get the callbacks. Plan out a study plan over at least 3 months, and take it slow. Apply to a few companies at a time, dont shotgun.I hope my experience helps anyone looking to do a similar transition!","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_o6kc3n","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/o6kc3n\/love_programming_but_ive_hated_every_single_job\/","DATE":"2021-06-23","PLAIN_TEXT":"The nonstop meetings, the naggy managers, the having to wake up in the morning, the tight deadlines, the confusing code, the stress, the nothing-ever-goes-smoothely of it. I fucking hate it all so much. Even now that Im working remotely Im still so miserable. How do people do this their whole lives like this?Ive been drinking everyday the last 3 years tryna get through it. Its unbearable, draining and leaves me no time to do anything else Id like to do","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_wa4krq","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/wa4krq\/alright_engineers_whats_an_industry_secret_from\/","DATE":"2022-07-28","PLAIN_TEXT":"Ill start:Previous job - All the top insurance companies are terrified some startup will come in and replace them with 90-100x the efficiencyCurrent job - If a game studio releases a fun game, that was a side effect","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"money\/2021\/nov\/28\/goodbye-to-job-how-the-pandemic-changed-americans-attitude-to-work","URL":"https:\/\/www.theguardian.com\/money\/2021\/nov\/28\/goodbye-to-job-how-the-pandemic-changed-americans-attitude-to-work","DATE":"2021-11-28","PLAIN_TEXT":"One morning in October, Lynn woke up and decided she would quit her job on the spot that day. The decision to quit was the climax of a reckoning that began at the start of the pandemic when she was first laid off from a job she had been in for three years. Ive always had the attitude of being a really hard worker, Lynn said, explaining that she believed her skills made her indispensable to this company. That really changed for me because I realized you could feel totally capable and really important when, really, youre expendable. Related: The Great Resignation has employers sweating. Its time to escalate the pressure | Erika Rodriguez A few months after being laid off, Lynn, who wished to be referred to by just her first name for fear of professional repercussions, got a job as a diagnostic technician for a solar company in Massachusetts. After a year at the company, work started to become an endless cycle of stress. Her company was in the process of eliminating her department and was trying to decrease her pay. I just needed out, she said. Lynn is one of the millions of Americans who have experienced a tectonic shift in their outlook to work during the pandemic. In September, 4.4 million people - more than the population of Oregon - quit their jobs. Job openings have surpassed 10m since the beginning of summer. Workers have been going on strikes and speaking out about their working conditions online, particularly on the popular subreddit rAntiwork, which has more than a million members. Quit my job last night, it was nice to be home to make the kids breakfast and take them to school today, one Reddit user wrote on a post that has received more than 267,000 upvotes. I may not have health insurance, but I feel so free! another user wrote in a post that included screenshots of their resignation via text message. To experts who study the history and cultural role of work in the US, the fact that this moment occurred during the pandemic is largely unsurprising. Millions of Americans have long been exhausted by harsh working conditions - long hours, low pay and little flexibility - and many, especially those who were considered essential workers, have been burnt out by the pandemic. People are saying that they are systematically underpaid, they get a ridiculously low share of the value that they produce over the course of the day. Theyre doing most of the work, and yet theyre treated badly and receive wages that they cannot live on, said Kathi Weeks, an associate professor of womens studies at Duke University and author of The Problem with Work: Feminism, Marxism, Antiwork Politics, and Postwork Imaginaries. The pandemic was the straw that broke the camels back. Benjamin Hunnicutt, a historian at the University of Iowa who has studied the role that work plays in the lives of Americans for decades, describes it as a mass re-evaluation of the promise that a job can be more than a means to an end and can deeply fulfill us as human beings. Work as we know it is a modern invention, Hunnicutt points out, a product of the Industrial Revolution. The revolution separated work life from home life and made it a distinct part of peoples lives. While the payoff for society was huge, it also made work the dominant factor in our lives, with some people working over 70 hours and having fewer days off. Hunnicutt notes that progress in the early 20th century was defined as higher wages and shorter working hours. Notable economists predicted that this trend would continue and people would work less. The famed economist John Maynard Keynes predicted that by 2030, people would be working 15-hour work weeks. Free time was seen as that place where human beings could flourish, Hunnicutt said. Work was good, but its still a means to an end - the end being making a living and the promise of free time to enrich life so that we become better parents, better participants in our community. Instead, we have been stuck at the same 40-hour workweek that came out of the Great Depression. Why we have not budged from that schedule, despite technology that has made workers far more productive, is a question that Hunnicutt says his research from the last 50 years has been trying to answer. Since the 40-hour workweek was developed over 80 years ago, Americans have developed an almost religious devotion to work, Hunnicutt argues, one where work is seen as an end itself and is fraught with expectations. Our expectation is that work will continue to be full time and it will be that place where our humanity can be fulfilled, he said. But while Americans were raised on the idea of a dream job, one that could be both personally and financially fulfilling, work has often fallen short of providing people with what they need to live. A statue of Elena the Essential Worker at a One Fair Wage and the Poor Peoples Campaign rally in Washington earlier this year. Photograph: Leigh VogelUPIRexShutterstock There is a huge gap between the productivity of workers over the last 40 years and the amount that wages have grown during the same time. Wages today offer workers the same purchasing power that they had in 1979, with the highest tenth of wage earners seeing the most meaningful rise in wages each year. About 43 million Americans have student loan debt worth a total of $1.7tn. Gig and contract work, which typically comes without health insurance or retirement benefits, has risen 15% over the last decade. Even before the pandemic, the reality for many millennials is that they will be financially worse off than their parents, having less wealth than previous generations, largely because of the rising cost of houses and student debt. This reality has created a disillusionment with work among young Americans that Hunnicutt said had been observed before the pandemic but had also been exacerbated by it. The experience of being away from work has awakened people, Hunnicutt said. There are other things to do - there are walks to take in the park, theres life beyond work that [people] had not thought about before. Companies have caught on to the decreasing tolerance for work - particularly work with long hours and bad conditions - and have indicated they are willing to implement some change. Dozens of companies have announced they will allow their employees to work remotely indefinitely. Some companies, like Kickstarter and Shopify, are experimenting with four-day workweeks, which some argue does not affect productivity while increasing employee satisfaction. Policy action at the federal level, while limited, suggests lawmakers have been paying attention. Paid family and medical leave, while under heavy debate in Congress, made their way into a major spending bill passed by the House on Friday. Mark Takano, a US representative from California, has introduced a bill for a 32-hour workweek. Some experts say the phenomenon is temporary, a product of a hot labor market that is empowering workers, and things will eventually go back to the way things were. But others are hopeful that the pandemic has permanently shifted the way that people think about work and will inspire them to question - and even change - the role it plays in our lives. Weeks said that she is excited that so many people are active on the rAntiwork subreddit, and that they seem to come from different industries and backgrounds. People are identifying this as a systematic problem with work, Weeks said. Whats interesting is the way people are making connections between their individual experiences and identifying patterns: Actually, theres something systemic here. There is a deeper problem thats producing these similar experiences. Lynn said reading the subreddit made her feel validated about quitting her job abruptly. She posted her story on the page and received dozens of comments of support. One person messaged her and said that her post inspired them to quit their job. My mindset has totally shifted on how I allowed myself to be treated, said Lynn, who has since started a new role at a different company that is giving her higher pay and better benefits. I definitely value my own personal time and family a lot more now that I recognize the value that a corporate entity actually sees in you.","SOURCE":"The Guardian"},{"ID":"t3_pnc71f","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/pnc71f\/when_do_you_know_its_time_to_switch_jobs\/","DATE":"2021-09-13","PLAIN_TEXT":"I have around 9 years of experience and switched companies two times before. Both times I quit it was because of higher offers but now, being 31, Im starting to care more and more about companys management, strategic plan, scope of work, culture... I never really cared about these things but Im slowly understanding how much of these are affecting my overall happiness and basically willingness to work for the company.My question is simple: when did you figure out its time to switch jobs? Even if you had a relatively ok gig? Im not really talking about abandoning a ship when a startup is going under, or if youre joining FAANG for 40% raise... its more of a I have a good thing going on but Im thinking of leaving.At my current job, after 3-4 years with the company, Im almost starting to hate my day-to-day. Its kind of ok, but also awful at the same time. Im no longer learning anything, Im not progressing, the management is making some god-awful decisions, they started outsourcing to third-world countries instead of investing in local youth (juniors), the upper management isnt listening to any complaints, middle management is made out of inexperienced people... I mean, almost every aspect of the company-employee relationship is in my opinion completely meh or ok. There isnt anything thats really great about this job (except from the job description).Were you in a similar situation? What made you quit your job even if you had a relatively good thing going on?","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"t3_fcgxnw","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/fcgxnw\/its_so_much_less_stress_when_youre_not_pursuing\/","DATE":"2020-03-02","PLAIN_TEXT":"I graduated a year ago and I applied to many jobs. I tried really hard to get interviews at the Big N companies. I had dreams of moving to a major city, working for Google or Amazon and thinking about all the pride and glory I could have to say I worked for [insert Big N here]. Eventually I realized I wasnt as good as I thought I was. Those leetcode problems didnt stick with me. Trying to memorize all those algorithms and data structures were stressing me out. I really didnt like programming as much as I thought I did. I realized I was mediocre.I started applying to jobs at random companies Ive never heard of that I would normally ignore. In small cities near that werent tech hubs. I got a phone interview at a small company nearby that did hardware and had a small 6 person webIT team. I was dreading the idea of working there. But I went in and met the people and I flipped completely. Everyone was so nice. The boss seemed to really care about all their employees. Everyone was a family and I felt immediately welcome. I got along great with everyone and their interview process went smoothly, I felt like I actually connected with real people for the first time.This was a huge contrast to the awful, stressful, interviews I had at tech companies in bigger cities where everyone felt cold and like they couldnt care less about talking to me. People who drilled me, were snarky, and got visibly annoyed when I didnt know something. I had quite a few ghosts and interviewers who bailed and recruiters who were awful and sent me wrong information. The interviewers seemed to barely glance at my resume. At this company, people I never met were genuinely excited to talk to me about small details about myself.Also? There was practically no technical parts of the interview. I got casually asked a basic array question that would be CS101 and that was it. The rest was personality and half the interview process was me shooting the shit with people about life, music, hobbies, etc. What a relief!As far as pay, its not amazing and its not 6 figures, but its livable while also being relatively comfortable in this non-major city. Theres no overtime and rarely ever will you get called outside of work. I can easily afford rent, utilities, food, etc. while also having a few hundred to save and few hundred for recreational spending. And thats fine by me. I dont think Id be any happier with more money. I can work relatively stress-free and enjoy my hobbies outside of work. Theres no pool table or free snacks or a Nintendo Switch with Smash Bros in the break room, but who cares. Im there to work. I can have fun at home.Honestly Im relieved. I wish I stopped trying so hard earlier and beating myself down not realizing I just didnt have the aptitude for this stuff. Its not a company anyone has heard of, I cant wear it like a badge of pride, but Im making rent and Im happy. I realized I just wanted the pride of working for a company like Google, so I could tell people and they would be impressed, but thats all superficial. It was a vicious cycle of thinking I needed to be great, being unable to achieve what I wanted to achieve, and emotionally feeling like shit afterwards. Genuinely the last year of my life has been the worst Ive ever felt mental health wise.By all means, shoot for the big companies and salaries, but if its destroying you mentally, I found giving up and enjoying being mediocre to be the way to go.Just wanted to share my story after reading this sub for the last ~2 years and feeling like if I didnt make 6 figures in a major city at a company people have heard of, I was worthless. If anything, I feel the most worth at this small company than I did interviewing at bigger, more well known, companies.","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_q4udlt","URL":"https:\/\/www.reddit.com\/r\/ExperiencedDevs\/comments\/q4udlt\/30_years_of_experience_in_a_shop_where_the_next\/","DATE":"2021-10-09","PLAIN_TEXT":"I think Im ready to throw in the towel at this place I joined less than three months ago. Its a well-funded startup in a space I thought was interesting. They seemed like they desperately wanted my skills to move forward and promised me autonomy. They gave me every reason to believe that my input would have an impact on the company.A week after I got hired, new managers joined. Friends of the CEO from a previous company. Then over the next weeks, dozens of more people from the same company got hired in management positions all through the companyThe new engineering manager fancies himself to be the authority on all things having to do with architecture, data, and development. Unfortunately, he has shown himself to have a nebulous grasp on any of those at best. He has resorted to micromanagement to enforce his visionI asked questions about why were adopting microservices, I was met with vague answers delivered with defensive hostility. Same for when I asked why were implementing a distributed database architecture for less than 10 GB of dataTheyre going all out to design an extremely complicated clusterfuck for an application that should otherwise be much simpler to create. The devs there are nice enough, but they have no idea how databases work, they have no concept of what theyre facing when implementing an event hub as a way to synchronize data inside their service silos (we shouldnt even be doing this except that somehow we have to use microservices now). They think wireframes replace specs so we have no real requirements, but we need to start now!.I tried to at least get them to articulate why were making these technical decisions, and the few times they agreed to verbalize anything, their answers demonstrated inexperience in developing larger systems like this one. They think replication is a backup solution, functional programming is ivory-tower bullshit, and JSON databases like MongoDB are the default solution because RDBMS engines are for boomers.For some context, Ive written two books on databases and data warehouses, Ive written compilers in C++ and Rust, I used to be a certified instructor for SQL and also TCPIP networking. Ive written high volume, low latency TCP servers, HTTP servers, and SQL engines. Ive spoken at conferences, taught courses, and led teams to develop mission-critical applications for fortune 500 companies.Fast forward to now and I no longer get invited to technical meetings and Im reduced to maintaining undocumented Go code written by a 25-year-old kid.So fuck this. Im going back to contracting. Im very proficient in Rust, so Im sure Ill find something I can do.","SOURCE":"Reddit \/r\/experienceddevs"},{"ID":"nyt:\/\/article\/dcec0440-edd1-5d0d-beb1-dfe55ac9fd3e","URL":"https:\/\/www.nytimes.com\/2021\/03\/03\/technology\/job-sites-economy.html","DATE":"2021-03-03","PLAIN_TEXT":"This article is part of the On Tech newsletter. You can sign up here to receive it weekdays.Career websites are seeing a mismatch between what employers and the rest of us want in jobs.","SOURCE":"New York Times"},{"ID":"society\/2023\/mar\/21\/dungeons-dragons-therapy-psychologists-mental-health","URL":"https:\/\/www.theguardian.com\/society\/2023\/mar\/21\/dungeons-dragons-therapy-psychologists-mental-health","DATE":"2023-03-21","PLAIN_TEXT":"I am Goldie, a druid with long white hair and the half-human, half-horse body of a centaur. I walk into a lush, green forest with my constant companion, a goat named Penny. As we tread down a winding pathway, we start to smell the rotting stench of decay. Then we see it: the corpses of other animals, decayed beyond belief, spores poking from their bodies. There are mushrooms everywhere. Its a little after 9pm and Im sitting at my kitchen table in Brooklyn, Zooming in to a fantastical journey led by Megan A Connell, a licensed psychologist who uses Dungeons &amp; Dragons during therapy groups. Shes leading me through a round of the popular tabletop game to help me notice patterns of behavior. We journey onwards. A little red structure appears, she tells me. I walk to the window and peer in, just enough to get a glimpse of who is inside while staying covert about it. I see an angry monster pacing back and forth. His face looks melted. Hes made up entirely of mushrooms that appear to be spiking straight out from his chest. She asks: do I want to approach him? No, I definitely want to run away from the crazed mushroom man. I turn on my heels, and gallop directly in the other direction. Dungeons &amp; Dragons has long been a haven for outsiders, and its evangelists say the game helps them build a community and let their imaginations roam. Since its creation in 1974, D&amp;Ds reach has expanded far beyond basement gatherings and high school lunch period meet-ups. There are now over 13 million active players worldwide, thanks in part to its inclusion in the plot of Netflixs Stranger Things and a pandemic-era boom in remote playing. A forthcoming action comedy, Dungeons &amp; Dragons: Honor Among Thieves, starring Chris Pine, will lure more fans into the franchise. A scene from the forthcoming Dungeons &amp; Dragons film. Photograph: Landmark MediaAlamy D&amp;D diehards might tell you that no Hollywood blockbuster can compare with the theater of the mind, which is where the game thrives. Using only dice and a rough roadmap of how the game will go, players sit around a tabletop and dream up scenarios for their characters, relaying them through storytelling. You may steal treasure, kill goblins, or cast wicked spells. As players often say, the only limitation is your own imagination. According to Connell, this makes D&amp;D an ideal conduit for therapy. During our session, Connell tells me that I have a sense of curiosity that can lead me to danger - but enough self-preservation to know when to back away. (Any similarity between my game and a certain HBO mega-hit series featuring killer fungi is purely coincidental. After we play, I remind Connell that bacteria-carrying mushrooms are also the villains in The Last of Us - she had forgotten.) According to practitioners, D&amp;D can be used to treat everything from exploring gender - you can take on a character whose identity is completely foreign to yours - to recovering from traumatic events. Trauma disconnects us from ourselves, and one of the first things we get disconnected from is our imagination and creativity, Cassie Walker, a clinical social worker, told Wired last year. Role-playing has the potential to lighten up therapy sessions, and invigorate clients whose expressiveness may have been dulled by past events. Today, Connell is especially interested in working with young women and girls to use the game to build self-esteem and assertiveness through play. Its a great place to practice skills and step into those aspirational traits to be the person you want, she said.. In middle school, Connell and her friends appreciated the chance to escape into their characters. Photograph: Jill MeadThe Guardian Connell first encountered the game as a child growing up in rural Maine. Her middle school friends mostly appreciated the chance to escape into their characters. I have to put air quotes around this: we played D&amp;D, Connell said. I think we only ever played like two games. For us, it was a lot about making the characters. We talked about how cool they were, and all the adventures they got to go on. After a long hiatus from role-playing games - Connell tried becoming a musician, then switched to music therapy, ending up as an army psychologist treating soldiers with PTSD in Iraq and Fort Eustis, Virginia - Connell fell back into a regular D&amp;D game night with her family. Psychologists are historically bad at taking care of themselves, since we work on taking care of everyone around us, she said. D&amp;D was a game where I could unplug my brain and have fun. It recharged me, and I found it therapeutic. Related: Why cant anyone make a decision? My first time as a D&amp;D Dungeon Master Connell began listening to a D&amp;D podcast that featured an interview with Raffael Boccamazzo, a Seattle-based psychologist, who used the game to teach social skills to children on the autism spectrum. She learned that therapeutic D&amp;D was a burgeoning field. The practice Game to Grow, also based in Seattle, was founded in 2017 and now serves 150 clients. Another company, Geek Therapeutics, teaches therapists how to use the game in their work, and has a growing Rolodex of therapeutic game masters based around the country. But Connell says there is not enough clinical research to back up what she sees in her practice. Shes about to release a book, Tabletop Role-Playing Therapy: A Guide for the Clinician Game Master, which is full of disclaimers. Its ridiculous how much I had to say, We dont have research on this, and we dont know exactly whats going on, she said. During her book research, Connell found that there were a few case studies and pilot programs using tabletop therapy to teach social skills in the early 1980s, and the findings seemed promising. But then the research just dropped off. Connell believes this was because Satanic panic almost killed D&amp;D, as concerned parents and law enforcement tried to stamp out anything that seemed remotely connected to the occult. Tom Hanks starred in Mazes and Monsters. Photograph: Everett Collection IncAlamy In 1979, a D&amp;D prodigy and college student named James Dallas Egbert III went missing and was later found dead. Detectives ominously theorized that the game made him experience delusions that led to suicide. Mazes and Monsters, a subsequent made-for-television movie loosely based on the case, starred a very young and rather cherubic Tom Hanks. 60 Minutes aired a segment on a supposed rash of violence blamed on D&amp;D, and a parent of a fan who had killed himself unsuccessfully sued its creators. After that moral panic, studies into its effectiveness were shelved. Researchers only returned to studying therapeutic gaming in the 2000s. More foundational studies are required to track exactly how D&amp;D helps patients. But Connell says shes seen it work. Ive had several players talk to me about how getting to role-play saying no helps them do it in real life, she said. It can be really powerful learning how to stand up for yourself and have boundaries, and doing it in the game can really help translate a lived experience. Before we begin our session, Connell asks me if I have any phobias that I dont want to show up in the game - if Im afraid of spiders, for instance, she wont make the main villain a giant tarantula. I say Im game for anything except mice or rats, as Im currently dealing with an infestation in my kitchen ... which is also where Im Zooming into our meeting from. But Connell does want to see how my character, Goldie, will interact with something shes afraid of - hence the murderous mushroom man I came upon in the forest. If your character confronts something, and youre able to talk about it later, you can learn what helped your character through a panic attack, and brainstorm how to help yourself later when youre experiencing anxiety, Connell explained. After I decide Goldie wants to make a run for it, Connell asks me to roll the 20-sided dice. Shes making a survival check for my character - and luckily, Im able to find a path out of the dark woods. I get away from the fungi contagion and come upon a clear stream that leads to a small hamlet. What does my character want now? Food, I reply, and I head into the town center toward a communal oven. There, I encounter a halfling - a Tolkien-esque hobbit with pointed ears, often a sign of good luck. Using an accent that wouldnt sound out of place in a community theater production of The Banshees of Inisherin, Connell plays out our conversation. The halfling has heard of the mushroom blight a few miles south. He offers me a paltry amount of food and some silver pieces to lead a search party back down to the mushroom mans hideout. Will I go? Absolutely not. Goldie wants to stay in the town and rest for a while. We played a short game, and I didnt have any psychological breakthrough, but I imagine regular players might find the process therapeutic. It felt slightly ridiculous to picture myself - er, my character - traipsing through a forest wearing what I basically imagined to be a Daenerys Targaryen costume from Spirit Halloween. But there was something relaxing about adopting a character. It was a low-stakes way to test out behavior that the real me didnt have to commit to trying. I think about how Connell uses D&amp;D to teach young women and girls social skills and boundary-setting. I can see how that might work.","SOURCE":"The Guardian"},{"ID":"t3_v1znxq","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/v1znxq\/is_85_more_common_than_95\/","DATE":"2022-05-31","PLAIN_TEXT":"I just started as an intern at a company (ITCS internship) and when leaving, I was told to plan to work 8-5 with a 1 hour lunch break. Ill be working remote for the most part, but the 8-5 definitely caught me off guard as Ive usually been 9-5, including the paid 1 hour lunch break. Is this common?","SOURCE":"Reddit \/r\/cscareerquestions"},{"ID":"t3_f8tyy8","URL":"https:\/\/www.reddit.com\/r\/cscareerquestions\/comments\/f8tyy8\/finding_a_job_definitely_gets_easier_with\/","DATE":"2020-02-24","PLAIN_TEXT":"I always heard it gets easier finding a job once you have some experience, but Ive always had some doubt about how easy it was. I started off from a useless BA and did a coding boot camp in 2016, and subsequently submitted about 1000 applications in NorCalSoCal across 7-8 months where I got less than 10 phone screens and 1 offer for a crappy position.Fast forward 1.5 years after that first job and I started applying again. Submitted about 70 applications and got a few phone screens and 1 offer I couldnt refuse at an early stage startup in about 2 weeks. Definitely an improvement.Today, 1 year later (2.5 yrs of exp now), Ive been on the hunt for less than a week, sent out a little over 100 applications, and I already have 20+ phone screens and some onsites from places that seem great to work at.The point of this is that it definitely gets easier finding a job once you get more experience under your belt, even without a formal CS education. To everyone still trying to get their foot in the door, just stay disciplined and keep going.Edit: during this job search I sent 150+ applications over the span of a month, did 30-40 phone screens for frontend and fullstack roles, moved on to 10-15 onsites with multiple offers in the midst of the COVID outbreak. If youre motivated to learn and bring value and you have some experience, I think theres always a place for you.","SOURCE":"Reddit \/r\/cscareerquestions"}]